{
    "error": "",
    "downloadTitle": "Captions Language Interface Pack for Microsoft Visual Studio 2008",
    "downloadDescription": "The Microsoft Captions Language Interface Pack (CLIP) is a simple language translation solution that uses tooltip captions to display translations for English user interface terms.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "readme.htm",
            "url": "https://download.microsoft.com/download/c/b/5/cb514e9a-007f-42b7-89c6-2247785ee684/readme.htm",
            "size": "6938",
            "version": "1.0",
            "datePublished": "7/15/2024 3:26:57 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The Microsoft Captions Language Interface Pack (CLIP) is a simple language translation solution that uses tooltip captions to display translations for English user interface terms.<br />\n<br />\nCLIP is designed for those Visual Studio users who are not very fluent in English. CLIP can help those users learn and use Visual Studio 2008  by providing translation for the <i>most common</i> user interface elements of the Visual Studio Integrated Development Environment (IDE). CLIP is the result of the close collaboration between Microsoft and local  academic communities. <br />\n<br />\nTo use, simply move your mouse around the screen and halt briefly over any text you want translated. Users can also add their own translations and copy and paste any translation results.\n<br />\n<br />\nCLIP for Visual Studio 2008 is available in Arabic, Czech, Hebrew, Hindi, Malayalam, Oriya, Polish, Tamil and Turkish, i.e. it will display translations from English into these languages. To download it, please select your language from the drop-down box and click the <b>Change</b> button. You will be directed to the specific page.<br /><br />\n\nحزمة واجهة لغة التسميات التوضيحية (CLIP) لبرنامج Visual Studio 2008 متوفرة بالعربية والتشيكية والعبرية والهندية ومالايالام وأوريا والبولندية والتاميلية والتركية، أي أنها ستعرض الترجمات من الإنجليزية إلى هذه اللغات. لتنزيل الحزمة، يُرجى تحديد اللغة من المربع المنسدل والنقر فوق الزر <b>تغيير</b>.وسيتم توجيهك إلى الصفحة الخاصة بذلك.<br /><br />\n\nSada CLIP pro sadu Visual Studio 2008 je k dispozici v arabštině, češtině, hebrejštině, hindštině, malajálámštině, urijštině, polštině, tamilštině a turečtině, umožňuje tedy zobrazit překlady z angličtiny do těchto jazyků. Chcete-li tuto sadu stáhnout, vyberte z rozevíracího senamu jazyk a klepněte na tlačítko <b>Změnit</b>. Budete přesměrování na konkrétní stránku.<br /><br />\n\nCLIP עבור Visual Studio 2008 זמין בערבית, צ'כית, עברית, הינדי, מליאלאם, אוריה, פולנית, טמילית וטורקית, כלומר, יישום זה מציג תרגום מאנגלית לשפות אלה. כדי להוריד אותו, בחר את השפה מהתיבה הנפתחת ולחץ על לחצן <b>שנה</b>. פעולה זו תנתב אותך לדף הספציפי.<br /><br />\n\nVisual Studio 2008 के लिए CLIP अरबी, ज़ेक, हिब्रु, हिंदी, मलयालम, उड़ि‍या, पोलिश, तमिल, और तुर्किश में उपलब्ध है, अर्थात उसमें अंग्रेज़ी से इन भाषाओं में अनुवाद प्रदर्शित किए जाएँगे. इसे डाउनलोड करने के लिए, कृपया ड्रॉप डाउनलोड बॉक्स से अपनी भाषा चुनें और <b>बदलें</b> बटन क्लिक करें. आपको संबंधित पृष्ठ पर निर्देशित किया जाएगा.<br /><br />\n\nVisual Studio 2008 -നുള്ള CLIP അറബിക്, ചെക്ക്, ഹീബ്രു, ഹിന്ദി, മലയാളം, ഒറിയ, പോളിഷ്, തമിഴ്, ടര്ക്കി8ഷ് ഭാഷകളില്‍ ലഭ്യമാണ്, അതായത് ഇതില്‍ ഇംഗ്ലീഷില്നിരന്ന് ഈ ഭാഷകളിലേക്കുള്ള വിവര്ത്ത നം പ്രദര്ശിIപ്പിക്കപ്പെടും.. ഇത് ഡൌണ്ലോ്ഡ് ചെയ്യുന്നതിന് ഡ്രോപ്പ് ഡൌണ്‍ ബോക്സില്നിശന്നും ദയവായി നിങ്ങളുടെ ഭാഷ തിരഞ്ഞെടുക്കുകയും <b>ചെയ്ഞ്ച്</b> ബട്ടണ്‍ ക്ലിക്ക് ചെയ്യുകയും ചെയ്യുക.  നിങ്ങളെ നിര്ദ്ദി ഷ്ട പേജിലേക്ക് നയിക്കുന്നതാണ്.<br /><br />\n\nVisual Studio 2008 ପାଇଁ CLIP ଆରବୀୟ, ଚେକ, ହେବ୍ର୍ୟୁ, ହିନ୍ଦୀ, ମାଲାୟଲମ, ଓଡ଼ିଆ, ପଲିସ, ତାମିଲ ଏବଂ ତୁର୍କୀରେ ଉପଲବ୍ଧ ଅଟେ, ଯାହା ଦ୍ଵାରା ଏହି ଭାଷାଗୁଡ଼ିକରେ ଇଂରାଜୀରୁ ଅନୁବାଦ ଏହା ପ୍ରଦର୍ଶନ କରିଥାଏ । ଏହାକୁ ଡାଉନଲୋଡ କରିବାକୁ, ଦୟାକରି ଡ୍ରପ ଡାଉନ ବାକ୍ସରୁ ଆପଣଙ୍କ ଭାଷା ଚୟନ କରନ୍ତୁ ଏବଂ <b>ପରିବର୍ତ୍ତନ</b> ବଟନ କ୍ଲିକ କରନ୍ତୁ । ଆପଣ ଏହି ନିର୍ଦ୍ଦିଷ୍ଟ ପୃଷ୍ଟାଟିକୁ ନିର୍ଦ୍ଦେଶିତ ହୋଇଯିବେ ।<br /><br />\n\nVisual Studio 2008 க்கான CLIP அரபி, செக், ஹீப்ரு, இந்தி, மலையாளம், ஒரியா, போலிஷ், தமிழ், துருக்கி ஆகிய மொழிகளில் கிடைக்கிறது. அதாவது, ஆங்கிலத்திலிருந்து இந்த மொழிகளுக்கு மொழிபெயர்த்துக்காட்டும் வசதி அதில் இருக்கிறது. இதை பதிவிறக்கம் செய்துகொள்ள, உங்கள் மொழியை கீழ்விரிப் பட்டியிலிருந்து தேர்ந்தெடுத்துக்கொள்ளுங்கள். பிறகு <b>மாற்று</b> பட்டனைக் கிளிக் செய்யுங்கள். குறிப்பிட்ட பக்கத்துக்கு நீங்கள் கொண்டுசெல்லப்படுவீர்கள்.<br /><br />\n\nVisual Studio 2008 için CLIP uygulaması Arapça, Çekçe, İbranice, Hintçe, Malayalam dilinde, Oriya dilinde, Lehçe, Tamil dilinde ve Türkçe sunulmaktadır, bunun anlamı İngilizce’den bu dillere çevirilerin görüntülenebilir olmasıdır. Karşıdan yüklemek için lütfen aşağı açılan kutudan kendi dilinizi seçin ve <b>Değiştir</b> düğmesini tıklatın. İlgili dildeki belirli sayfaya yönlendirilirsiniz.<br /><br />\n\nProgram CLIP dla Visual Studio 2008 jest dostêpny w jêzyku arabskim, czeskim, hebrajskim, hindi, malajalam, orija, polskim, tamilskim i tureckim, co oznacza, ¿e wyœwietla on t³umaczenia z jêzyka angielskiego na wymienione powy¿ej. Aby go pobraæ, wybierz jêzyk z listy rozwijanej i kliknij przycisk <b>Zmieñ</b>. Nast¹pi przekierowanie na odpowiedni¹ stronê.<br /><br />",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.0",
    "detailsSection_file_name": [
        "readme.htm"
    ],
    "detailsSection_file_size": [
        "6.8 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<b>This download is customized for the following:</b> <br />\n<ul><br />\n<li>Microsoft Visual Studio 2008 Professional Edition</li><br />\n<li>Microsoft Visual Studio 2008 Standard Edition</li><br />\n<li>Microsoft Visual Basic 2008 Express Edition</li><br />\n<li>Microsoft Visual C# 2008 Express Edition</li><br />\n<li>Microsoft Visual C++ 2008 Express Edition</li><br />\n<li>Microsoft Visual Web Developer 2008 Express Edition</li><br />\n</ul><br />\n<br />\n<b>Pre-requisites:</b><br />\n<ul><br />\n<li>Microsoft CLIP requires that the .NET Framework 2.0 or higher version is installed on the user's computer. .NET Framework is already installed as part of Visual Studio so no further steps are required. However, if for any reasons you have removed the .NET Framework from your computer, please make sure to re-install it before installing CLIP.</li><br />\n</ul>",
    "systemRequirementsSection_supportedOS": [
        "Windows Server 2003 Service Pack 2",
        "Windows Server 2008",
        "Windows Vista Service Pack 1",
        "Windows XP Service Pack 3"
    ],
    "installInstructionSection": "<b>To install this download</b>:<br />\n<ul><br />\n<li>Follow the on-screen installation instructions.</li> <br />\n<li>When the installation completes, CLIP will start automatically.</li> <br />\n</ul><br />\n<b>Instructions for use:</b><br />\n<br />\n<ul><br />\n<li>Once installed, <b>Microsoft Captions Language Interface Pack (CLIP)</b> is already enabled and ready to display translations. All you need to do is move your cursor around the screen and delay briefly over the text you want translated.</li><br />\n<li>There are two types of interface available to show the translation results: the Tooltip caption or the CLIP window. To select how and when the translations are shown, set your preferences using the <b>Options</b> button (represented by two hammers) on the CLIP window, or <b>Options</b> on the system tray menu. </li><br />\n<li>To add a user translation, click on the <b>Add new translation</b> button (represented by a plus sign) in the CLIP window. Note, you can only have 1 user translation at one time. Moreover, CLIP will not show other translations until you have finished adding a user translation.</li><br/>\n<li>To edit a user translation, select the user translation in the  CLIP window and click on the down arrow in the translation text box. Note that default translations are not editable.</li><br />\n<li> To access the CLIP window for your selected source text, press the CLIP <b>Window Key + Hot-key</b>. You may then need to move the cursor around a little to bring up the selection menu. Users can copy translation results by using the <b>Copy</b> menu and pasting into other documents.</li><br />\n<li>To temporarily stop or start CLIP, double-click on the system tray icon. Use <b>Exit</b> to shutdown CLIP. </li><br />\n<li>At times the CLIP tooltip caption might get displayed underneath the Visual Studio button tooltips. You can therefore choose to disable the Visual Studio tooltips; to do so, Go to <b>Tools</b> menu, select <b>Customize</b> and uncheck the <b>Show ScreenTips on Toolbars</b> option.</li>\n</ul><br />\n<b>To remove this download:</b> <br />\n<ul><br />\n<li>Open the Control Panel from the Start menu.</li><br />\n<li>Select <b>Add</b> or <b>Remove Programs</b>. </li><br />\n<li>In the list of currently installed programs search for <b>Microsoft Captions Language Interface Pack</b> and uninstall your chosen language.</li><br />\n<li>Click <b>Remove</b> or <b>Add/Remove</b>. If a dialog box appears, follow the instructions to remove the program.</li> <br />\n<li>Click <b>Yes </b>or <b>OK</b> to confirm that you want to remove the program.</li><br />\n</ul>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "21610",
    "downloadPreload": true
}