{
    "error": "",
    "downloadTitle": "Visio 2016 SDK",
    "downloadDescription": "The Microsoft Visio 2016 Software Development Kit (SDK) contains the latest documentation, samples, header files, libraries, and tools that you need to develop custom solutions for Visio 2016.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "visiosdk_4288-1001_x86_en-us.exe",
            "url": "https://download.microsoft.com/download/3/8/a/38ae5c2a-1e71-4bf2-8f49-c88bafc716e4/visiosdk_4288-1001_x86_en-us.exe",
            "size": "7481736",
            "version": "2016",
            "datePublished": "7/15/2024 4:16:09 AM"
        },
        {
            "isPrimary": "False",
            "name": "visiosdk_4288-1001_x64_en-us.exe",
            "url": "https://download.microsoft.com/download/3/8/a/38ae5c2a-1e71-4bf2-8f49-c88bafc716e4/visiosdk_4288-1001_x64_en-us.exe",
            "size": "8246448",
            "version": "2016",
            "datePublished": "7/15/2024 4:16:09 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The Visio 2016 SDK contains the following items to help you develop custom solutions for Visio 2016:<br/>\r\nCode samples <br/>\r\n• Code Samples Library—Provides a database of reusable Visio code samples. <br/>\r\n• Flowchart sample application—Shows how to create a Component Object Model (COM) add-in that automates the creation of a flowchart drawing from an Excel spreadsheet. <br/>\r\n• TreeView sample application—Shows how to create a hierarchical drawing and its accompanying tree view in Visio. <br/>\r\n• Office Plan sample application—Shows how you can use the Visio 2016 Drawing Control to create an application that takes advantage of the drawing features of Visio 2016 in a Microsoft Windows Form. <br/>\r\n• Sample Visual Studio 2012 project – Sample project that can be used a template for VSL applications. <br/>\r\n• VSTO Add-in sample application—Shows how to create an add-in, based on Microsoft Office development tools in Microsoft Visual Studio 2012, that includes custom Visio content and is deployed by using ClickOnce installation. <br/>\r\nNote:  The Office development tools in Visual Studio were known as the Visual Studio Tools for Office (VSTO) in previous versions of Visual Studio. <br/> <br/>\r\nTools <br/>\r\n• Persistent Events tool—Provides a user interface that lets you add persistent events in an active Visio document and modify existing persistent events. <br/>\r\n• Event Monitor tool—Monitors and reports events that are raised by an instance of Visio, so you can debug a solution that handles events. <br/>\r\n• Print ShapeSheet tool—Provides a user interface that enables you to print the contents of a ShapeSheet. <br/>\r\n• Solution Publishing tool—Lets you add Visio-specific entries to the PublishComponent table of a Windows Installer (.msi) file for publishing custom Visio content. <br/> <br/>\r\nType libraries  <br/>\r\nThe Visio SDK provides three type libraries that Visio 2016 exposes. In addition, it provides support files to help C++ developers automate Visio. <br/> <br/>\r\nDocumentation  <br/>\r\nThe Visio SDK contains the Visio Automation Reference, Save as Web Reference, ShapeSheet Reference, Viewer Reference, and XML Schema Reference.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2016",
    "detailsSection_file_name": [
        "visiosdk_4288-1001_x86_en-us.exe",
        "visiosdk_4288-1001_x64_en-us.exe"
    ],
    "detailsSection_file_size": [
        "7.1 MB",
        "7.9 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "This download works with the following program: <br/>\r\n               Microsoft Visio 2016",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows 8",
        "Windows Server 2008 R2",
        "Windows Server 2008 Service Pack 2",
        "Windows Server 2012"
    ],
    "installInstructionSection": "To install this download\r\nThe Visio 2016 SDK is available in both 32-bit and 64-bit versions. Each contains a different version of the Persistent Events tool, the Event Monitor tool, and the Print ShapeSheet tool. To run the 32-bit versions of the tools, you must have 32-bit Visio 2016 MSI installed on your computer. To run the 64-bit versions, you must have 64-bit Visio 2016 MSI installed. To download the SDK, use the following instructions: <br/> <br/>\r\n1.Download the file by clicking the Download button for the appropriate SDK version and saving the file to your hard disk.  <br/>\r\n2.Double-click the visiosdk_4288-1001_x86_en-us.exe or visiosdk_4288-1001_x64_en-us.exe program file on your hard disk to start the setup program.  <br/>\r\n3.Follow the instructions on the screen to complete the installation. <br/> <br/>\r\nInstructions for use: <br/>\r\nAfter installation, refer to the included documentation and tools for use of the SDK. <br/> <br/>\r\nTo remove this download <br/>\r\n•To remove the download file, delete the visiosdk_4288-1001_x86_en-us.exe or visiosdk_4288-1001_x64_en-us.exe file from your hard disk <br/>\r\n•To remove the installed files, use Control Panel to uninstall Microsoft Visio 2016 SDK.\r\n ",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "51221",
    "downloadPreload": true
}