{
    "error": "",
    "downloadTitle": "Microsoft® Office Language Accessory Pack 2016 – Valencià",
    "downloadDescription": "El Microsoft Office Language Accessory Pack 2016 - Valencià afig més eines de visualització, ajuda o revisió en funció de la llengua en què l’instal·leu.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Office2016_LAP_Readme_ca-es-valencia.docx",
            "url": "https://download.microsoft.com/download/8/8/9/889a7be1-74b8-4f4c-b0c6-a5c0f930a73a/Office2016_LAP_Readme_ca-es-valencia.docx",
            "size": "22826",
            "version": "2016",
            "datePublished": "7/15/2024 4:15:32 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "El Microsoft Office Language Accessory Pack 2016 - Valencià afig més eines de visualització, ajuda o revisió en funció de la llengua en què l’instal·leu.<br />Després de la instal·lació, les capacitats i les opcions corresponents del Microsoft Office Language Accessory Pack 2016 - Valencià estan disponibles a les aplicacions de l'Office 2016 i a l'aplicació Preferències de llengua del Microsoft Office 2016. <br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2016",
    "detailsSection_file_name": [
        "Office2016_LAP_Readme_ca-es-valencia.docx"
    ],
    "detailsSection_file_size": [
        "22.3 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "\n      <ol>Microsoft Windows 8: sistema operatiu de 32 o 64 bits<br />Microsoft Windows 10: sistema operatiu de 32 o 64 bits<br /><b>Nota: </b>assegureu-vos d'instal·lar els Service Packs més recents del vostre sistema operatiu per garantir la màxima compatibilitat per a la vostra llengua.<br /></ol>\n<br /><b>Programari </b>Qualsevol versió del conjunt de productes de l'Office 2016 o qualsevol producte independent que continga el Microsoft Excel, el Microsoft Lync, el Microsoft OneNote, el Microsoft Outlook, el Microsoft PowerPoint o el Microsoft Word, o bé que siga compatible amb el Microsoft Office Language Accessory Pack 2016 - Valencià.<br /><b>Ordinador i processador </b>Processador d'1 GHz compatible amb SSE2 o versions posteriors; 2 GB de RAM o més<br />\n<br /><b>Espai de disc </b>A més de l'espai del disc dur que utilitzen les aplicacions de l'Office 2016 instal·lades,<br />\n<li>3 GB d'espai disponible al disc dur.</li><br />\n<li>Tots els altres requisits del sistema són els mateixos que els de les aplicacions de l'Office 2016 que utilitzeu amb el Microsoft Office Language Accessory Pack 2016 - Valencià.</li><br />\n<br /><b>Paquet d'interfície de llengua per al Windows </b>Es recomana instal·lar els Paquets d'interfície de llengua més recents per al Windows 8 o el Windows 10 per obtindre el màxim de compatibilitat per al sistema operatiu i les aplicacions de programari.<br />\n<br /><b>Resolució del monitor i configuració de ppp </b>Molts tipus de lletres s'han creat perquè es puguen llegir de manera òptima amb una resolució de 1366 x 768. Si teniu problemes per llegir el tipus de lletra de la vostra llengua, cal que actualitzeu la configuració de la pantalla amb esta resolució o amb una resolució superior si cal. Atenció: recomanem que utilitzeu les aplicacions de l'Office 2016 amb la configuració de ppp predeterminada del Windows: 96 ppp. L'ús de la configuració de 120 ppp pot provocar una experiència d'usuari de l'Office poc satisfactòria en determinades aplicacions de l'Office, ja que augmenta la mida dels quadres de diàleg de l'Office.<br />\n<br /><b>Opcions regionals i de llengua </b>A més, es recomana que totes les <b>Opcions regionals i de llengua</b> del <b>Tauler de control</b> es configuren amb la llengua del Microsoft Office Language Accessory Pack 2016 - Valencià.<br />\n<br />",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 7",
        "Windows 8"
    ],
    "installInstructionSection": "\n      <b>Per instal·lar este Language Accessory Pack:</b>\n      <br />\n<ol>\n<li>Feu clic a l’enllaç <a href=\"https://c2rsetup.officeapps.live.com/c2r/download.aspx?ProductreleaseID=languagepack&language=ca-es-valencia&platform=x86&source=O16LAP&version=O16GA\">Download Language Accessory Pack Installer</a> (Baixa l’instal·lador del Language Accessory Pack) per baixar el fitxer de l'instal·lador del <b>Language Accessory Pack</b>. </li>\n<li>Una vegada finalitzada la baixada, seleccioneu Executa.</li>\n<li>Seguiu les instruccions que apareguen en pantalla per completar la instal·lació.</li>\n</ol>\n<br /><b>Canvi de la interfície d'usuari a la llengua del Language Accessory Pack</b><br />Una vegada instal·lat el Language Accessory Pack, podeu canviar la llengua de la interfície d’usuari al valencià des de les aplicacions de l’Office 2016 o bé des de l'aplicació Preferències de llengua del Microsoft Office 2016.<br />\n<br />Per canviar la llengua de la interfície d’usuari des de les Preferències de llengua:<br />\n<br />\n<ol>\n<li>Inicieu les <b>Preferències de llengua de l’Office 2016</b>.</li>\n<li>Des de la llista <b>Tria de les llengües d'edició</b>, seleccioneu la vostra llengua d’edició i feu clic al botó <b>Configuració per defecte</b>.</li>\n<li>Des de les llistes de <b>Tria de les llengües de visualització i de l'ajuda</b>, seleccioneu la vostra <b>Llengua de visualització</b> i feu clic al botó <b>Configuració per defecte</b>.</li>\n<li>Feu clic al botó <b>D’acord</b>.</li>\n<br /></ol>Per canviar la llengua de la interfície d'usuari des d’una aplicació de l’Office 2016:<br />\n<br />\n<ol>\n<li>Aneu a <b>Fitxer, Opcions</b> i després seleccioneu <b>Llengua</b>.</li>\n<li>Des de la llista <b>Tria de les llengües d'edició</b>, seleccioneu la vostra llengua d’edició i feu clic al botó <b>Configuració per defecte</b>.</li>\n<li>Des de les llistes de <b>Tria de les llengües de visualització i de l'ajuda</b>, seleccioneu la vostra <b>Llengua de visualització</b> i feu clic al botó <b>Configuració per defecte</b>.</li>\n<li>Feu clic al botó <b>D’acord</b>.</li>\n<br /></ol>La configuració de llengua que hàgeu seleccionat tindrà efecte la pròxima vegada que inicieu les aplicacions de l’Office.<br />\n<br /><b>Canvi de la llengua de correcció </b><br />El Microsoft Office Language Accessory Pack 2016 - Valencià pot incloure eines de revisió en la vostra llengua. Així és com es canvia de llengua de correcció per a una selecció de text:<br />\n<br /><b>Excel</b>: l’Excel utilitza la configuració de llengua d’edició principal del Microsoft Office per determinar la llengua de correcció per defecte. Per canviar-ho, feu clic a <b>Fitxer</b> i després feu clic a <b>Opcions</b>. Feu clic a l’opció <b>Revisió</b> i trieu una de les llengües disponibles a la llista <b>Llengua del diccionari</b>.<br />\n<br /><b>Outlook, PowerPoint, Word i OneNote:</b> seleccioneu el text en què vulgueu comprovar l’ortografia, feu clic a <b>Revisa</b>, feu clic al botó <b>Llengua</b> i després feu clic a l’opció <b>Defineix la llengua de correcció</b>. Seleccioneu la llengua que vulgueu del quadre de llista i feu clic a <b>D’acord</b>.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "51607",
    "downloadPreload": true
}