{
    "error": "",
    "downloadTitle": "Microsoft SQL Server Migration Assistant for Oracle",
    "downloadDescription": "Microsoft SQL Server Migration Assistant (SSMA) for Oracle is a tool to automate migration from Oracle database(s) to SQL Server, Azure SQL Database and Azure SQL Database Managed Instance.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "SSMAforOracle_9.5.0.msi",
            "url": "https://download.microsoft.com/download/1/2/6/126b0be5-7731-4070-9ab1-73828d419781/SSMAforOracle_9.5.0.msi",
            "size": "13352960",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        },
        {
            "isPrimary": "False",
            "name": "SSMAforOracle_9.5.0_x86.msi",
            "url": "https://download.microsoft.com/download/1/2/6/126b0be5-7731-4070-9ab1-73828d419781/SSMAforOracle_9.5.0_x86.msi",
            "size": "13352960",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        },
        {
            "isPrimary": "False",
            "name": "SSMAforOracleExtensionPack_9.5.0.msi",
            "url": "https://download.microsoft.com/download/1/2/6/126b0be5-7731-4070-9ab1-73828d419781/SSMAforOracleExtensionPack_9.5.0.msi",
            "size": "4329472",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        },
        {
            "isPrimary": "False",
            "name": "SSMAforOracle_10.1.25090.msi",
            "url": "https://download.microsoft.com/download/8ebc6280-5455-4b78-8b85-87fc5212e872/SSMAforOracle_10.1.25090.msi",
            "size": "42344448",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        },
        {
            "isPrimary": "False",
            "name": "SSMAforOracle_10.1.25090_x86.msi",
            "url": "https://download.microsoft.com/download/8ebc6280-5455-4b78-8b85-87fc5212e872/SSMAforOracle_10.1.25090_x86.msi",
            "size": "42344448",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        },
        {
            "isPrimary": "False",
            "name": "SSMAforOracleExtensionPack_10.1.25090.msi",
            "url": "https://download.microsoft.com/download/8ebc6280-5455-4b78-8b85-87fc5212e872/SSMAforOracleExtensionPack_10.1.25090.msi",
            "size": "7553024",
            "version": "10.1",
            "datePublished": "4/1/2025 10:47:52 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "SQL Server Migration Assistant (SSMA) is a free supported tool from Microsoft that simplifies database migration process from Oracle to SQL Server, Azure SQL Database and Azure SQL Database Managed Instance. SSMA automates all aspects of migration including migration assessment analysis, schema and SQL statement conversion, data migration as well as migration testing. \n<br/><br/>\nThis download includes a GUI client based application to manage migration process as well as SSMA extension pack to be installed on target SQL Server or Azure SQL Database Managed Instance. The SSMA extension pack includes functionalities to emulate Oracle features not natively supported in SQL Server and Azure SQL Database Managed Instance, tester database to support SSMA Testing features, and an application to facilitate direct server-to-server data migration. \n<br/><br/>\nSSMA for Oracle is designed to support migration from Oracle 12.0 or later version to all edition of SQL Server 2016 onwards, Azure SQL Database and Azure SQL Database Managed Instance.\n<br/><br/>",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "10.1",
    "detailsSection_file_name": [
        "SSMAforOracle_9.5.0.msi",
        "SSMAforOracle_9.5.0_x86.msi",
        "SSMAforOracleExtensionPack_9.5.0.msi",
        "SSMAforOracle_10.1.25090.msi",
        "SSMAforOracle_10.1.25090_x86.msi",
        "SSMAforOracleExtensionPack_10.1.25090.msi"
    ],
    "detailsSection_file_size": [
        "12.7 MB",
        "12.7 MB",
        "4.1 MB",
        "40.4 MB",
        "40.4 MB",
        "7.2 MB"
    ],
    "detailsSection_file_date": "4/1/2025",
    "systemRequirementsSection": "<ul>\n<li>Windows 10+, Windows Server 2016+</li>\n</ul>\n<br/>\n<b>Requirements for the SSMA for Oracle client:</b>\n<ul>\n<li>The Microsoft .NET 8.0 or a later version. You can obtain it from the .NET Developer Center.</li>\n<li>Oracle Client 12.0 or a later version, and connectivity to the Oracle databases that you want to migrate. The Oracle client version must be the same version as, or a later version than, the Oracle database version.</li>\n<li>Access to and sufficient permissions on the computer that hosts the target instance of SQL Server.</li>\n<li>4 GB RAM.</li>\n</ul>",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 7",
        "Windows 8",
        "Windows 8.1",
        "Windows Server 2008 R2",
        "Windows Server 2012",
        "Windows Server 2012 R2",
        "Windows Server 2016"
    ],
    "installInstructionSection": "After the download, you must install SSMA for Oracle. \n<br/>\n<br/>\n<b>Installing the SSMA for Oracle Client</b>\n<ol>\n<li>Double-click SSMAforOracle_<i>n</i>.msi, where <i>n</i> is the version number.</li>\n<li>On the 'Welcome' page, click Next.</li>\n<li>If you do not have the prerequisites installed, a message will appear that indicates that you must first install required components. Make sure that you have installed all prerequisites, and then run the installation program again.</li>\n<li>Read the End User License Agreement. If you agree to the terms, select \"I accept the agreement\" option and click Next.</li>\n<li>On the 'Choose Setup Type' page, click Typical.</li>\n<li>Click Install.</li>\n</ol>\n<br/>\nIn addition to the SSMA program files, you must also install the SSMA for Oracle Extension Pack on the SQL Server machine. \n<br/><br/>\n<b>Installing the SSMA for Oracle Extension Pack</b>\n<br/>\nInstalling the extension pack creates new database, sysdb, on the instance of SQL Server. The extension pack adds tables, stored procedures, and user-defined functions.\n<ol>\n<li>Double-click SSMA for SSMAforOracleExtensionPack_<i>n</i>.msi file, where <i>n</i> is the version number.</li>\n<li>On the 'Welcome' page, click Next.</li>\n<li>Read the End User License Agreement. If you agree to the terms, select \"I accept the agreement\" option and click Next.</li>\n<li>On the 'Choose Setup Type' page, click Typical.</li>\n<li>On the 'Ready to Install' page, click Install.</li>\n<li>On the 'Completed the First Step of Installation' page, click Next. A new dialog box will appear, in which you select the target SQL Server platform for the extension pack installation.</li>\n<li>Select the target SQL Server platform and click Next. If installing Extension Pack for SQL Server running on Windows, then new dialog will appear asking you to select a local SQL Server instance. For SQL Server on Linux next step is skipped.</li>\n<li>Select the instance of SQL Server where you will be migrating Oracle schemas, and then click Next. The default instance has the same name as the computer. Named instances will be followed by a backslash and the instance name.</li>\n<li>On the connection page, select the authentication method and then click Next. Windows Authentication will use your Windows credentials to try to log on to the instance of SQL Server. If you select SQL Server Authentication, you must enter a SQL Server login name and password.</li>\n<li>On the next page, select Install Utilities Database <i>n</i>, where <i>n</i> is the version number, and then click Next. The sysdb database is created and the user-defined functions and stored procedures are created in that database.</li>\n<li>To install the utilities to another instance of SQL Server, select Yes, and then click Next. Or, to exit the wizard, click No.</li>\n</ol>\n<b>NOTE:</b> Extension pack functionality is limited when running SQL Server on Linux or Azure SQL Database Managed Instance: server-side data migration. Azure SQL Database and Azure SQL Data Warehouse do not support extension pack.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "54258",
    "downloadPreload": true
}