{
    "error": "",
    "downloadTitle": "Microsoft’s global supply chain business technologies (SCBT) and BizTalk360",
    "downloadDescription": "Read how Microsoft’s global supply chain business technologies (SCBT) uses BizTalk360 to manage and monitor one of the most complex integration solutions in the world.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "BizTalk360_Case_Study_MAR15-2017.pdf",
            "url": "https://download.microsoft.com/download/7/d/7/7d791bbc-f0c9-46dd-a099-a730a373507d/BizTalk360_Case_Study_MAR15-2017.pdf",
            "size": "1076490",
            "version": "1.0",
            "datePublished": "7/15/2024 4:40:25 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The Supply Chain Business Technologies (SCBT) is Microsoft’s Global Supply Chain Management group. All Microsoft products, such as Surface, Xbox, and other hardware and software, are sold in the market, and sold through different channels, such as retail outlets, online stores, and so on. The SCBT team relies heavily on these systems to process financial transactions, including orders from vendors, and orders from customers. To deliver smooth operations, and cater to the demand generated by retailers, manufacturers, and online customers, the SCBT group built a Hybrid integration solution that leverages BizTalk Server and Azure Services to manage high volume global transactions. Because of the growing demand and the complexity of the integration solution, the SCBT team faced the need to make sure every transaction is monitored and the system processes these transactions fluently. \r\n\r\nRead how SCBT uses BizTalk360 to manage and monitor one of the most complex integration solutions in the world.\r\n\r\nAuthors: Anil Kongari, Microsoft; Tord Glad Nordahl, Microsoft; Saravana Kumar, BizTalk360; Sriram Hariharan, BizTalk360",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.0",
    "detailsSection_file_name": [
        "BizTalk360_Case_Study_MAR15-2017.pdf"
    ],
    "detailsSection_file_size": [
        "1.0 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "PDF reader",
    "systemRequirementsSection_supportedOS": [
        "Windows Server 2016"
    ],
    "installInstructionSection": "Download the PDF",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "54944",
    "downloadPreload": true
}