{
    "error": "",
    "downloadTitle": "Cloud Hosting Summit 2017 - March 22 Breakouts ",
    "downloadDescription": "Cloud Hosting Summit 2017 - March 22 Breakouts",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Cloud MSP - Accelerating Innovation in Azure.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Cloud MSP - Accelerating Innovation in Azure.pdf",
            "size": "4119217",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Licensing - Modern Licensing for Cloud Solutions.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Licensing - Modern Licensing for Cloud Solutions.pdf",
            "size": "2370581",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Marketing - Success with Azure Beyond the Enterprise.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Marketing - Success with Azure Beyond the Enterprise.pdf",
            "size": "7912305",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Infra - Remote Desktop Services.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Infra - Remote Desktop Services.pdf",
            "size": "4869015",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Cloud MSP - DevOps and Automation on Azure.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Cloud MSP - DevOps and Automation on Azure.pdf",
            "size": "2513171",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Apps - Cloud economics and the importance of selling business value to drive digital transformation.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Apps - Cloud economics and the importance of selling business value to drive digital transformation.pdf",
            "size": "2541836",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Marketing - Building Infrastructure Offers that Win.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Marketing - Building Infrastructure Offers that Win.pdf",
            "size": "5478966",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Cloud MSP - Managed Services on Azure.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Cloud MSP - Managed Services on Azure.pdf",
            "size": "3446334",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Apps - Driving Office 365 Sales Velocity and Building Customer Trust.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Apps - Driving Office 365 Sales Velocity and Building Customer Trust.pdf",
            "size": "3771151",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Cloud MSP - Growth acceleration with Azure in a consumption world_Scott Guthrie.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Cloud MSP - Growth acceleration with Azure in a consumption world_Scott Guthrie.pdf",
            "size": "1293988",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Apps - Build with Office 365.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Apps - Build with Office 365.pdf",
            "size": "6249850",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Infra - Leveraging Data Platform and Analytics to win customer deals.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Infra - Leveraging Data Platform and Analytics to win customer deals.pdf",
            "size": "4796060",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        },
        {
            "isPrimary": "False",
            "name": "Infra - Workload and Application migration to Azure.pdf",
            "url": "https://download.microsoft.com/download/e/1/e/e1eaf4cc-ef4b-4dae-bdbd-579eaf7f2d64/Infra - Workload and Application migration to Azure.pdf",
            "size": "2765345",
            "version": "March 22 2017",
            "datePublished": "7/15/2024 4:40:25 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Download one or all of the Microsoft Cloud and Hosting Summit 2017 presentations from the breakouts on Wednesday March 22nd. This invite-only event brings together the leading worldwide cloud service providers which include pure-play hosters, Telco’s, MSPs, ISVs and SI.\r\n\r\n\r\nCloud MSP Breakout \r\nAccelerating Innovation in Azure: Sneak preview of new and upcoming Azure Services to help grow your business\r\nMining your existing customers to drive incremental customers is key to business growth besides acquiring net new customers. Keep up with the pace of innovation @ Azure and learn about the new & upcoming Azure Services that you need to include in your tool-kit to grow your business.\r\n\r\nFocusing on DevOps & Automation to build a profitable managed services business on Azure\r\nRunning a Profitable Managed Services business relies on DevOps expertise and singular focus on automation. In this session, come learn how to leverage the power of ARM Templates, Azure Functions, Azure Automation (w/ DSC) and configuration management in a modern continuous release DevOps CI/CD environment. We will share how a typical Azure Service uses DevOps & automation to their own advantage internally as well as focus on Secure DevOps and insights into removing objections.\r\n\r\nManaged Services on Azure: Microsoft Priorities and Investments\r\nMicrosoft is a partner-led company and Cloud MSPs are key to driving Azure consumption. Microsoft is making significant investments and removing friction points to help Cloud MSPs acquire net new customers and grow consumption with existing ones with a focus on your growth and profitability. Unlocking these is key to our joint success… \r\n\r\nGrowth Acceleration with Azure in a Consumption World\r\n\r\nApplications Breakout: Cloud economics and the importance of selling business value to drive digital transformation\r\nThe speakers will cover some important principles in cloud economics, and how the focus on differentiation and customer success can boost overall profitability. But to do that, a partner must also have developed their cloud practices to support their growth, which we will share as the building block for a successful cloud practice. We also cover the latest CSP incentives, and some great practices straight from some of the most successful partners in CSP.  \r\n\r\nInfrastructure Breakout: Workload and Application migration to Azure – your path to recurring revenue!\r\nFor service providers, the ability to assess, migrate, manage and optimize customer workloads is critical to building a recurring cloud managed services revenue stream. In this session you will learn about the key opportunities our customers’ transition to public cloud presents you as a service provider, some of the key capabilities these customers are looking to consume, Microsoft Azure cloud migration framework, tools and best practices that you can leverage to build a scalable cloud migration practice. We will also hear from some of our partners who are already profiting from thriving cloud migration practices.  \r\n\r\nMarketing Breakout: Building Infrastructure Offers that Win. On Your Mark, Get Set, GO!\r\nIn this session we will look at ISVs and Infrastructure buyers and identify key offerings that are working in market and how to entice movement through infrastructure assessments and data platform activities.\r\n\r\nApplications Breakout: Driving Office 365 Sales Velocity and Building customer trust - by investing in vertical offers \r\nUnderstand how investing in vertical offers creates stickiness and value add for your customers - enabling you to drive Office 365 sales and build customer trust, cross-sell cloud workloads and maximize the customer’s quality of experience with partner services.\r\n\r\nInfrastructure Breakout: How Data Platform and Intelligent Services can make you win new customer deals\r\nJoin this session to learn from Microsoft and partners how Data Platform and Intelligence Services can be key to transform your practices into a real value added Solutions and Products. Hosters and Managed Service Providers can take advantage of customer’s data in many ways, so you can differentiate and win new opportunities in the market by driving Digital Transformation.   \r\n\r\nLicensing Breakout: Modern Licensing for Cloud Solutions\r\nIn this session you will learn about recent updates to Microsoft licensing programs for Cloud & Hosting partners. Modern licensing enables you to leverage Microsoft software & Online Services for your hybrid cloud solutions. We will discuss the Microsoft services presented in breakout sessions from a licensing perspective. We will also touch on Azure Stack licensing for service providers.  \r\n\r\nApplications Breakout: Build with Office 365 - Modern Meetings and Security As A Service\r\nThis session will provide insight on how to help increase your average revenue per Office 365 user and drive higher customer lifetime value.\r\n\r\nInfrastructure Breakout: Remote Desktop Services (RDS): Why do you support 24x7 infrastructure for apps that run from 8 AM - 5 PM?\r\nWith scripting or support from the ISVs, service providers can take advantage of the application and desktop usage patterns on Azure. This 8AM to 5PM RDS optimization and infrastructure scaling is native to cloud. It allows for 30%-70% ongoing infrastructure cost savings and drives margin expansion and/or addressing needs of new customers segments. In this session we will share with you business model for the RDS to Azure transformation, examples of partners taking on this opportunity and point you towards tools and partners that will make that transition easier.  \r\n\r\nMarketing Breakout: Success with Azure Beyond the Enterprise - Making Azure Relevant for All Segments\r\nLearn how to leverage Azure’s hyper scale availability and Enterprise class feature set to develop, reach, attract and support new segments and technology channels. From SMBs to ISVs – Azure, combined with your brand and unique competencies, provides a platform to explore and enable untapped product bundles, attach scenarios and revenue streams. In this session you will hear from key US and WW infrastructure marketing leads about current midmarket and SMB market trends and how to translate the expanding opportunity of IT transformation into actionable steps to accelerate your Azure and Microsoft technology practice.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "March 22 2017",
    "detailsSection_file_name": [
        "Cloud MSP - Accelerating Innovation in Azure.pdf",
        "Licensing - Modern Licensing for Cloud Solutions.pdf",
        "Marketing - Success with Azure Beyond the Enterprise.pdf",
        "Infra - Remote Desktop Services.pdf",
        "Cloud MSP - DevOps and Automation on Azure.pdf",
        "Apps - Cloud economics and the importance of selling business value to drive digital transformation.pdf",
        "Marketing - Building Infrastructure Offers that Win.pdf",
        "Cloud MSP - Managed Services on Azure.pdf",
        "Apps - Driving Office 365 Sales Velocity and Building Customer Trust.pdf",
        "Cloud MSP - Growth acceleration with Azure in a consumption world_Scott Guthrie.pdf",
        "Apps - Build with Office 365.pdf",
        "Infra - Leveraging Data Platform and Analytics to win customer deals.pdf",
        "Infra - Workload and Application migration to Azure.pdf"
    ],
    "detailsSection_file_size": [
        "3.9 MB",
        "2.3 MB",
        "7.5 MB",
        "4.6 MB",
        "2.4 MB",
        "2.4 MB",
        "5.2 MB",
        "3.3 MB",
        "3.6 MB",
        "1.2 MB",
        "6.0 MB",
        "4.6 MB",
        "2.6 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "N/A",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 7",
        "Windows 8"
    ],
    "installInstructionSection": "Choose download and select one or all PDF files to save to your computer for review.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "54945",
    "downloadPreload": true
}