{
    "error": "",
    "downloadTitle": "Cloud Hosting Summit 2017 - March 21 Workshops",
    "downloadDescription": "Cloud Hosting Summit 2017 - March 21 Workshops",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Lenovo Considersations when Building and Enhancing Your Hybrid Cloud Environment.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Lenovo Considersations when Building and Enhancing Your Hybrid Cloud Environment.pdf",
            "size": "616495",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Best Practices about Office 365 Research.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Best Practices about Office 365 Research.pdf",
            "size": "3421376",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Selling Business Productivity Solutions.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Selling Business Productivity Solutions.pdf",
            "size": "6446160",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Cisco Integrated System on Cisco Azure Stack.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Cisco Integrated System on Cisco Azure Stack.pdf",
            "size": "5525734",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "HPE Session Accelerate your Azure Hybrid Cloud Business .pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/HPE Session Accelerate your Azure Hybrid Cloud Business .pdf",
            "size": "2084508",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Azure Selling Best Practices.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Azure Selling Best Practices.pdf",
            "size": "3857881",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Partner Center and tools to help you transact.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Partner Center and tools to help you transact.pdf",
            "size": "2379717",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "HGST_Unlock the Business Value of Spaces Direct with Western Digital and DataON.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/HGST_Unlock the Business Value of Spaces Direct with Western Digital and DataON.pdf",
            "size": "3782580",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Reinvent or Die_ How to survive the era of digital transformation.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Reinvent or Die_ How to survive the era of digital transformation.pdf",
            "size": "11680380",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Transforming your business with Azure and Microsoft Cloud Platform.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Transforming your business with Azure and Microsoft Cloud Platform.pdf",
            "size": "2888911",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "Harnessing Cloud to Monetize the IoT Explosion.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/Harnessing Cloud to Monetize the IoT Explosion.pdf",
            "size": "3128139",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        },
        {
            "isPrimary": "False",
            "name": "SkyKick-Microsoft-Hosting-Summit-2017.pdf",
            "url": "https://download.microsoft.com/download/b/a/2/ba2dc8a9-0cd8-4c6a-8c90-ffdc9d942fdc/SkyKick-Microsoft-Hosting-Summit-2017.pdf",
            "size": "1765368",
            "version": "March 21 2017",
            "datePublished": "7/15/2024 4:35:21 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Download one or all of the Microsoft Cloud and Hosting Summit 2017 presentations from the workshops on Tuesday March 21st. This invite-only event brings together the leading worldwide cloud service providers which include pure-play hosters, Telco’s, MSPs, ISVs and SI.\r\n\r\nCSP Lounge - Grand Foyer\r\nThe Cloud Solution Provider Program (CSP) Lounge will be open on Tuesday, March 21 from 10 AM - 5 PM. This will be your opportunity to talk and meet with solution experts on CSP products (Office 365, Azure, Sky for Business, EMS and others). There will also be the opportunity to get live demos around some of the new workloads to better position them with your customers.  \r\n \r\nSkyKick Session: Scalable, Sticky, High-Margin Cloud revenue with O365 & Azure\r\nLarge IT Cloud Solution Providers are pursuing a transformational cloud opportunity. The best are finding ways to build revenue streams that are not just high-margin, but also drive stickiness with their target customers and have huge upside potential. SkyKick's work on the front-lines of cloud management with Office 365 and Azure has given us a perspective on how large cloud solution providers are grabbing the opportunity. In this session, SkyKick execs will share best practices and tips that can help you to unlock the opportunity.  \r\n\r\nLenovo Session: Considerations when Building and Enhancing Your Hybrid Cloud Environment\r\nJoin Lenovo for a panel discussion to explore the challenges finding an easy to install, reliable and manageable cloud infrastructure. The panel discussion will discuss various solutions for cloud or cloud-connected environments spanning individual, department/branch and enterprise solutions - for private or hybrid cloud. The panel will be asked to touch on how a broad range of customers’ requirements can be accommodated from a cloud-connected edge device to racks of servers in a service provider. Come and join us and find out more.  \r\n\r\nHGST Session: Unlock the Business Value of Spaces Direct with Western Digital and DataON\r\nThe ROI from the strategic investments you make in Storage Spaces Direct during the coming year will depend on which vendors’ products you choose. Learn why the largest cloud providers rely on Western Digital and its HGST and SanDisk branded products, and how DataON Storage delivers storage systems optimized for Windows Server environments. You’ll see a live demo of DataON MUST, a new management solution for at-a-glance management of Spaces Direct environments.  \r\n\r\nCisco Session: Cisco Integrated System on Cisco Azure Stack\r\nOn February 9th Cisco announced its intention to provide Integrated Systems for Microsoft’s Azure Stack solution. Cisco provides a unique value prop for Azure Stack by leveraging the strong joint engineering relationship combined with best practices from the broader portfolio of Cisco’s cloud offerings. From this presentation, it will become clear why Cisco must be considered as a primary candidate for any Azure Stack installation.  \r\n\r\nHewlett Packard Enterprise Session: Accelerate Your Azure Hybrid Cloud Business with HPE\r\nThe ongoing rapid market acceptance of Microsoft Azure, the robust growth of managed cloud services and the upcoming release of Microsoft Azure Stack is creating an exceptional opportunity for service providers to increase their business by delivering Azure consistent services. HPE is partnering with Microsoft to help you take advantage of this situation. Join us to learn how HPE can help you accelerate your business with Microsoft Azure Stack.   \r\n\r\nReinvent or die: how to survive the era of digital transformation\r\nThe market is changing. Customers are changing. Perceptions are changing. Cloud is disrupting the service provider business at the speed of light. The key to survival? Reinventing your business, with a clear focus on modern marketing. During the workshop, Maarten will discuss all relevant aspects of modern marketing and show you examples of how you can reinvent your business. Let the reinvention begin. www.paal15.com  \r\n\r\nAzure Selling Best Practises\r\nCome learn how to position and sell Azure to your customers. We’ll share best practices, top questions almost all customers ask and key things to position to improve your close rates.\r\n\r\nSelling Business Productivity Solutions at Scale to SMB Customers\r\nIn this session we’ll go through 3 steps to uncover your cross and upsell potential in a scalable and repeatable way across Microsoft Cloud Productivity Services. Also, there will be a special emphasis on building a channel motion.\r\n\r\nTransforming Your Business with Azure and Microsoft Cloud Platform: 2 customer perspectives\r\nCompanies across many industries are transforming their business models and delivery capabilities by leveraging cloud-based deployments. Find out how a healthcare provider and a security software vendor are using the cloud to innovate and accelerate their businesses.\r\n\r\nBest Practises about Research about Office 365 and methods to identify what customers want to buy next\r\nLearn from two of our research firms about what customers are buying, why they are buying it, and what they want to buy next. See how to scorecard your own performance using public data and consider adding Net Promoter Score research on the end of every sale.\r\n\r\nPartner Center and Tools to help you Transact\r\nIn this session we will discuss the features of Partner Center, latest updates the platform and how it can help you transact and scale. Plus we will be discussing open source tools to quickly teach how to use the available CSP APIs for management, reporting and analytics.\r\n\r\nHarnessing Cloud to Monetize the IoT Explosion\r\nIoT is rapidly reshaping all aspects of our lives. By 2020, 30B sensors will be connected to the Internet. The data from these sensors is enabling companies to truly transform their business models. Come and learn about Microsoft customers that are already leveraging Azure to power their IoT investments and build new revenue streams.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "March 21 2017",
    "detailsSection_file_name": [
        "Lenovo Considersations when Building and Enhancing Your Hybrid Cloud Environment.pdf",
        "Best Practices about Office 365 Research.pdf",
        "Selling Business Productivity Solutions.pdf",
        "Cisco Integrated System on Cisco Azure Stack.pdf",
        "HPE Session Accelerate your Azure Hybrid Cloud Business .pdf",
        "Azure Selling Best Practices.pdf",
        "Partner Center and tools to help you transact.pdf",
        "HGST_Unlock the Business Value of Spaces Direct with Western Digital and DataON.pdf",
        "Reinvent or Die_ How to survive the era of digital transformation.pdf",
        "Transforming your business with Azure and Microsoft Cloud Platform.pdf",
        "Harnessing Cloud to Monetize the IoT Explosion.pdf",
        "SkyKick-Microsoft-Hosting-Summit-2017.pdf"
    ],
    "detailsSection_file_size": [
        "602.0 KB",
        "3.3 MB",
        "6.1 MB",
        "5.3 MB",
        "2.0 MB",
        "3.7 MB",
        "2.3 MB",
        "3.6 MB",
        "11.1 MB",
        "2.8 MB",
        "3.0 MB",
        "1.7 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "N/A",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 7",
        "Windows 8"
    ],
    "installInstructionSection": "Choose download and select one or all PDF files to save to your computer for review.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "54947",
    "downloadPreload": true
}