{
    "error": "",
    "downloadTitle": "Telemetry Investigation Logging Tool",
    "downloadDescription": "Tool used to validate client device setup to identify issues with data collection needed for diagnostics and reporting",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "TelemetryInvestigationLoggingTool.exe",
            "url": "https://download.microsoft.com/download/d/3/7/d379f531-e612-484d-93b7-2e785a524b31/TelemetryInvestigationLoggingTool.exe",
            "size": "92435880",
            "version": "1.2.0",
            "datePublished": "1/27/2025 9:48:05 PM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "This tool is designed to collect data needed to diagnose issues with the M365 diagnostic data collection and transmission needed for application issue investigation and the delivery of certain reporting tools like the Admin Dashboard and Viva Insights. The tool itself does not send any information off the device, rather it creates a ZIP file that you can choose to provide to support to assist in investigations. ",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.2.0",
    "detailsSection_file_name": [
        "TelemetryInvestigationLoggingTool.exe"
    ],
    "detailsSection_file_size": [
        "88.2 MB"
    ],
    "detailsSection_file_date": "1/27/2025",
    "systemRequirementsSection": "The tool must be run by the user and on the device that is experiencing an issue with the usage being captured. ",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 11"
    ],
    "installInstructionSection": "<ul>\r\n    <li>Download the TelemetryInvestigationLoggingTool.exe using the download button above.</li>\r\n    <li>Once downloaded copy the executable into a folder where you would like to run it from and where the output logs of the tool will be generated.</li>\r\n    <li>To run the tool, open a command prompt and navigate to the folder where you placed the executable.</li>\r\n    <li>Run the executable at the command prompt:\r\n        <ul>\r\n            <li><b>TelemetryInvestigationLoggingTool.exe [-h | -help] [-path &lt;output_path&gt;]</b></li>\r\n        </ul>\r\n    </li>\r\n    <li>This will run the tool and generate the output logs.</li>\r\n</ul>",
    "additionalInformationSection": "If the tool can diagnose an issue, then the tool will list potential mitigation steps that you may choose to follow to help enable proper collection of information needed to power reporting experiences. Please review these potential mitigations and take action to correct them as appropriate for your environment.\r\n<br/>\r\nThe tool will produce a structured set of folders containing the output of the tool run, in addition, a ZIP file with that content is also created to simplify packaging of the data if you choose to provide it to Microsoft support.\r\n<ul>\r\n    <li>The output can be found in a \"TILT Output\" folder, located in the same directory as the executable or in a directory specified in the command line when the tool was run. You will also find a \"TILT Output.zip\" file in this same folder which is the packaged output.</li>\r\n    <li>The \"TILT Output\" folder contains a series of subfolders that hold the collected information. We strongly recommend reviewing the contents of these folders before providing the ZIP file or these folders to Microsoft to ensure you are comfortable with the information being provided.\r\n        <ul>\r\n            <li>TILT Generated Metadata - Contains 2 files generated by the tool\r\n           <ul>\r\n              <li>TILT_Mitigation_Steps.txt - contains a record of any proposed mitigations that the tool provided during its run. This file is a great resource for following up on mitigations so that you can review them at your leisure.</li>\r\n              <li>TILT_Tool_Logs.txt – This file contains the information that was gathered by the tool and provides an opportunity for you to review the information before providing it to support.</li>\r\n           </ul>\r\n        </li>\r\n        </ul>\r\n        <ul>\r\n            <li>Rules Files\r\n           <ul>\r\n              <li>These are files that are included with the Office applications that include details on the type of telemetry that is enabled on the client. Collecting them allows us to determine if they are out of date.</li>\r\n           </ul>\r\n        </li>\r\n        </ul>\r\n        <ul>\r\n            <li>Collected Office Diagnostic Logs\r\n           <ul>\r\n              <li>This collects any diagnostic logs that have been generated on the client. The generation of these logs is governed by your privacy controls so it is possible that some of the subfolders under this path will be empty.</li>\r\n           </ul>\r\n        </li>\r\n        </ul>\r\n  </li>\r\n</ul>",
    "relatedResourcesSection": [
        {
            "title": "microsoft’s Privacy Policy",
            "url": "http://go.microsoft.com/fwlink/?linkid=2084267"
        }
    ],
    "locale": "en-us",
    "detailsId": "106302",
    "downloadPreload": true
}