{
    "error": "",
    "downloadTitle": "White Paper: Microsoft Dynamics CRM Online Service Description",
    "downloadDescription": "Microsoft Dynamics CRM Online is a Microsoft-hosted solution that delivers the simplicity and flexibility of cloud computing with powerful customer relationship management (CRM) capabilities, and the familiarity of Microsoft Office.  This document provides business professionals with an overview of the capabilities of the Microsoft Dynamics CRM Online service.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "Microsoft Dynamics CRM Online Service Description.pdf",
            "url": "https://download.microsoft.com/download/7/4/8/74806ac6-7464-4303-b404-365a484ded53/Microsoft Dynamics CRM Online Service Description.pdf",
            "size": "584821",
            "version": "1.0",
            "datePublished": "7/15/2024 3:11:30 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Microsoft Dynamics CRM Online is a Microsoft-hosted solution that delivers the simplicity and flexibility of cloud computing with powerful customer relationship management (CRM) capabilities, and the familiarity of Microsoft Office. Microsoft Dynamics CRM Online includes modules for sales force automation, marketing automation, and customer service and support. With the service, businesses gain instant online access to CRM capabilities anywhere over the web. Microsoft Dynamics CRM Online is available in 42 markets and 41 languages worldwide. The service is hosted in highly secure, Microsoft-owned and managed data centers and provides a 99.9 percent uptime service level agreement (SLA).<br />\r\nThis document provides business professionals with an overview of the capabilities of the Microsoft Dynamics CRM Online service.\r\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.0",
    "detailsSection_file_name": [
        "Microsoft Dynamics CRM Online Service Description.pdf"
    ],
    "detailsSection_file_size": [
        "571.1 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<UL>\r\n<LI>Adobe Reader</LI><br />\r\n</UL>",
    "systemRequirementsSection_supportedOS": [
        "Windows Server 2008 R2"
    ],
    "installInstructionSection": "<OL><br />\r\n<LI>To start the download, click <b>Download</b>, and then click <b>Go</b>.</LI>\r\n<LI>Do one of the following:</LI>\r\n<UL><LI>To start the installation immediately, click <B>Open</B> or <B>Run this program from its current location</B>.</LI>\r\n<LI>To copy the download to your computer for installation at a later time, click <B>Save</B> or <B>Save this program to disk</B>.</LI></UL></OL>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "30185",
    "downloadPreload": true
}