{
    "error": "",
    "downloadTitle": "VHD Test Drive - Lync Server 2010 (Dev) - Part 3 of 3",
    "downloadDescription": "This download comes as a pre-configured set of VHD's. This download enables you to fully evaluate the Microsoft Lync 2010 and Microsoft Exchange 2010 developer platform including the Microsoft Lync 2010 SDK, the Exchange Web Services Managed API 1.1  as well as the Microsoft Lync Server 2010 SDK and the Microsoft Unified Communications Managed API 3.0.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "LyncServer2010_Developer_Topology_QuickStartGuide.docx",
            "url": "https://download.microsoft.com/download/6/e/a/6eac4a20-6221-4415-86e2-179e9788221f/LyncServer2010_Developer_Topology_QuickStartGuide.docx",
            "size": "2816621",
            "version": "1",
            "datePublished": "7/15/2024 3:28:48 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Evaluate Microsoft's Unified Communications and Collaboration Developer Platform today!<br/>\r\n<br/>\r\nMicrosoft Lync Server 2010 combined with Microsoft Exchange 2010 SP1 Unified Messaging, Microsoft SharePoint Server 2010 and Microsoft Office 2010 delivers a powerful developer platform to efficiently build communications and collaboration applications using your .NET skills and Visual Studio 2010. This VHD topology provides a full, virtualized developer environment, with all servers preconfigured with users and data to demonstrate all relevant workloads and use scenarios. <br/>\r\n<br/>\r\nThe topology enables developers to learn how easy it is to integrate presence and click-to-communicate and how to embed contextual conversations in your line of business applications. It provides a powerful infrastructure to build real-time notifications and alerting systems that can be multi-channel leveraging Instant Messaging, voice and video, and that can be interacting with users leveraging the natural language capabilities of the Microsoft Server Speech Platform in the Unified Communications Managed API. You can build sophisticated expert finders, both inside your enterprise as well as for business to consumer scenarios (leveraging IM-an-Expert for Microsoft Lync Server 2010), and integrate this with Lync or Web Chat, as well Interactive Voice Response applications built in managed code or VoiceXML, or automated query-response bots. Additionally you can explore the Lync 2010 SDK Visual Studio Controls in the .NET 3.5 Windows Presentation Foundation and Microsoft Silverlight 4.0, that allow easy integration of Lync 2010 client user-interface elements in your own line of business applications.<br/>\r\n<br/>\r\nThe powerful Exchange Web Services Managed API 1.1 enables developers to write applications that interact with the mailbox content, do calendaring and task and contact management.<br/>\r\n<br/>\r\nThe topology contains a Terminal Services virtual machine that has a wide range of developer samples installed and deployed from the Unified Communications Managed API 3.0 SDK, the Lync 2010 SDK and the Exchange Web Services Managed API 1.1 SDK, as well as end-to-end scenario demos shown at various events, such as:<br/>\r\n<br/>\r\n     - Microsoft Lync based contact center with web chat, speech enabled IVR, ACD, Music on Hold, etc.<br/>\r\n     - ‘Crowd sourcing’ demo using the power of the Microsoft reference application “IM an Expert”, combined with HTML based Web Chat.<br/>\r\n     - Real-time document approval demonstration leveraging presence and instant messaging based on a Lync enabled SharePoint Windows Workflow.<br/>\r\n     - Custom calendaring application, implemented in WPF, with the look and feel of Outlook, yet written in the Exchange Web Services Managed API.<br/>\r\n     - A dozen or more small quick starts from the SDKs illustrating the basic capabilities of the Microsoft Business Productivity developer platform.<br/>\r\n<br/>\r\nThe complete topology consists of 7 virtual machines that require a total 16 GB of RAM and a powerful dual core or any quadcore host machine, and up to 150 Gb of disk space for the full topology.<br/>\r\n<br/>\r\nA minimal Unified Communications topology consisting of the DC virtual machine, the Lync Server 2010 Standard Edition virtual machine, the Exchange Server 2010 Unified Messaging Virtual Machine and the Terminal Services virtual machine can be run in 8 GB of RAM.<br/>\r\n<br/>\r\n<br/>\r\nNotes:<br/>\r\n1. This trial is split over 3 download releases.  The links for parts 1 and 2 are located below in the Additional Information section.<br/>\r\n<br/>\r\n2. This trial software is intended for evaluation purposes or proof of concept prototyping only.<br/>\r\n<br/>\r\n3. There is no product support for this trial. You are welcome to share your trial experience with others and to ask for advice by participating in the MSDN forums of Microsoft Lync (http://social.msdn.microsoft.com/Forums/en-US/category/uc) and Microsoft Exchange’s developer forum on Technet http://social.technet.microsoft.com/forums/en-US/exchangesvrdevelopment/threads/.<br/>\r\n<br/>\r\n4. The VHD set has an initial grace period of 10 days and can be activated for up to an additional 180 days. Look for instructions on how to activate the VHDs in the video on MSDN’s Channel 9 or in the instructions copied inside the VHD package on the user’s desktop called ‘LyncServer2010_Developer_Topology_QuickStartGuide.docx’.<br/>",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1",
    "detailsSection_file_name": [
        "LyncServer2010_Developer_Topology_QuickStartGuide.docx"
    ],
    "detailsSection_file_size": [
        "2.7 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "Windows Server 2008 R2 Standard<br/>\r\nWindows Server 2008 R2 Enterprise<br/>\r\n<br/>\r\nWindows Server 2008 R2 Hyper-V is required to use this virtual machine. In addition to the system requirements for Windows Server 2008 R2 as described in the release notes, a 64-bit system with hardware-assisted virtualization enabled and data execution prevention (DEP) is required.<br/>\r\n<br/>\r\nIt is also recommended to ensure that you have a clean install of x64 edition of Windows Server 2008 R2 to be able to use the Hyper-V technology.<br/>\r\nPrerequisites, installation steps, OS recommendations, and known issues of Hyper-V can be found <a href=\"http://technet.microsoft.com/en-us/library/cc534980.aspx\">here.</a>",
    "systemRequirementsSection_supportedOS": [
        "Hyper-V Server 2008",
        "Windows Server 2008 R2"
    ],
    "installInstructionSection": "In order to use this evaluation package you will need to have Microsoft Hyper-V installed on a physical machine.<br/>\r\n<br/>\r\nHyper-V is available on Windows Server 2008 R2 and the details on how to install Hyper-V can be found here.  Details of how to setup the VHD are included in the documentation that accompanies the product.<br/>\r\n<br/>\r\nTo find out more about the VHD Test Drive program, please visit <a href=\"http://www.microsoft.com/vhd\">www.microsoft.com/vhd</a><br/>\r\n<br/>\r\nTo find more information about Lync Server 2010, please visit <a href=\"http://www.microsoft.com/lync\">www.microsoft.com/lync</a><br/>\r\n<br/>\r\nUserName: fabrikam\\Administrator<br/>\r\nPassword: pass@word1<br/>",
    "additionalInformationSection": "<b>This trial is split over 3 download releases.  You can access parts 1 and 2 from the following locations:<b/><br/>\r\n<br/><b>\r\nPart 1 - <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=b9ce6d8b-8e61-4932-afc1-db028348d808\">http://www.microsoft.com/downloads/details.aspx?FamilyID=b9ce6d8b-8e61-4932-afc1-db028348d808</a>.</b><br/>\r\nPart 2 - <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=64035d53-de06-4fa2-bd4b-02357667be82\">http://www.microsoft.com/downloads/details.aspx?FamilyID=64035d53-de06-4fa2-bd4b-02357667be82</a>.</b><br/>",
    "relatedResourcesSection": [
        {
            "title": "lync Server Forums",
            "url": "http://social.technet.microsoft.com/Forums/en-US/category/ocs"
        },
        {
            "title": "hyper-V",
            "url": "http://technet.microsoft.com/en-us/windowsserver/dd448604.aspx"
        },
        {
            "title": "vhd Test Drive - Lync Server 2010 VHD (Dev) - Part 2",
            "url": "http://www.microsoft.com/downloads/details.aspx?FamilyID=64035d53-de06-4fa2-bd4b-02357667be82"
        },
        {
            "title": "vhd Test Drive - Lync Server 2010 VHD (Dev) - Part 1",
            "url": "http://www.microsoft.com/downloads/details.aspx?FamilyID=b9ce6d8b-8e61-4932-afc1-db028348d808"
        }
    ],
    "locale": "en-us",
    "detailsId": "30330",
    "downloadPreload": true
}