{
    "error": "",
    "downloadTitle": "Microsoft® Windows® Software Development Kit (SDK) for RC 1 Windows Vista and .NET Framework 3.0 Runtime Components (ISO)",
    "downloadDescription": "The Windows SDK contains pre-release documentation, samples, and tools designed to help you develop Windows applications and libraries using both Win32® and .NET Framework 3.0 technologies targeting Windows Vista.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "ReleaseNotesOnline.htm",
            "url": "https://download.microsoft.com/download/4/4/8/4487bb00-c563-4413-a931-7990b811e08f/ReleaseNotesOnline.htm",
            "size": "50292",
            "version": "6.0",
            "datePublished": "7/15/2024 3:29:36 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Welcome to the Windows SDK July CTP release. The documentation, samples, and tools provided in this release are \n<u>preliminary</u> and <u>subject to change</u>. <BR/> <BR/> <b>It is recommended that you use this preliminary release of the Windows SDK \nin a test environment on a clean machine.</b> <BR/> <BR/>This CTP (Community Tech Preview) is intended for users of Windows Vista build 5456 and the .NET Framework 3.0 Runtime June CTP. This CTP contains updates for native Win32 developers, including improvements to documentation and samples. It is not supported for users running the Windows Vista Beta 2 for .NET Framework 3.0 development, but it will work for native Win32 applications on Windows Vista Beta 2. If you are using Windows Vista Beta 2 for .NET Framework 3.0 development, we recommend that you do not install this version of the SDK and instead use the <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=13F8E273-F5EA-4B7B-B022-97755838DB94&displaylang=en\">Windows SDK Beta 2 release</a>. The .NET Framework 3.0 July CTP runtime is a later version than the one that ships with Windows Vista Beta 2, and code that uses the .NET Framework 3.0 will not work with this CTP. \n\n<br/><br/>\n<b>IMPORTANT: </b> This version of the Microsoft Windows SDK is intended to support development targeting the following release:\n<br/><br/>\n<ul>\n<li><b>.NET Framework 3.0 July CTP</b></li>\n<LI><B>Windows Vista build 5472</B></LI>\n\n\n\n</ul><br/>\nThis release of \nthe Windows SDK is compatible with the RTM versions of Microsoft® \nVisual Studio® 2005.\n\n<br/><br/>\n===================================================\n<br/><br/>\n<b>NOTE:  There are a number of known issues with this release. Please consult the <a href=\"http://download.microsoft.com/download/5/4/4/544C02E0-6E73-48C7-85A5-42A1B8FB49F1/WinSDKJuneReadMe.Htm\">Readme</a> associated with this download for more information. </b> This version of the Windows SDK will\n\t<u>not</u> work with previous pre-release versions of Windows Vista, the .NET Framework 3.0 Runtime Components for Windows XP or Windows Server, nor pre-release versions of Visual Studio.\n\n\n<br/><br/>Please note that this download contains SDK content only. <b>To build .NET Framework 3.0 applications for Windows XP or Windows Server, the\n.NET Framework 3.0 Runtime Components for July CTP must be <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=8D09697E-4868-4D8D-A4CF-9B82A2AE542D&displaylang=en\">downloaded separately</a>.</b>\n\n<br/><br/>\n===================================================\n<br/><br/>\nThe Windows SDK includes <i>pre-release </i>content for application development with the APIs in Windows Vista, including the .NET Framework 3.0 technologies: .NET Framework 2.0, Windows® Presentation Foundation, Windows® Communications Foundation, and Windows® Workflow Foundation. Because the Windows SDK contains the former WinFX SDK content, the WinFX SDK is no longer released separately. \n\n<br/><br/><B>Documentation:</B> The Windows SDK documentation contains API reference topics; \ntask-based, how-to documentation; and feature overviews to help you develop applications\nusing Win32 and .NET Framework 3.0 APIs. Search, the Index, the Table of Contents, and the navigational \ntopics in the documentation viewer are all available to help you locate the topics you need.\n\n<br/><br/><B>Samples:</B> The Windows SDK code samples are provided in one or more of the following languages: Visual Basic, C#, and C++. All samples are \ninstalled to the Program Files\\Microsoft SDKs\\Windows\\v1.0\\Samples directory by default; however, users may install samples to a location that they choose. <br/><br/>For .NET Framework 3.0 samples, you can also locate, view, and download samples, organized by technology, by opening the Samples node in the .NET Framework 3.0 Development section of the Table of Contents. In addition, .NET Framework 3.0 samples are grouped by technology in zip files installed to the Program Files\\Microsoft SDKs\\Windows\\v1.0\\Samples directory. The zip files may be extracted to any location you choose.\n\n<br/><br/><B>Tools and Build Environments:</B> In addition to the headers and libraries used to build Windows applications, the Windows SDK also includes more than 100 GUI and command-line tools to aid in the development of native (Win32) and managed (.NET) systems for the Windows platform. The tools include command-line compilers (both 32 and 64-bit), debuggers, performance monitoring applications, security management utilities, and much more. <br/><br/><b>The \n<a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyId=1A994549-94CB-4F61-903D-A8C8E453EEF4&displaylang=en\">Microsoft Visual Studio Code Name “Orcas” Community Technology Preview – Development Tools for .NET Framework 3.0</a> </b>are available as a separate download. These Visual Studio tools provide developers with support for building .NET Framework 3.0 applications using the RTM version of Visual Studio 2005. This support includes Intellisense support, project templates, and documentation integration for .NET Framework 3.0.\n<br/><br/><B>IMPORTANT:</B> You must have matching versions of the .NET Framework 3.0 Runtime Components, \nWindows SDK, and Visual Studio Extensions in order to build .NET Framework 3.0 applications with Visual Studio. For this release, all must be either Beta 2 or June CTP releases. Older pre-release versions are no longer supported.\n<br/><br/>The Windows SDK contains pre-release documentation, samples, and tools designed to help you develop Windows applications and libraries using both Win32® and .NET Framework 3.0 technologies targeting Windows Vista.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "6.0",
    "detailsSection_file_name": [
        "ReleaseNotesOnline.htm"
    ],
    "detailsSection_file_size": [
        "49.1 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ul> \n\n<li>The .NET Framework 3.0 components of the SDK are designed to work on the July CTP release of Windows Vista, on Windows XP SP2 \nor Windows Server SP1 with the .NET Framework 3.0 Runtime Components JulyCTP\ninstalled. If you do not have the .NET Framework 3.0 components installed, some samples, tools \nand other SDK functionality may not work properly.<br/><br/> </li>\n\n<li>Hard Disk Space.  Choose a disk drive with a minimum of 1.5 GB of free space. <br/><br/></li>\n<li>We highly recommend you have your machine fully patched through Microsoft Update before beginning setup.</li>\n</ul>",
    "systemRequirementsSection_supportedOS": [
        "Longhorn (Windows Code Name) ",
        "Windows Vista",
        "Windows XP"
    ],
    "installInstructionSection": "For this release, the Windows SDK is available as either a  full DVD ISO image that enables you to run setup on a local machine or as a <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=9221a6aa-ac1c-4604-a326-b8cf2b12b6eb&displaylang=en\">Web Download</a> \nthat enables you to launch setup over the web and download only the components you select during setup.<br/> <br/>\n<B>NOTE:</B> Please be aware that the Windows SDK is approximately 1.5 GB, which will take considerable time to download depending on your connection speed. One way to to improve the download time is by running the web setup and selecting only the individual components you need.<BR/>\n<ul><li>For best results, first consult the <b>Readme file </b>available for download \n\tbelow. If you need additional information or asssistance with installing or using the Windows SDK, please vist the <a href=\"http://forums.microsoft.com/MSDN/ShowForum.aspx?ForumID=121&SiteID=1\">Windows SDK Forum</a> or <a href=\"http://blogs.msdn.com/windowssdk\">the Windows SDK team blog</a>.<br/><br/></li>\n\n\n<li>To download the full <b>ISO image</b> containing bits for all platforms, choose \n<b>6.0.5383.1.1.WindowsSDK_Vista_idw.DVD.Rel.img</b> below. After downloading the IMG file, rename it to .ISO before mounting it.<br/><br/>Due to the large size of the ISO file, we highly recommend you use a download manager tool to manage the ISO download.<br/><br/>\n\tTo install the Windows SDK using the ISO file:<UL>\n\t<LI><b>Accessing the ISO File</b> - An ISO image file is an exact representation of \n\ta DVD, including the content and the logical format. The most common use of \n\tan image file is to write it to a blank DVD-R resulting in an identical copy \n\tof the original DVD including file name and volume label information. ISO \n\tImages can also be extracted directly to a file location by many DVD-R \n\tutilities, including the tool below.</LI>\n\t\t\n\t<LI><b>Mounting ISO files virtually</b> - You can use the\n\t<a href=\"http://download.microsoft.com/download/7/b/6/7b6abd84-7841-4978-96f5-bd58df02efa2/winxpvirtualcdcontrolpanel_21.exe\">Virtual CD-ROM Control Panel for Windows XP</a> \n\ttool to mount the ISO image file virtually as CD-ROM devices without burning \n\tthe image to a DVD. This tool is provided here for your convenience, and is unsupported by Microsoft Customer Services and Support.</LI></UL></li>\n</ul>",
    "additionalInformationSection": "To verify that your download of an ISO file for the Windows SDK July CTP build is not corrupt, download the <a href=\"ftp://ftp.microsoft.com/Softlib/MSLFILES/crc.exe\">CRC Utility</a>. \nTo run the CRC test, open a command prompt and run the utility. providing it the name of the file (i.e. crc c:\\6.0.5456.3.0.WindowsSDK_Vista_idw.DVD.Rel.img) \nThe CRC utility will run two tests on the ISO: it will verify if the ISO is valid, and it will give the AutoCRC signature for the file. The AutoCRC signature for the Windows SDK June CTP ISO is 0x4F2680CF. You should also confirm the size of the ISO is correct: 1.13 GB (1,222,107,136 bytes)<br/><br/>\n\nIf it fails any of these three tests, re-download the ISO.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "31950",
    "downloadPreload": true
}