{
    "error": "",
    "downloadTitle": "Microsoft® Office Language Interface Pack 2013 – Gàidhlig",
    "downloadDescription": "Bheir an Language Interface Pack Gàidhlig airson Microsoft Office dhut eadar-theangachadh air cuid mhath dhen chànan a chithear ann an aplacaidean Microsoft Office 2013.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "languageinterfacepack-x86-gd-gb.exe",
            "url": "https://download.microsoft.com/download/a/1/9/a1946dd7-413c-4972-b9da-5680f3f45648/languageinterfacepack-x86-gd-gb.exe",
            "size": "13330520",
            "version": "2013",
            "datePublished": "7/15/2024 3:35:01 AM"
        },
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x64-gd-gb.exe",
            "url": "https://download.microsoft.com/download/a/1/9/a1946dd7-413c-4972-b9da-5680f3f45648/languageinterfacepack-x64-gd-gb.exe",
            "size": "13393752",
            "version": "2013",
            "datePublished": "7/15/2024 3:35:01 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Bheir an Language Interface Pack Gàidhlig airson Microsoft Office dhut eadar-theangachadh air na h-aplacaidean a leanas ann am Microsoft Office 2013:\n<br />\n<br />\n<li>Microsoft Excel® 2013</li><br />\n<li>Microsoft OneNote® 2013</li><br />\n<li>Microsoft Outlook® 2013</li><br />\n<li>Microsoft PowerPoint® 2013</li><br />\n<li>Microsoft Word 2013</li><br />\n\n\n<br />\nMa chleachdas tu am Microsoft Office Language Interface Pack 2013 airson na Gàidhlig, 's urrainn dhut leantainn ort leis na h-aplacaidean sa chànan a chaidh an stàladh o thùs agus àitheantan is roghainnean nan aplacaidean Office fhaicinn ann an Gàidhlig. \n<br />\n<br />\nNuair a stàlaicheas tu an Language Interface Pack 2013 airson Microsoft Office, thèid lethbhreac dhe na faidhlichean a chuireas cànan eile air an eadar-aghaidh a chur air a' chlàr-chruaidh. \nÀs dèidh dhut an Language Interface Pack 2013 airson Microsoft Office a stàladh, bidh cuid a chomasan Gàidhlig ann agus ruigidh tu iad o bhroinn aplacaidean Office 2013 no anns na roghainnean cànain aig Microsoft Office 2013. \n<br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2013",
    "detailsSection_file_name": [
        "languageinterfacepack-x86-gd-gb.exe",
        "languageinterfacepack-x64-gd-gb.exe"
    ],
    "detailsSection_file_size": [
        "12.7 MB",
        "12.8 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ol>Microsoft Windows 7 - 32 no 64 bit OS<br />\nMicrosoft Windows 8 - 32 no 64 bit OS<br /> \n<b>An aire: </b>Stàlaich na pacaidean seirbheise as ùire airson an t-siostaim-obrachaidh agad ach am faigh thu an taic as fhearr airson do chànain.<br /></ol>\n<br />\n<b>Bathar-bog </b>Bheir tionndadh sam bith de shreath Office 2013 no aplacaidean aonaranach sa bheil Microsoft Excel, Microsoft OneNote, Microsoft Outlook, Microsoft PowerPoint no Microsoft Word taic ris an Language Interface Pack Gàidhlig airson Microsoft Office 2013. <b>An aire: </b>Stàlaich na pacaidean seirbheise as ùire aig Microsoft Office airson a' bhathar Microsoft Office agad. Obraichidh iad fada nas fhearr ma nì thu sin.<br />\n<br />\n<b>Coimpiutair agus pròiseasar </b>Pròiseasar 1 GHz le taic ri SSE2 no fear nas fhearr; 2 GB RAM no barrachd<br />\n<br />\n<b>Àite air an diosg </b>A bharrachd air an àite air an diosg a dh'fheumas aplacaidean Office 2013 iad fhèin, bidh feum air<br />\n<li>3 GB a dh'àite saor air a' chlàr-chruaidh.</li><br />\n<li>A thuilleadh air sin, cha bhi feum air dad a bharrachd ach na chleachdas na h-aplacaidean Office 2013 iad fhèin a chleachdas tu an cois an Language Interface Pack 2013 Gàidhlig airson Microsoft Office.</li><br />\n<br />\n<b>Windows Language Interface Pack </b>Mholamaid dhut gun stàlaich thu na Language Interface Packs as ùire airson Windows 7 no Windows 8 ach am faigh thu an taic cànain as fhearr a thaobh an t-siostaim-obrachaidh 's aplacaidean bathar-bog.<br />\n<br />\n<b>Dùmhlachd-bhreacaidh na sgrìn is roghainnean DPI </b>Chaidh iomadh cruth-clò a dhealbhadh gu sònraichte airson dùmhlachd-bhreacaidh de 1366 le 768 . Ma tha cruth-clò do chànain doirbh ri leughadh, feuch an dùmhlachd-bhreacaidh sin no tè fiù nas àirde. An aire: Mholamaid dhut aplacaidean Office 2013 a chleachdaidh leis a' bhun-roghainnean Windows airson DPI — 's e sin 96 DPI. Ma chleachdas tu an roghainn 120 DPI, dh'fhaoidte gum bi droch choltas air cuid a dh'aplacaidean 's na còmhraidhean Office a' fàs mòr.<br />\n<br />\n<b>An sgeama ionadail 's roghainnean cànain </b>A bharrachd air sin, mholamaid dhut gun tagh thu cànan an Language Interface Pack 2013 airson Microsoft Office (Gàidhlig) airson an <b>an sgeama ionadail 's na roghainnean cànain</b> sa <b>phanail-smachd</b> .<br />\n<br />\n",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows 8"
    ],
    "installInstructionSection": "<b>Gus a stàladh:</b>\n<br />\n<ol>\n<li>Luchdaich a-nuas an <b>LanguageInterfacePack.exe</b> 's tu a' briogadh air a' phutan <b>\"Luchdaich a-nuas\"</b> gu h-àrd 's ga shàbhaladh air a' chlàr-chruaidh agad.</li>\n<li>Dèan briogadh dùbailte air an fhaidhle <b>LanguageInterfacePack.exe</b> air a' chlàr-chruaidh agad gus prògram an t-suidheachaidh a chur gu dol.</li>\n<li>Lean ris an stiùireadh air an sgrìn gus an stàladh a choileanadh.</li>\n<li>Turas a bhios e air stàladh, gheibh thu an readme airson Language Interface Pack Microsoft Office 2013 an-seo C:\\Program Files\\Common Files\\microsoft shared\\OFFICE15\\gd-GB\\LIPread.htm.</li>\n<li>Chan eil taic ri àrdachadh o Office 2010 le Language Interface Pack airson Office 2010 no tionndadh nas sine de Office 2013 le Language Interface Pack airson Office 2013 <b>.</b>Ma tha thu airson bunait an stàlaidh àrdachadh o Office 2010 gu Office 2013 leis an Language Interface Pack airson Office 2013, bu chòir dhut:</li>\n<ul>\n<li>Language Interface Pack airson Office 2010 a thoirt air falbh.</li>\n<li>Ruith gleus an t-suidheachaidh aig Office 2013 agus tagh àrdachadh.</li>\n<li>Nuair a bhios suidheachadh Office 2013 deiseil, stàlaich is rèitich an Language Interface Pack airson Office 2013.</li>\n<br />\n<br />\n</ul>\n<br />\n</ol>\n<b>A' cur an gnìomh a' bhathar Office agad:</b>\n<br />\nMa tha duilgheadas agad an còd stàlaidh gu lèir air draoidh an stàlaidh aig Microsoft Office a leughadh no mur eil an còd stàlaidh a' nochdadh mar bu chòir nuair a chleachdas tu an Language Interface Pack 2013 airson Microsoft Office, sguir dhen draoidh agus cleachd an tionndadh Beurla gus am bathar Microsoft Office agad a chur an gnìomh.<br />\n<br />\n<b>Stiùireadh cleachdaidh:</b><br />\nGus an Language Interface Pack 2013 airson Microsoft Office a chleachdadh ann an Gàidhlig, dèan na leanas:<br />\n<br />\n<ol>\n<li>Cuir gu dol <b> na Language Preferences aig Microsoft Office 2013</b> on chlàr-taice <b>Start\\All Programs\\Microsoft Office\\Microsoft Office Tools</b> .</li>\n<li>Fo <b>Choose Display and Help Languages</b>, fo <b>Display Language</b> tagh an cànan a tha thu ag iarraidh agus briog air a' phutan <b>Set as Default</b> .</li>\n<li>Fo <b>Choose Editing Languages</b>tagh an cànan a tha thu ag iarraidh agus briog air a' phutan <b>Set as Default</b> .</li>\n<li>Briog air a' phutan <b>OK</b> .</li>\n<br /></ol>\n<br />\nBidh na roghainnean cànain a thagh thu an sàs an ath-thuras a thòisicheas tu na h-aplacaidean Office agad.<br />\n<b>An aire:</b> Chan urrainn dhan Language Interface Pack 2013 aig Microsoft Office Gàidhlig a chur air cànan nan cobharach. Bidh a' chobhair ann an cànan an stàlaidh thùsail gu buan.<br />Cleachd a' bhunait cànain agad airson cànan na cobharach an-còmhnaidh sa chlàr-taice.<br />\n<br />\n<b>A' toirt air falbh an luchdadh a-nuas seo:</b><br />\n<li>Fàg prògram Microsoft Office sam bith.</li>\n<li>Dèan briogadh dùbailte air an ìomhaigheag <b>Prògraman is feartan</b> ann am <b>panail-smachd</b>Windows.</li>\n<li>Fon roghainn <b>Dì-stàlaich no atharraich prògram</b> , briog air  <b>Microsoft Office Language Interface Pack 2013 - Gàidhlig</b> ann am bogsa nam <b>prògraman a tha air an stàladh an-dràsta</b> agus tagh <b>Dì-stàlaich</b> an uairsin.</li>\n<li>Lean ris an stiùireadh air an sgrìn.</li>\n<br />\n",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "39693",
    "downloadPreload": true
}