{
    "error": "",
    "downloadTitle": "Microsoft® Office Language Interface Pack 2013 Office 2013 – српски",
    "downloadDescription": "Microsoft Office Language Interface Pack 2013 - српски пружа преведени кориснички интерфејс за многе апликације пакета Microsoft Office 2013.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "languageinterfacepack-x86-sr-cyrl-ba.exe",
            "url": "https://download.microsoft.com/download/8/0/1/801f686e-dd14-4236-8cfc-bdea44305ab8/languageinterfacepack-x86-sr-cyrl-ba.exe",
            "size": "14060928",
            "version": "2013",
            "datePublished": "7/15/2024 3:17:19 AM"
        },
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x64-sr-cyrl-ba.exe",
            "url": "https://download.microsoft.com/download/8/0/1/801f686e-dd14-4236-8cfc-bdea44305ab8/languageinterfacepack-x64-sr-cyrl-ba.exe",
            "size": "14137152",
            "version": "2013",
            "datePublished": "7/15/2024 3:17:19 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Microsoft Office Language Interface Pack 2013 - српски пружа преведени кориснички интерфејс за сљедеће апликације пакета Microsoft Office 2013:\n<br />\n<br />\n<li>Microsoft Excel® 2013</li><br />\n<li>Microsoft OneNote® 2013</li><br />\n<li>Microsoft Outlook® 2013</li><br />\n<li>Microsoft PowerPoint® 2013</li><br />\n<li>Microsoft Word 2013</li><br />\n\n\n<br />\nКориштењем пакета Microsoft Office Language Interface Pack 2013 - српски, корисници могу да раде у подржаним верзијама Office апликација на језику изворне инсталације и да приказују команде и опције за те апликације на српском језику. \n<br />\n<br />\nТоком инсталације пакета Microsoft Office Language Interface Pack 2013, фајлови који омогућавају корисницима да промијене језик корисничког интерфејса се копирају на одредишни тврди диск. \nНакон инсталације, могућности и релевантне опције пакета Microsoft Office Language Interface Pack 2013 - српски су доступне из апликација пакета Office 2013 и апликације за језичке поставке пакета Microsoft Office 2013. \n<br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2013",
    "detailsSection_file_name": [
        "languageinterfacepack-x86-sr-cyrl-ba.exe",
        "languageinterfacepack-x64-sr-cyrl-ba.exe"
    ],
    "detailsSection_file_size": [
        "13.4 MB",
        "13.5 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ol>Microsoft Windows 7 - 32-битни или 64-битни оперативни систем<br />\nMicrosoft Windows 8 - 32-битни или 64-битни оперативни систем<br /> \n<b>Напомена: </b>Провјерите да ли имате инсталиране најновије сервисне пакете за ваш оперативни систем како бисте обезбједили оптималну подршку за свој језик.<br /></ol>\n<br />\n<b>Софтвер </b>Свака верзија пакета или самосталног програма Office 2013 која садржи Microsoft Excel, Microsoft OneNote, Microsoft Outlook, Microsoft PowerPoint или Microsoft Word ће да подржава Microsoft® Office Language Interface Pack 2013 - српски. <b>Напомена: </b>Обавезно инсталирајте најновије сервисне пакете за Microsoft Office за своје Microsoft Office производе. Тиме ћете да обезбједите бољи доживљај кориштења.<br />\n<br />\n<b>Рачунар и процесор </b>Процесор од 1 GHz с подршком за SSE2 или бољи; 2 GB RAM меморије или више<br />\n<br />\n<b>Простор на диску </b>Поред простора на тврдом диску који користе инсталиране апликације пакета Office 2013,<br />\n<li>3 GB доступног простора на тврдом диску.</li><br />\n<li>Сви остали системски захтјеви су исти као и за апликације пакета Office 2013 које користите с пакетом Microsoft® Office Language Interface Pack 2013 - српски.</li><br />\n<br />\n<b>Windows Language Interface Pack </b>Препоручује се да инсталирате најновије пакете језичког интерфејса за Windows 7 или Windows 8 ради оптималне језичке подршке за оперативни систем и софтверске апликације.<br />\n<br />\n<b>Резолуција монитора и поставке за DPI </b>Многи фонтови су креирани за оптимално читање при резолуцији од 1366 x 768 тачака. Ако имате проблема приликом читања фонта на свом језику, ажурирајте поставке екрана на поменуту резолуцију или већу ако је потребно. Молимо да имате на уму: препоручујемо да користите апликације пакета Office 2013 уз задану поставку за DPI у оперативном систему Windows - 96 DPI. Кориштење поставке од 120 DPI може изазвати слабији доживљај кориштења пакета Office у неким Office апликацијама због повећавања величине дијалошких оквира у пакету Office.<br />\n<br />\n<b>Регионалне и језичке опције </b>Поред тога, препоручује се да све <b>регионалне и језичке опције</b> у <b>Управљачкој плочи</b> буду постављене на опције за Microsoft® Office Language Interface Pack 2013 - српски.<br />\n<br />\n",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows 8"
    ],
    "installInstructionSection": "<b>Да бисте инсталирали ово преузимање:</b>\n<br />\n<ol>\n<li>Преузмите фајл <b>LanguageInterfacePack.exe</b> кликом на дугме <b>Преузми</b> (изнад) и сачувајте фајл на тврди диск.</li>\n<li>Два пута кликните на фајл програма <b>LanguageInterfacePack.exe</b> на тврдом диску како бисте покренули програм за постављање.</li>\n<li>Слиједите упутства на екрану како бисте довршили инсталацију.</li>\n<li>Након инсталирања, фајл с упутствима за Microsoft Office 2013 Language Interface Pack можете да нађете на локацији C:\\Program Files\\Common Files\\microsoft shared\\OFFICE15\\7194\\LIPread.htm.</li>\n<li>Надоградња пакета Office 2010 с пакетом Language Interface Pack за Office 2010 или ранијег издања на пакет Office 2013 с пакетом Language Interface Pack за Office 2013 <b>није подржана</b>. Ако желите да надоградите основну инсталацију пакета Office 2010 на Office 2013 с пакетом Language Interface Pack за Office 2013, требате да урадите сљедеће:</li>\n<ul>\n<li>Деинсталирајте пакет Language Interface Pack за Office 2010.</li>\n<li>Покрените програм за постављање пакета Office 2013 и одаберите опцију за надоградњу.</li>\n<li>Када се постављање пакета Office 2013 заврши, инсталирајте и конфигуришите пакет Language Interface Pack за Office 2013.</li>\n<br />\n<br />\n</ul>\n<br />\n</ol>\n<b>Активирање вашег Office производа:</b>\n<br />\nАко имате проблема с читањем цјелокупног инсталационог кода у дијалогу \"Чаробњак за активирање пакета Microsoft Office\" или се цјелокупни инсталациони код не приказује правилно када користите Microsoft Office Language Interface Pack 2013, откажите рад чаробњака и пребаците се на основни језик производ како бисте активирали свој производ пакета Microsoft Office.<br />\n<br />\n<b>Упутства за кориштење:</b><br />\nДа бисте пребацили кориснички интерфејс на Microsoft Office Language Interface Pack 2013 – српски, примијените сљедеће кораке:<br />\n<br />\n<ol>\n<li>Покрените <b> жељене вриједности језика за Microsoft Office 2013</b> из менија <b>Почетак\\Сви програми\\Microsoft Office\\Microsoft Office алати</b> .</li>\n<li>Под опцијом <b>Одабери језике за Помоћ и приказ</b>, под ставком <b>Језик приказа</b> одаберите жељени језик и кликните дугме <b>Постави као задани</b> .</li>\n<li>Под опцијом <b>Одабери језике за уређивање</b>, одаберите жељени језик и кликните дугме <b>Постави као задани</b> .</li>\n<li>Кликните дугме <b>У реду</b> .</li>\n<br /></ol>\n<br />\nПоставке језика које сте одабрали ће да ступе на снагу када наредног пута покренете апликације пакета Office.<br />\n<b>Напомена:</b> Помоћ не може да се пребаци на Microsoft Office Language Interface Pack 2013 – српски. Помоћ увијек остаје на језику изворне инсталације.<br />Увијек поставите приказ помоћи у падајућем списку на основни језик.<br />\n<br />\n<b>Да бисте уклонили ово преузимање:</b><br />\n<li>Изађите из свих програма пакета Microsoft Office.</li>\n<li>Два пута кликните икону <b>Програми и функције</b> у <b>Управљачкој плочи</b> оперативног система Windows.</li>\n<li>Под опцијом <b>Деинсталирај или промијени програм</b>, кликните <b>Microsoft® Office Language Interface Pack 2013 – српски</b> у оквиру <b>Тренутно инсталирани програми</b>, а затим одаберите опцију <b>Деинсталирај</b> .</li>\n<li>Слиједите упутства на екрану.</li>\n<br />\n",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "39695",
    "downloadPreload": true
}