{
    "error": "",
    "downloadTitle": "Microsoft® Office መእሰሪ መንጎኛ ቋንቋ 2013 – ትግርኛ",
    "downloadDescription": "ናይ Microsoft Office Language Interface Pack 2013 - ትግርኛ ዝተተርጎመ ናይ ተጠቓማይ መንጎኛ ንብዙሓት ናይ Microsoft Office 2013 ፕሮግራማት ቐሪቡ ኣሎ.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x86-ti-et.exe",
            "url": "https://download.microsoft.com/download/a/e/4/ae4f21f6-8c56-4725-826c-0379de4809ba/languageinterfacepack-x86-ti-et.exe",
            "size": "13447648",
            "version": "2013",
            "datePublished": "7/15/2024 3:18:42 AM"
        },
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x64-ti-et.exe",
            "url": "https://download.microsoft.com/download/a/e/4/ae4f21f6-8c56-4725-826c-0379de4809ba/languageinterfacepack-x64-ti-et.exe",
            "size": "13514272",
            "version": "2013",
            "datePublished": "7/15/2024 3:18:42 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "መእሰሪ መንጎኛ ቋንቋ 2013 - ትግርኛ ዝተቶርጎመ መንጎኛ ተጠቓማይ ነዚ ዝስዕብ Microsoft Office 2013 ፕሮግራም ይቅርብ:\n<br />\n<br />\n<li>Microsoft Excel® 2013</li><br />\n<li>Microsoft OneNote® 2013</li><br />\n<li>Microsoft Outlook® 2013</li><br />\n<li>Microsoft PowerPoint® 2013</li><br />\n<li>Microsoft Word® 2013</li><br />\n\n\n<br />\nመእሰሪ መንጎኛ ቋንቋ 2013 - ትግርኛ ብምጥቓም ተጠቐምቲ ኣብ ዝተሓገዘ መበቆላዊ ቋንቋ መውረዲ ሕታም ናይ Office ፕሮግራም ክሰርሑን ትእዛዛት መምረጽታት ነዞም ፕሮግራማት ኣብ - ትግርኛ ምርኣይን ይኽእሉ. \n<br />\n<br />\nኣብ ግዜ ምጽዓን ናይ Microsoft Office Language Interface Pack 2013, ፋይላት ንተጠቓማይ ነዚ ቋንቋ ናይዚ ተጠቓማይ መንጎኛ ከቐይርዎ ዝኽእሉ ናብቲ ሃርድ ዲስክ ተቐዲሖም ኣለዉ. \nድሕሪ ምጽዓን, ናይ Microsoft Office Language Interface Pack 2013 - ትግርኛ ክእለታትን መሰነይታታትን ኣማራጽታት ኣብ ውሽጢ Office 2013 ፕሮግራማትን Microsoft Office 2013 ኣቐማምጣ ቋንቋ ፕሮግራምን ቅሩብ ክኸውን እዩ. \n<br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2013",
    "detailsSection_file_name": [
        "languageinterfacepack-x86-ti-et.exe",
        "languageinterfacepack-x64-ti-et.exe"
    ],
    "detailsSection_file_size": [
        "12.8 MB",
        "12.9 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ol>Microsoft Windows 7 - 32 ወይ 64 bit OS<br />\nMicrosoft Windows 8 - 32 ወይ 64 bit OS<br /> \n<b>መዘኻኸሪ: </b>ንዝበለጸ ሓገዝ ናይ ቋንቋ ንምርግጋጽ ብክብረትኩም እቲ ዝሓደሰ ጥማራት ኣገልግሎት ኣብዚ ስርዓት ስርሒት ከም ዝጸዓንኩሞ ኣረጋግጹ.<br /></ol>\n<br />\n<b>ሶፍትዌር </b>ዝኾነ ቅዳሕ ናይ Office 2013 ጥቕላል ወይ በይኑ ጠጠው ዝበለ Microsoft Excel, Microsoft OneNote, Microsoft Outlook, Microsoft PowerPoint ወይ Microsoft Word ዝሓዘ ወይ ን ናይ Microsoft Office Language Interface Pack 2013 - ትግርኛ ዝሕግዝ. <b>መዘኻኸሪ: </b>ንፍርያት Microsoft Office ዝኸውን ብክብረትኩም እቲ ዝሓደሰ ጥማራት ኣገልግሎት ከም ዝጸዓንኩሞ ኣረጋግጹ. እዚ ንዝበለጸ ውጽኢት ተመክሮ ናይ ተጠቓማይ ከውሕሰልና ይኽእል እዩ.<br />\n<br />\n<b>ሓሳቢቶን ፕሮሰሰርን </b>1 GHz ፕሮሰስር ምስ SSE2 ዝድግፍ ወይ ድማ ልዕሊኡ; 2 GB RAM ወይ ልዕሊኡ<br />\n<br />\n<b>ቦታ ዲስክ </b>ብተወሳኺ ንሃርድ ዲስክ ዝጥቐመሉ ብOffice 2013 ፕሮግራም ዝተጻዕነ,<br />\n<li>3 GB ቅሩብ ቦታ ሃርድ ዲስክ.</li><br />\n<li>ካልኦት ኩሎም ኣገዳስነት ዘለዎም ምስ Office 2013 ፕሮግራማት ሕደ ዝኾኑ ን ናይ Microsoft Office Language Interface Pack 2013 - ትግርኛ ትጥቐመሎም እዮም.</li><br />\n<br />\n<b>Windows መእሰሪ መንጎኛ ቋንቋ </b>ንዝበለጸ ሓገዝ ቋንቋ ንስርዓት ስርሒትካን ንሶፍትዌር ፕሮግራማትናን እቲ ዝሓደሰ Windows 7 ወይ Windows 8 መእሰሪ መንጎኛ ቋንቋ ንክትጽዕኖ ንመኽረካ.<br />\n<br />\n<b>ሞኒተር ንጹርነት ኣቐማምጣ ad DPI </b>ብዙሓት ቅርጺ ፊደላት ንዝበለጸ ኣብ 1366 x 768 ንጹርነት ንምንባብ ተፈጢሮም ኣለዉ. እንድሕር ደኣ ንምንባብ ቋንቋ ቅርጺ ፊደልካ ጸገማት ኣጋጢሙካ ብክብረትካ ንመርኣዪ ኣቐማምጣኻ ናብዚ ንጹርነት ወይ ኣድላዪ እንተኾይኑ ካብኡ ንላዕሊ ኣሐድሶ. ክትዝክሮ ዘለካ: ንሕና ንምዕደካ Office 2013 ፕሮግራማት ኣብ ንቡር DPI ኣቐማምጣ - 96 DPI ናይ Windows ክትጥቐመሉ. ምጥቓም 120 DPI ኣቐማምጣ ኣብ ገሊኡ Office ፕሮግራማት፡ Office መዘራረቢ ዓቐን ብምውሳኽ ድኹም ዝኾነ Office ተመክሮ ናይ ተጠቓማይ ክፈጥር ይኽእል እዩ.<br />\n<br />\nብተወሳኺ ኩሎም <b>ዞባውን ኣማራጽታት ቋንቋን</b> ኣብ <b>ናይ ቁጽጽር ፓነል</b> ዘለዉ ናብ ናይ Microsoft Office Language Interface Pack 2013 - ትግርኛ.<br />\n<br />\n",
    "systemRequirementsSection_supportedOS": [
        "Windows 8"
    ],
    "installInstructionSection": "<b>ነዚ ንምጽዓን ኣውርዶ ን:</b>\n<br />\n<ol>\n<li>ኣብ መውረዲ መጠወቒ (ኣብ ላዕሊ ዘሎ) ብምጥዋቕ <b>LanguageInterfacePack.exe</b> ፋይል <b>ኣውሪድ</b>ካ ነቲ ፋይል ኣብ ሃርድ ዲስክ ኣቐምጦ.</li>\n<li>ምጽዓን ፕሮግራም ንምጅማር፡ <b>LanguageInterfacePack.exe</b> ናይ ፕሮግራም ፋይል ካብ ሃርድ ዲስክ ክልተ ግዜ ጠውቕ.</li>\n<li>ምጽዓን ንምፍጻም ኣብ መርኣዪ ንዝመጽእ ሓበሬታታት ተከታተል.</li>\n<li>ሓንሳብ ነቲ ኣንብበኒ ፋይል ናይ Microsoft Office 2013 መእሰሪ መንጎኛ ቋንቋ ምስ ጸዓንካዮ ኣብዚ ዝስዕብ ክርከብ ይከኣል እዩ C:\\Program Files\\Common Files\\microsoft shared\\OFFICE15\\1139\\LIPread.htm.</li>\n<li>ምሕዳስ Office 2010 ብOffice 2010 መእሰሪ መንጎኛ ቋንቋ ወይ ኣቐዲሙ ዝነበረ ሕትመት ናብ Office 2013 ብOffice 2013 መእሰሪ መንጎኛ ቋንቋ <b>ኣይድገፍን እዩ</b>. እንድሕር መሰረታዊ ኣጸዓዕና ናይ Office 2010 ናብ Office 2013 ብOffice 2013 Language Interface Pack ከተሐድሶ ተደሊኻ ክትገብሮ ዘለካ፡</li>\n<ul>\n<li>Office 2010 መእሰሪ መንጎኛ ቋንቋ ኣልግሶ.</li>\n<li>Office 2013 መስርሒ ከፊትካ መሐደሲ ኣማራጺ ምረጽ.</li>\n<li>Office 2013 መስርሒ ምስ ተፈጸመ, Office 2013 መእሰሪ መንጎኛ ቋንቋ ጽዒንካ ኣቃንዮ.</li>\n<br />\n<br />\n</ul>\n<br />\n</ol>\n<b>ፍርያት ናይ Office የነቓቅሖ ኣሎ:</b>\n<br />\nእንድሕር ደኣ ነዚ መእተዊ ኮድ ናይ መጽዓኒ ምንባብ ኣብ \"Microsoft Office መነቓቅሒ መራሒ\" መዘራረቢ ጸገም ህልዩካ ኮይኑ, ወይ ኣብ ግዜ ናይ Microsoft Office Language Interface Pack 2013 ትጥቐመሉ እዋን ብምልኡ መጽዓኒ ኮድ ብግቡእ ይርአ እንተዘይሃልዩ, ብክብረትካ ነዚ መራሒ ብምቁራጽ ናብ መሰረታዊ ቋንቋ ፍርያት ንMicrosoft Office ፍርያት ንምንቅቃሕ ተመለስ.<br />\n<br />\n<b>ሓበሬታ ንመጠቐሚ:</b><br />\nተጠቓማይ መንጎኛ ናብ ቋንቋ ናይ Microsoft Office Language Interface Pack 2013 – ትግርኛ ንምቅያር, ነዚ ዝስዕብ ደረጃታት ተከተል:<br />\n<br />\n<ol>\n<li>ምውርዋር Microsoft Office 2013 ኣማራጽታት ቋንቋ ካብዚ <b>Start\\All Programs\\Microsoft Office\\Microsoft Office Tools</b> ኣማራጽታት.</li>\n<li>ኣብ ትሕቲ <b>መርኣዪ ምረጽን መሓገዚ ቋንቋን፡</b> ከምኡ'ውን ኣብ ትሕቲ <b>መርኣዪ ቋንቋ</b> ነቲ ዘድልየካ ቋንቋ መሪጽካ ኣብ <b>ከም ንቡር ግበር</b> መጠወቒ ጠውቕ.</li>\n<li>ኣብ ትሕቲ <b>መመሓየሺ ቋንቋ ምረጽ</b> ነቲ ዘድልየካ ቋንቋ ብምምራጽ ኣብ <b>ከም ንቡር ግበር</b> መጠወቒ ጠውቕ.</li>\n<li>ጠውቕ ኣብ <b>ኦኼ</b> መጠወቒ.</li>\n<br /></ol>\n<br />\nእዚ ኣቐማምጣ ናይዚ ቋንቋ መሪጽካዮ ዘለኻ ኣብ ዝቕጽል ግዜ ነዚ Office ፕሮግራም ምስ ከፈትካዮ ተግባራዊ ክኸውን እዩ.<br />\n<b>መዘኻኸሪ:</b> ሓገዛት ናብ ቋንቋ ናይ Microsoft Office Language Interface Pack 2013 – ትግርኛ ክቅየር ኣይክእልን እዩ. ሓገዝ ኩሉ ግዜ ኣብቲ መበቆላዊ ዝኣተወ ቋንቋ ጥራይ እዩ ተሓጺሩ ዝነብር.<br />ኩሉ ግዜ መርኣዪ ሓገዝ ኣብ ንታሕቲ-ወዳቒ ዝርዝር ናይቲ መሰረታዊ ቋንቋ ኣቐምጥ.<br />\n<br />\n<b>ነዚ ዝወረደ ንምልጋስ:</b><br />\n<li>ካብ ኩሎም ፕሮግራማት Microsoft Office ውጻእ.</li>\n<li>ክልተ ግዜ ጠውቖ ን <b>ፕሮግራማትን ባህርያቶምን</b> ሓባሪ ምስሊ ኣብ Windows <b>ናይ ቁጽጽር ፓነል</b>.</li>\n<li>ኣብ <b>መውጽኢ ወይ መቐየሪ ፕሮግራም</b> መምረጺ, <b>Microsoft Office ማእከል ጥርኑፍ ቋንቋ 2013 - ትግርኛ</b> ኣብዚ ተጻዒኖም ዘለዉ ፕሮግራማት ሳጹን ጠውቕ, ቐጺልካ ኣብ <b>ኣልዕል</b> ኣማራጽታት ምረጽ.</li>\n<li>ኣብ መርኣዪ ዘሎ ሓበሬታታት ተከታተል.</li>\n<br />\n",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "39977",
    "downloadPreload": true
}