{
    "error": "",
    "downloadTitle": "Microsoft Dynamics AX 2009 SP1 White Paper: Country-Specific Update for Israel",
    "downloadDescription": "This white paper describes Microsoft Dynamics AX features that were released in hotfix rollup 6, and that are specific to users in Israel.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "Country-specific updates for Israel.pdf",
            "url": "https://download.microsoft.com/download/9/f/a/9fa1edb9-41cd-4bd1-9e89-fdc1e312a11a/Country-specific updates for Israel.pdf",
            "size": "412307",
            "version": "2009",
            "datePublished": "7/15/2024 3:14:23 AM"
        },
        {
            "isPrimary": "False",
            "name": "Country-specific updates for Israel.xps",
            "url": "https://download.microsoft.com/download/9/f/a/9fa1edb9-41cd-4bd1-9e89-fdc1e312a11a/Country-specific updates for Israel.xps",
            "size": "571680",
            "version": "2009",
            "datePublished": "7/15/2024 3:14:23 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "This white paper describes the country-specific update that was released for Israel in hotfix rollup 6 for Microsoft Dynamics AX 2009 SP1. For more information about the hotfix download, see Microsoft Knowledge Base article <a href=\"https://mbs2.microsoft.com/Knowledgebase/KBDisplay.aspx?scid=kb$en-us$2405516\">2405516</a>.<br /><br />\r\nThe following features are described.<br /><br />\r\n<b>Generating VAT reports</b><br />\r\nIn accordance with the Israeli tax regulations, companies must generate and submit VAT reports on a monthly basis. The VAT report consists of a list of all VAT transactions completed during the reporting period, and must be submitted in a PCN874.txt format. If you paid more VAT on purchases and expenses than you collected on sales for the reporting period, you must submit the VAT report to receive a refund of the overpayment. You can create the following control reports to analyze and balance the VAT transactions before you submit the monthly VAT report:<br />\r\n<UL><LI>VAT analysis report – Includes any mismatched VAT transactions between the VAT report and the invoices issued in the reporting period. You can use this report to investigate the differences.</LI>\r\n<LI>VAT analysis by ledger account – Includes the mismatched VAT transactions for each ledger account. You can use this report to investigate the differences by ledger account.</LI></UL><br /><br />\r\n<b>Consolidation of VAT reports</b><br />\r\nIn accordance with Israeli tax regulations, organizations must consolidate all the VAT reports generated by any of its companies or subsidiaries and submit a consolidated VAT report in a PCN874.txt format on a monthly basis. You can merge individual VAT reports in PCN874.txt format into a consolidated report and submit it to the Israeli tax authority. You can merge various reports into a consolidated VAT report in the following scenarios:<br />\r\n<UL><LI>If all of the companies or subsidiaries use Microsoft Dynamics AX, you can select the files for the VAT transaction report by using the company codes.</LI>\r\n<LI>If some companies or subsidiaries within an organization use Microsoft Dynamics AX and others use different ERP or legacy applications, you can merge the individual files by file location.</LI></UL><br /><br />\r\n<b>Retroactive VAT transactions and accumulated invoices in PCN874.txt format</b><br />\r\nThe Israeli tax regulations require VAT reports to be generated for settlement periods prior to the introduction of the PCN874.txt format. You can also report and classify VAT transactions for accumulated invoices that include external transactions from points-of-sale, such as ATM transactions. These transactions are registered in Microsoft Dynamics AX during specific recurring periods.<br /><br />\r\n<b>Updated layouts for project invoices and project credit notes</b><br />\r\nThe layouts of the project invoice and project credit note have been updated to meet Israeli regulatory requirements. The printed project invoices and credit notes include the company organization number and VAT registration number assigned by the regulatory authorities. Also, the first version of each project invoice or project credit note that you print is considered the original version, and is marked as \"Original.\" All subsequent versions of the project invoice or credit note are considered to be copies of the original and are marked as \"Copy.\" The updated invoice and credit note layouts include the following information:<br />\r\n<UL><LI>Organization number issued by the regulatory authority.</LI>\r\n<LI>VAT registration number issued by the regulatory authority.</LI>\r\n<LI>Printed text “Original” or “Copy” to identify the document as an original or a copy.</LI>\r\n<LI>Signature block to validate a copy of a project invoice or credit note as an original, if an original cannot be printed.</LI></UL>",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2009",
    "detailsSection_file_name": [
        "Country-specific updates for Israel.pdf",
        "Country-specific updates for Israel.xps"
    ],
    "detailsSection_file_size": [
        "402.6 KB",
        "558.3 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<UL><LI>To view the PDF file, you will need a PDF reader, such as the free Adobe Reader. </LI>\n<LI>To view the XPS file, you will need Windows Vista or the Microsoft XML Paper Specification Essentials Pack. </LI>\n<LI>For information about the system requirements for Microsoft Dynamics AX 2009, see <a href=\"http://go.microsoft.com/fwlink/?LinkID=107378\">System requirements for Microsoft Dynamics AX 2009</a>.</LI></UL>",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows Server 2003",
        "Windows Server 2008",
        "Windows Vista"
    ],
    "installInstructionSection": "<OL><LI>Click <b>Download</b> to download the document in PDF file or XPS file format.</LI>\n<LI>Save the file to your computer.</LI></OL>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "5386",
    "downloadPreload": true
}