{
    "error": "",
    "downloadTitle": "Microsoft Lync Server 2010 Group Chat Administration Guide",
    "downloadDescription": "This document guides you through the process of administering Lync Server 2010 Group Chat Server and the related components that are required to let organizations set up searchable, topic-based chat rooms that persist over time, allowing geographically distributed teams to better collaborate with one another while preserving organizational knowledge.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "LS_Admin_GroupChat.doc",
            "url": "https://download.microsoft.com/download/5/d/5/5d51f75f-36ca-41e1-8cb1-176c68504a01/LS_Admin_GroupChat.doc",
            "size": "485376",
            "version": "March2012",
            "datePublished": "7/15/2024 3:14:30 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The purpose of the Microsoft Lync Server 2010 Group Chat Administration Guide is to guide you through the process of administering Lync Server 2010 Group Chat Server and the related components, such as might be required to meet regulatory compliance requirements. These components are required to support organizations set up searchable, topic-based chat rooms that persist over time, allowing geographically distributed teams to better collaborate with one another while preserving organizational knowledge. This document provides step-by-step procedures and other information that you need to set up Lync Server group chat support, including the procedures and information you need to meet the hardware and software prerequisites for administering the group chat components.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "March2012",
    "detailsSection_file_name": [
        "LS_Admin_GroupChat.doc"
    ],
    "detailsSection_file_size": [
        "474.0 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<UL>\r\n<LI>The file is a Microsoft Word document. Users who do not have Microsoft Word can view this document through the downloadable <A HREF=\"http://go.microsoft.com/fwlink/?LinkId=40014\"> Word Viewer</A>.</LI> \r\n</UL>\r\n\r\n\r\n",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows Vista",
        "Windows XP"
    ],
    "installInstructionSection": "<ol>\r\n<li>Click the Download button on this page to start the download, or choose a different language from the drop-down list and click Go.</li>\r\n<li>Do one of the following:</li>\r\n<ul>\r\n<li>To start the installation immediately, click Open or Run this program from its current location.</li>\r\n<li>To copy the download to your computer for installation at a later time, click Save or Save this program to disk.</li>\r\n</ul>\r\n</ol>\r\n",
    "relatedResourcesSection": [
        {
            "title": "lync Server Home Page",
            "url": "http://go.microsoft.com/fwlink/?LinkId=201187"
        },
        {
            "title": "next Hop",
            "url": "http://go.microsoft.com/fwlink/?LinkId=203149"
        },
        {
            "title": "technical Library",
            "url": "http://go.microsoft.com/fwlink/?LinkId=202714"
        }
    ],
    "locale": "en-us",
    "detailsId": "6126",
    "downloadPreload": true
}