{
    "error": "",
    "downloadTitle": "Microsoft® Windows SDK Installation Report Privacy Statement",
    "downloadDescription": "Downloadable Microsoft® Windows SDK Installation Report Privacy Statement.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Privacy Statment Vista SDK.htm",
            "url": "https://download.microsoft.com/download/4/4/d/44dad355-b18a-4782-bd32-a5554c87b059/Privacy Statment Vista SDK.htm",
            "size": "10721",
            "version": "6.0",
            "datePublished": "7/15/2024 3:11:52 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "ja-jp",
            "name": "Japanese"
        },
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "<B>Microsoft® Windows SDK Installation Report Privacy Statement</B><br />\nUpdated:  October, 2006<br /><br />\nMicrosoft is committed to helping to protect your privacy. This privacy statement explains the data collection and use practices of the Windows  SDK installation report you may choose to send to Microsoft (“Installation Report”). This statement does not apply to other online or offline Microsoft sites, products, or services. <br /><br />\n<B>Collection and Use of Information</B><br />\nIf you choose to send an Installation Report to Microsoft, when you exit setup for the Windows SDK, a one-time-only report will be sent to Microsoft about your Windows SDK installation experience.  The Installation Report does not contain any contact information about you (such as your name, address, and phone number).  It does contain certain standard information about your computer, including information about your computer software and hardware such as your operating system name and version, Machine GUID (a randomly generated identifier assigned to your computer), and User GUID (a randomly generated identifier to uniquely but anonymously identify the user).  The Installation Report contains information about your setup experience, including errors you encountered, which features of setup you installed (e.g., headers, libraries, compilers, and tools) and successful completion of setup.  Microsoft uses this information to improve our software.  <br /><br />\nAlthough the IP address through which you access the Internet will be sent to Microsoft with the Installation Report, it will not be stored.<br /><br />\nInformation that is collected by or sent to Microsoft may be stored and processed in the United States or any other country in which Microsoft or its affiliates, subsidiaries or agents maintain facilities.  Microsoft may disclose this information if required to do so by law or in the good faith belief that such action is necessary to: (a) conform to the edicts of the law or comply with legal process served on Microsoft or the site; (b) protect and defend the rights or property of Microsoft and its family of Web sites, or (c) act in urgent circumstances to protect the personal safety of Microsoft employees, users of Microsoft software or services, or members of the public.  Microsoft occasionally hires other companies to provide limited services on its behalf, such as providing customer support, processing transactions, or performing statistical analysis of Installation Reports. Microsoft will provide those companies only the information they need to deliver the service. They are required to maintain the confidentiality of this information and are prohibited from using it for any other purpose.  <br /><br />\n<B>Security</B><br />\nMicrosoft is committed to helping protect the security of the information we collect. The Installation Report uses a variety of security technologies and procedures to help protect this information from unauthorized access, use, or disclosure.  <br /><br />\n<B>Changes to this Statement</B><br />\nMicrosoft may occasionally update this privacy statement. When we do, we will also revise the \"last updated\" date at the top of the privacy statement. We encourage you to periodically review this privacy statement to stay informed about how we are helping to protect the information we collect. <br /><br />\n<B>For More Information</B><br />\nMicrosoft welcomes your comments regarding this privacy statement. If you believe that Microsoft has not adhered to this statement, please contact us by e-mail or postal mail, and we will use commercially reasonable efforts to promptly determine and remedy the problem.<br /><br />\nMicrosoft Windows SDK Installation Report Privacy <br />\nMicrosoft Corporation<br />\nOne Microsoft Way<br />\nRedmond, Washington 98052<br />\nSend email to <a href=\"mailto:wsdkfdb@microsoft.com\">wsdkfdb@microsoft.com</a><br />\n<br /><br />\nTo find contact details for the Microsoft subsidiary or affiliate in your country or region, see <a href=\"http://www.microsoft.com/worldwide\">www.microsoft.com/worldwide</a>.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "6.0",
    "detailsSection_file_name": [
        "Privacy Statment Vista SDK.htm"
    ],
    "detailsSection_file_size": [
        "10.5 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "This applies to the Windows SDK.",
    "systemRequirementsSection_supportedOS": [
        "Windows Server 2003",
        "Windows Server 2003 R2 (32-Bit x86)",
        "Windows Server 2003 R2 x64 editions",
        "Windows Server 2003 Service Pack 1",
        "Windows Vista",
        "Windows XP Service Pack 2"
    ],
    "installInstructionSection": "<B>For More Information</B><br />\nMicrosoft welcomes your comments regarding this privacy statement. If you believe that Microsoft has not adhered to this statement, please contact us by e-mail or postal mail, and we will use commercially reasonable efforts to promptly determine and remedy the problem.<br /><br />\nMicrosoft Windows SDK Installation Report Privacy <br />\nMicrosoft Corporation<br />\nOne Microsoft Way<br />\nRedmond, Washington 98052<br />\nSend email to <a href=\"mailto:wsdkfdb@microsoft.com\">wsdkfdb@microsoft.com</a><br />\n<br /><br />\nTo find contact details for the Microsoft subsidiary or affiliate in your country or region, see <a href=\"http://www.microsoft.com/worldwide\">www.microsoft.com/worldwide</a>.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "8583",
    "downloadPreload": true
}