{
    "error": "",
    "downloadTitle": "Microsoft Dynamics AX 2009 SP1 White Paper: Country-Specific Update for the Russian Federation for Hotfix Rollup 7",
    "downloadDescription": "This white paper describes Microsoft Dynamics AX features that were released in hotfix rollup 7, and that are specific to users in the Russian Federation.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "RU7_Country_specific_updates_for_the_Russian_Federation.pdf",
            "url": "https://download.microsoft.com/download/7/5/b/75ba347c-ddff-4fb6-9850-4c4f3ff42dbb/RU7_Country_specific_updates_for_the_Russian_Federation.pdf",
            "size": "364287",
            "version": "2009",
            "datePublished": "7/15/2024 3:08:29 AM"
        },
        {
            "isPrimary": "False",
            "name": "RU7_Country_specific_updates_for_the_Russian_Federation.xps",
            "url": "https://download.microsoft.com/download/7/5/b/75ba347c-ddff-4fb6-9850-4c4f3ff42dbb/RU7_Country_specific_updates_for_the_Russian_Federation.xps",
            "size": "496650",
            "version": "2009",
            "datePublished": "7/15/2024 3:08:29 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "This white paper describes country-specific updates that were released for the Russian Federation in hotfix rollup 7 for Microsoft Dynamics AX 2009 SP1.<br /><br />\r\nIn accordance with Russian legislation, the Manually write-off method has been updated. You can specify the calculation type for a write-off method as amount or percent, and you can specify the write-off amount for each interval or the percentage of the total to be written off in each period.<br /><br />\r\nWhen you create a deferral manually, the deferral is created with a status of Scheduled, and you can use the Receipt transaction type to create transactions in a deferral journal for such deferrals. When you generate deferrals by using the periodic process, or when you dispose of a fixed asset and you incur a loss, deferrals are created with a transaction type of Receipt. You can also reverse the receipt transaction for both manually created deferrals and the deferrals that are generated by using the periodic process.<br /><br />\r\nIn accordance with Russian legislation, companies that pay value added tax (VAT) must complete the VAT declaration report and submit it to the sales tax authorities no later than the twentieth day of the month following the close of the tax period. Section 3 of the VAT declaration report is updated based on the facture data and the restored VAT data from sales and purchase books. The data includes any prepayments that are received from customers and prepayments that are paid to vendors. Application 1 in Section 3 in the VAT declaration report is updated with fixed asset data.<br /><br />\r\nFor more information about the hotfix download, see Microsoft Knowledge Base article 2503850. For more information about other features that apply to the Russian Federation, refer to the Applications and Business Processes Help. Information that is specific to the Russian Federation includes (RUS) in the title.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2009",
    "detailsSection_file_name": [
        "RU7_Country_specific_updates_for_the_Russian_Federation.pdf",
        "RU7_Country_specific_updates_for_the_Russian_Federation.xps"
    ],
    "detailsSection_file_size": [
        "355.7 KB",
        "485.0 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<UL><LI>To view the PDF file, you will need a PDF reader, such as the free Adobe Reader. </LI>\n<LI>To view the XPS file, you will need Windows Vista or the Microsoft XML Paper Specification Essentials Pack. </LI>\n<LI>For information about the system requirements for Microsoft Dynamics AX 2009, see <a href=\"http://go.microsoft.com/fwlink/?LinkID=107378\">System requirements for Microsoft Dynamics AX 2009</a>.</LI></UL>",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows Server 2003",
        "Windows Server 2008",
        "Windows Vista"
    ],
    "installInstructionSection": "<OL><LI>Click <b>Download</b> to download the document in PDF file or XPS file format.</LI>\n<LI>Save the file to your computer.</LI></OL>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "1410",
    "downloadPreload": true
}