{
    "error": "",
    "downloadTitle": "Microsoft Dynamics AX 2009 SP1 White Paper: Country-Specific Update for India for Hotfix Rollup 7",
    "downloadDescription": "This white paper describes Microsoft Dynamics AX features that were released in hotfix rollup 7, and that are specific to users in India.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "RU7_Country_specific_updates_for_India.xps",
            "url": "https://download.microsoft.com/download/1/f/e/1fea550c-44bb-497a-9afd-ec90330a6575/RU7_Country_specific_updates_for_India.xps",
            "size": "422352",
            "version": "2009",
            "datePublished": "7/15/2024 3:09:25 AM"
        },
        {
            "isPrimary": "True",
            "name": "RU7_Country_specific_updates_for_India.pdf",
            "url": "https://download.microsoft.com/download/1/f/e/1fea550c-44bb-497a-9afd-ec90330a6575/RU7_Country_specific_updates_for_India.pdf",
            "size": "311891",
            "version": "2009",
            "datePublished": "7/15/2024 3:09:25 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "This white paper describes country-specific updates that were released for India in hotfix rollup 7 for Microsoft Dynamics AX 2009 SP1.<br /><br />\r\nIn accordance with a National Securities Depository Limited (NSDL) requirement, you must generate the electronic Tax Deducted at Source (TDS) and Tax Collected at Source (TCS) statements in the file format that includes the deductee's Permanent Account Number (PAN) in TDS statements, non-deduction of TDS for transport contractors, penalty rate deduction of TDS, and responsible person’s contact details in TDS and TCS statements. Starting in fiscal year 2010-2011, regular or correction TDS or TCS statements that are uploaded to the Tax Information Network (TIN) portal must be validated by using version 3.0 of the File Validation Utility (FVU) tool. This version includes the changes based on the NSDL's requirement.<br /><br />\r\nIn accordance with an NSDL requirement, you must include the eight-character receipt number when you print the TDS and TCS certificates. Starting in fiscal year 2010-2011, the tax authority provides a receipt number for every quarterly submission of the TDS and TCS statements. The receipt and token numbers are displayed in the TIN portal when you verify the status of the TDS and TCS statements that you filed. The token number is the provisional receipt number that you receive when you submit the TDS or TCS statements in the TIN portal.<br /><br />\r\nFor more information about the hotfix download, see Microsoft Knowledge Base article 2503850. For more information about other features that apply to India, refer to the Applications and Business Processes Help. Information that is specific to India includes (IND) in the title.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2009",
    "detailsSection_file_name": [
        "RU7_Country_specific_updates_for_India.xps",
        "RU7_Country_specific_updates_for_India.pdf"
    ],
    "detailsSection_file_size": [
        "412.5 KB",
        "304.6 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<UL><LI>To view the PDF file, you will need a PDF reader, such as the free Adobe Reader. </LI>\n<LI>To view the XPS file, you will need Windows Vista or the Microsoft XML Paper Specification Essentials Pack. </LI>\n<LI>For information about the system requirements for Microsoft Dynamics AX 2009, see <a href=\"http://go.microsoft.com/fwlink/?LinkID=107378\">System requirements for Microsoft Dynamics AX 2009</a>.</LI></UL>",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows Server 2003",
        "Windows Server 2008",
        "Windows Vista"
    ],
    "installInstructionSection": "<OL><LI>Click <b>Download</b> to download the document in PDF file or XPS file format.</LI>\n<LI>Save the file to your computer.</LI></OL>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "429",
    "downloadPreload": true
}