{
    "error": "",
    "downloadTitle": "MICROSOFT .NET COMPACT FRAMEWORK",
    "downloadDescription": "Download .NET Compact Framework EULA",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "netcf_eula_enu_cab_download.rtf",
            "url": "https://download.microsoft.com/download/3/2/5/325dc179-b914-4b58-ba84-70848c050a48/netcf_eula_enu_cab_download.rtf",
            "size": "143644",
            "version": "2.0",
            "datePublished": "7/15/2024 3:15:04 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "<b>END USER LICENSE AGREEMENT</b><br/><br/>\n\nThese license terms are an agreement between Microsoft Corporation (or based on where you live, one of its affiliates) and you.  Please read them.  They apply to the software named above, which includes the media on which you received it, if any.  The terms also apply to any Microsoft<br />\n•\tupdates,<br />\n•\tsupplements,<br />\n•\tInternet-based services, and <br />\n•\tsupport services<br />\nfor this software, unless other terms accompany those items.  If so, those terms apply.<br />\nBy using the software, you accept these terms.  If you do not accept them, do not use the software.<br />\n<br />\nIf you comply with these license terms, you have the rights below.<br />\n1.\tINSTALLATION AND USE RIGHTS.  You may install and use any number of copies of the software on your devices running validly licensed copies of applications that require the software to operate.<br />\n2.\tSCOPE OF LICENSE.  The software is licensed, not sold. This agreement only gives you some rights to use the software.  Microsoft reserves all other rights.  Unless applicable law gives you more rights despite this limitation, you may use the software only as expressly permitted in this agreement.  In doing so, you must comply with any technical limitations in the software that only allow you to use it in certain ways.    You may not<br />\n•\twork around any technical limitations in the software;<br />\n•\treverse engineer, decompile or disassemble the software, except and only to the extent that applicable law expressly permits, despite this limitation;<br />\n•\tmake more copies of the software than specified in this agreement or allowed by applicable law, despite this limitation;<br />\n•\tpublish the software for others to copy;<br />\n•\trent, lease or lend the software;<br />\n•\ttransfer the software or this agreement to any third party; or<br />\n•\tuse the software for commercial software hosting services.<br />\n3.\tBACKUP COPY.  You may make one backup copy of the software.  You may use it only to reinstall the software.<br />\n4.\tDOCUMENTATION.  Any person that has valid access to your computer or internal network may copy and use the documentation for your internal, reference purposes.<br />\n5.\tEXPORT RESTRICTIONS.  The software is subject to United States export laws and regulations.  You must comply with all domestic and international export laws and regulations that apply to the software.  These laws include restrictions on destinations, end users and end use.  For additional information, see www.microsoft.com/exporting.<br />\n6.\tSUPPORT SERVICES. Because this software is “as is,” we may not provide support services for it.<br />\n7.\tENTIRE AGREEMENT.  This agreement, and the terms for supplements, updates, Internet-based services and support services that you use, are the entire agreement for the software and support services.<br />\n8.\tAPPLICABLE LAW.<br />\na.\tUnited States.  If you acquired the software in the United States, Washington state law governs the interpretation of this agreement and applies to claims for breach of it, regardless of conflict of laws principles.  The laws of the state where you live govern all other claims, including claims under state consumer protection laws, unfair competition laws, and in tort.<br />\nb.\tOutside the United States.  If you acquired the software in any other country, the laws of that country apply.<br />\n9.\tLEGAL EFFECT.  This agreement describes certain legal rights.  You may have other rights under the laws of your country.  You may also have rights with respect to the party from whom you acquired the software.  This agreement does not change your rights under the laws of your country if the laws of your country do not permit it to do so.<br />\n10.\tDISCLAIMER OF WARRANTY.   The software is licensed “as-is.”  You bear the risk of using it.  Microsoft gives no express warranties, guarantees or conditions.  You may have additional consumer rights under your local laws which this agreement cannot change.  To the extent permitted under your local laws, Microsoft excludes the implied warranties of merchantability, fitness for a particular purpose and non-infringement.<br />\n11.\tLIMITATION ON AND EXCLUSION OF REMEDIES AND DAMAGES.   You can recover from Microsoft and its suppliers only direct damages up to U.S. $5.00.  You cannot recover any other damages, including consequential, lost profits, special, indirect or incidental damages.<br />\nThis limitation applies to<br />\n•\tanything related to the software, services, content (including code) on third party Internet sites, or third party programs; and<br />\n•\tclaims for breach of contract, breach of warranty, guarantee or condition, strict liability, negligence, or other tort to the extent permitted by applicable law.<br />\nIt also applies even if Microsoft knew or should have known about the possibility of the damages.  The above limitation or exclusion may not apply to you because your country may not allow the exclusion or limitation of incidental, consequential or other damages.<br />\nPlease note: As this software is distributed in Quebec, Canada, some of the clauses in this agreement are provided below in French.<br />\nRemarque : Ce logiciel étant distribué au Québec, Canada, certaines des clauses dans ce contrat sont fournies ci-dessous en français.<br />\nEXONÉRATION DE GARANTIE. Le logiciel visé par une licence est offert « tel quel ». Toute utilisation de ce logiciel est à votre seule risque et péril. Microsoft n’accorde aucune autre garantie expresse. Vous pouvez bénéficier de droits additionnels en vertu du droit local sur la protection dues consommateurs, que ce contrat ne peut modifier. La ou elles sont permises par le droit locale, les garanties implicites de qualité marchande, d’adéquation à un usage particulier et d’absence de contrefaçon sont exclues.<br />\nLIMITATION DES DOMMAGES-INTÉRÊTS ET EXCLUSION DE RESPONSABILITÉ POUR LES DOMMAGES.  Vous pouvez obtenir de Microsoft et de ses fournisseurs une indemnisation en cas de dommages directs uniquement à hauteur de 5,00 $ US. Vous ne pouvez prétendre à aucune indemnisation pour les autres dommages, y compris les dommages spéciaux, indirects ou accessoires et pertes de bénéfices.<br />\nCette limitation concerne :<br />\n•\ttout  ce qui est relié au logiciel, aux services ou au contenu (y compris le code) figurant sur des sites Internet tiers ou dans des programmes tiers ; et<br />\n•\tles réclamations au titre de violation de contrat ou de garantie, ou au titre de responsabilité stricte, de négligence ou d’une autre faute dans la limite autorisée par la loi en vigueur.<br />\nElle s’applique également, même si Microsoft connaissait ou devrait connaître l’éventualité d’un tel dommage.  Si votre pays n’autorise pas l’exclusion ou la limitation de responsabilité pour les dommages indirects, accessoires ou de quelque nature que ce soit, il se peut que la limitation ou l’exclusion ci-dessus ne s’appliquera pas à votre égard.<br />\nEFFET JURIDIQUE.  Le présent contrat décrit certains droits juridiques. Vous pourriez avoir d’autres droits prévus par les lois de votre pays.  Le présent contrat ne modifie pas les droits que vous confèrent les lois de votre pays si celles ci ne le permettent pas.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2.0",
    "detailsSection_file_name": [
        "netcf_eula_enu_cab_download.rtf"
    ],
    "detailsSection_file_size": [
        "140.3 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "Windows Mobile 5.0<br />\nWindows Mobile 6.0",
    "systemRequirementsSection_supportedOS": [
        "Windows Mobile 5.0",
        "Windows Mobile 5.0 software for Pocket PC",
        "Windows Mobile 5.0 software for Smartphone",
        "Windows Mobile 6"
    ],
    "installInstructionSection": "<OL><LI>Click the <b>Download</b> button on this page to start the download.<br />\n</LI><LI>Do one of the following:</LI><UL><LI>To start the installation immediately, click <B>Open</B> or <B>Run this program from its current location</B>.</LI><LI>To copy the download to your computer for installation at a later time, click <B>Save</B> or <B>Save this program to disk</B>.</LI></UL></OL>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "10537",
    "downloadPreload": true
}