{
    "error": "",
    "downloadTitle": ".NET Rocks! - Stephen Forte on Remote/Distributed Teams",
    "downloadDescription": "Stephen Forte is back, this time talking about working with distributed teams. He shares his valuable experiences and insights.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "20080306SForte.zip",
            "url": "https://download.microsoft.com/download/7/a/8/7a8f66c2-266a-4bd0-8c53-f8584664aaa0/20080306SForte.zip",
            "size": "45051586",
            "version": "1.0",
            "datePublished": "4/15/2024 3:11:46 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "hen Forte is a partner in the Accord Advisory Group, a global strategic consulting group. Prior he was the Chief Technology Officer (CTO) and co-founder of Corzen, Inc, a New York based provider of online market research data for Wall Street Firms. Corzen was acquired by Wanted Technologies (TXV: WAN) in 2007. Stephen is also the Microsoft Regional Director for the NY Metro region and speaks regularly at industry conferences around the world. He has written several books on application and database development including Programming SQL Server 2008 (MS Press). Prior to Corzen, Stephen served as the CTO of Zagat Survey in New York City and also was co-founder and CTO of the New York based software consulting firm The Aurora Development Group. He currently an MVP, INETA speaker and is the co-moderator and founder of the NYC .NET Developer User Group. Stephen has an MBA from the City University of New York (Baruch College). Stephen is training for a return to Mt. Everest this fall.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.0",
    "detailsSection_file_name": [
        "20080306SForte.zip"
    ],
    "detailsSection_file_size": [
        "43.0 MB"
    ],
    "detailsSection_file_date": "4/15/2024",
    "systemRequirementsSection": "Presentations are played using the Microsoft Windows Media Player.",
    "systemRequirementsSection_supportedOS": [
        "Windows 2000",
        "Windows Server 2003",
        "Windows Server 2008",
        "Windows Vista",
        "Windows XP"
    ],
    "installInstructionSection": "- Select \"Save this Program to Disk\" to copy the download to your machine for installation at a later time.<br />\n- Once the file has been downloaded, execute it in order to extract the media file.",
    "relatedResourcesSection": [
        {
            "title": ".NET Rocks! site",
            "url": "http://msdn.microsoft.com/dotnetrocks"
        }
    ],
    "locale": "en-us",
    "detailsId": "13584",
    "downloadPreload": true
}