{
    "error": "",
    "downloadTitle": "Microsoft Virtual PC for Mac 7.0.3 Update",
    "downloadDescription": "This update fixes a vulnerability that an attacker can use to overwrite the contents of your computer's memory with malicious code. This update is recommended for all users who are using Virtual PC for Mac 7.0, 7.0.1, and 7.0.2.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "VirtualPC703.dmg",
            "url": "https://download.microsoft.com/download/d/9/0/d9008f48-5b39-4da6-ab2a-d19d80b322c8/VirtualPC703.dmg",
            "size": "17577116",
            "version": "7.0.3",
            "datePublished": "7/15/2024 3:09:58 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        },
        {
            "cultureCode": "fr-fr",
            "name": "French"
        },
        {
            "cultureCode": "de-de",
            "name": "German"
        },
        {
            "cultureCode": "sv-se",
            "name": "Swedish"
        },
        {
            "cultureCode": "ja-jp",
            "name": "Japanese"
        }
    ],
    "detailsSection": "This update fixes a vulnerability that an attacker can use to overwrite the contents of your computer's memory with malicious code. This update is recommended for all users who are using Virtual PC for Mac 7.0, 7.0.1, and 7.0.2. For more information, please read Knowledge Base (KB) article <a href=\"http://go.microsoft.com/fwlink/?LinkId=93729\" target=\"_blank\">KB 937986</a> on the Microsoft Web site at support.microsoft.com.<br/><br/>\n<b>Applies to:</b> Virtual PC for Mac 7.0, 7.0.1, and 7.0.2",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "7.0.3",
    "detailsSection_file_name": [
        "VirtualPC703.dmg"
    ],
    "detailsSection_file_size": [
        "16.8 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "Before you can install this update, one or more of the following programs must be installed on your computer: Virtual&nbsp;PC for Mac 7.0 through 7.0.2.<br/><br/>\nIn addition, your computer must meet the following minimum requirements:<br/>\n<b>Processor</b>: 700 MHz native PowerPC G3, G4, or G5 processor (Intel processors are not supported)<br/>\n<b>Operating system</b>: Mac OS X 10.2.8 (Jaguar) or a later version of Mac OS. G5 processor requires Mac&nbsp;OS&nbsp;X 10.3 or 10.4.1 to run Virtual&nbsp;PC for Mac.<br/>\n<b>Memory</b>: 512 MB of RAM<br/>\n<b>Hard disk</b>: 70 MB of available hard disk space is temporarily required to complete installation; after installation, the program requires 50&nbsp;MB of hard disk space<br/>\n<b>Internet access</b>: Internet connection through either an Internet service provider (ISP) or a network. Internet access might require a fee to an ISP; local or long-distance telephone charges might also apply.<br/><br/>\n<b>Tip</b>&nbsp;&nbsp; If you're not sure whether your computer meets these requirements, see the System Profiler program included with the Mac&nbsp;OS. You can start System Profiler by double-clicking its program file in the Applications/Utilities folder on your hard disk.",
    "systemRequirementsSection_supportedOS": [
        "Apple Mac OS X"
    ],
    "installInstructionSection": "<b>Before you install this update</b>\n<ul>\n   <li>Quit any other programs that are running, including virus-protection programs, because they might interfere with installation.</li>\n   <li><b>Important</b>&nbsp;&nbsp; Make sure that your Mac&nbsp;OS&nbsp;X user account has administrator privileges. (You must know both the user name and password for this account.) To check your user account for administrator privileges, on the <b>Apple</b> menu, click <b>System Preferences</b>, and then click <b>Accounts</b>. User accounts with administrator privileges have the word \"Admin\" next to them. For more information about administrator privileges, see Mac Help.</li>\n</ul>\n<br/>\n<b>To install this update</b>\n<ol>\n  <li>Print this page if you want to use it as a reference when you are offline.</li>\n  <li>Make sure your computer meets the minimum system requirements.</li>\n  <li>Click the <b>Download</b> button.</li>\n  <li>Follow the instructions on the screen to save the file to your hard disk.<br/>\n  If you are using Safari, the file is downloaded to the desktop unless you specified a different folder in the <b>Preferences</b> dialog box of Safari. (To check your preferences, on the <b>Safari</b> menu, click <b>Preferences,</b> and then click <b>General</b>.)<br/>\n  If you are using Internet Explorer, the Download Manager saves the file to the desktop unless you specified a different folder in the <b>Preferences</b> dialog box of Internet Explorer. (To check your preferences, on the <b> Explorer</b> menu, click <b>Preferences</b>, and then click <b>Download Options</b> in the left pane).</li>\n  <li>On your hard disk, double-click the file that you downloaded in step&nbsp;4 to open the disk image.<br/>\n  Depending on the Web browser that you are currently using, this step might be performed for you automatically.</li>\n  <li>Double-click <b>Update Virtual PC</b> to start the update. </li>\n <li>Follow the on-screen instructions.</li>\n</ol>\n<br/>\n<b>To remove this update</b>\nThe Virtual PC for Mac 7.0.3 Update does not include an uninstall feature.",
    "additionalInformationSection": "For more information about the Virtual PC for Mac 7.0.3 Update, after you install it, see Virtual&nbsp;PC Help.<br/><br/>\nFor additional assistance, visit the <a href=\"http://go.microsoft.com/fwlink/?LinkId=18214\" target=\"_blank\">Microsoft Web site</a> at www.microsoft.com/mac.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "14201",
    "downloadPreload": true
}