{
    "error": "",
    "downloadTitle": "Monitoring Applications via Windows Phone 7.5 Devices and the Cloud",
    "downloadDescription": "Content current as of February 2012. Volume Licensing IT Monitor (VLIT) is designed to provide near-real times status on availability and performance for critical apps in the VLIT ecosystem along with their business process mapping. It is difficult for the business and IT leadership to understand which critical business processes are impacted if a system is down or having issues. ",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "2008_WinPhone_Article.docx",
            "url": "https://download.microsoft.com/download/f/c/6/fc6b831e-c2ff-41d7-b006-863ffbf81fe4/2008_WinPhone_Article.docx",
            "size": "322365",
            "version": "1",
            "datePublished": "7/15/2024 3:28:24 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "<b>Content current as of February 2012. The following content may no longer reflect Microsoft’s current position or infrastructure. This content should be viewed as reference documentation only, to inform IT business decisions within your own company or organization.</b><br /><br />\r\nVolume Licensing IT Monitor (VLIT) is designed to provide near-real times status on availability and performance for critical apps in the VLIT ecosystem along with their business process mapping. It is difficult for the business and IT leadership to understand which critical business processes are impacted if a system is down or having issues. Previously monitoring would include: email, ping support staff, and get conflicting messages back. Now with VLIT Monitor, monitoring alerts can be sent directly to your Windows Phone 7.5 device wherever your are.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1",
    "detailsSection_file_name": [
        "2008_WinPhone_Article.docx"
    ],
    "detailsSection_file_size": [
        "314.8 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "Not Available. Migrated from DMS",
    "systemRequirementsSection_supportedOS": [
        "Windows Server 2008"
    ],
    "installInstructionSection": "Not Available. Migrated from DMS",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "28944",
    "downloadPreload": true
}