{
    "error": "",
    "downloadTitle": "Microsoft® SQL Server® 2012 Feature Pack",
    "downloadDescription": "The Microsoft® SQL Server® 2012 Feature Pack is a collection of stand-alone packages which provide additional value for Microsoft® SQL Server® 2012.",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "SQL Server 2012 Feature Pack Instructions.txt",
            "url": "https://download.microsoft.com/download/f/e/d/fedb200f-de2a-46d8-b661-d019dfe9d470/SQL Server 2012 Feature Pack Instructions.txt",
            "size": "420",
            "version": "11.0.2100.60",
            "datePublished": "7/15/2024 5:02:52 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "pt-br",
            "name": "Portuguese (Brazil)"
        },
        {
            "cultureCode": "ru-ru",
            "name": "Russian"
        },
        {
            "cultureCode": "ja-jp",
            "name": "Japanese"
        },
        {
            "cultureCode": "zh-cn",
            "name": "Chinese (Simplified)"
        },
        {
            "cultureCode": "es-es",
            "name": "Spanish"
        },
        {
            "cultureCode": "fr-fr",
            "name": "French"
        },
        {
            "cultureCode": "it-it",
            "name": "Italian"
        },
        {
            "cultureCode": "ko-kr",
            "name": "Korean"
        },
        {
            "cultureCode": "de-de",
            "name": "German"
        },
        {
            "cultureCode": "en-us",
            "name": "English"
        },
        {
            "cultureCode": "zh-tw",
            "name": "Chinese (Traditional)"
        }
    ],
    "detailsSection": "The Microsoft® SQL Server® 2012 Feature Pack is a collection of stand-alone packages which provide additional value for Microsoft® SQL Server® 2012.  It includes the latest versions of:<br />\n<ul>\n  <li>Tool and components for Microsoft® SQL Server® 2012.</li>\n  <li>Add-on providers for Microsoft® SQL Server® 2012.</li>\n  </ul><br />\n\n<b>Note:</b> Some components in the Microsoft® SQL Server® 2012 Feature Pack have certain Internet-enabled features, including the Customer Experience Improvement Program and Error and Usage Reporting component, enabled by default to help us identify and address issues that you may encounter while using SQL Server®. For more information and instructions on how to disable these features,\nsee the <a href=\"http://go.microsoft.com/fwlink/?LinkId=216743\">Microsoft SQL Server Privacy Statement</a><br /><br />\n\n<b>Note:</b> Some components in the Microsoft® SQL Server® 2012 Feature Pack of  SQL Server® have two different methods to complete the installation process:\n<ul>\n    <li> Attended Installation – an interactive user interface will guide you through the set-up process and obtain all of the information and consent required to complete the installation. This includes the displaying, acknowledgement, and archiving of the applicable SQL Server license terms.</li>\n<br />\n    <li> Un-attend Installation – this is a command Line set-up process that does not have an interactive user interface to guide you through the set-up process. In this case, you will be required to enter a parameter during installation that indicates your acceptance of the license terms.</li>\n</ul>\n<br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "11.0.2100.60",
    "detailsSection_file_name": [
        "SQL Server 2012 Feature Pack Instructions.txt"
    ],
    "detailsSection_file_size": [
        "420 bytes"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<br />\n<b>Note:</b> System requirements may vary among the install packages included in the Feature Pack.<br /><br />\n\n<b>Note:</b> When an MSI package is redistributed it must not be renamed, otherwise you may see failures if updates are installed for that package.",
    "systemRequirementsSection_supportedOS": [
        "Windows Vista Service Pack 2",
        "Windows Server 2008 Service Pack 2",
        "Windows Server 2008 R2",
        "Windows 7"
    ],
    "installInstructionSection": "<br/>\r\n Download the appropriate file by clicking one of the links below, then run the downloaded file to install that package.<br /><br />\r\n<b>Note:</b> To archive a copy of the license terms, prior to accepting them, copy and paste the terms to a word processing program, then print or save the file to your favorite directory.<br/><br/><br/>\r\n\r\n<b><u>NEW COMPONENTS TO THE MICROSOFT SQL SERVER 2012 FEATURE PACK</u></b><br/>\r\n<ul>\r\n<a name=\"SQL Server LocalDB\"></a><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237665\">Microsoft® SQL Server® 2012 LocalDB</a></b>\r\n<br/>\r\n<ul>\r\nLocalDB (MSI installer) <br/>\r\nNew to the SQL Server® Express family, LocalDB is a lightweight version of Express that has the same programmability features, yet runs in user mode and has a fast, zero-configuration installation and short list of pre-requisites. Use this if you need a simple way to create and work with databases from code. It can be bundled with Visual Studio, other Database Development tools or embedded with an application that needs local databases. <br/>\r\n<br/>\r\n</ul>\r\n<br />\r\n\r\n<a name=\"MDS Add-in\"></a><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237667\">Microsoft® SQL Server® 2012 Master Data Service Add-in for Microsoft® Excel®</a></b>\r\n<br/>\r\n<ul>\r\nThe Master Data Services Add-in for Excel gives multiple users the ability to update master data in a familiar tool without compromising the data’s integrity in MDS. From within the Add-in, users can publish data to the MDS database with the click of a button. Administrators can use the Add-in to create new model objects and load data without ever launching any administrative tools, helping to speed deployment. With the Master Data Services Add-in for Excel, all master data remains centrally managed in MDS, while the ability to read or update the data is distributed to those who need it.<br/>\r\n<br/>\r\nThe Master Data Services (MDS) Add-in for Microsoft Excel is a data management tool that delivers a multitude of master data management capabilities with ease and efficiency.  Manage MDS data within an interface you already know and love – Microsoft® Excel.  Leverage existing Excel functionality to share your managed lists with others, knowing these lists can be secured and monitored with all of the features provided by Master Data Services. <br />\r\n</ul>\r\n<br />\r\n\r\n<a name=\"StreamInsight v2.0\"></a><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239685\">Microsoft® SQL Server® StreamInsight v2.0</a></b>\r\n<br/>\r\n<ul>\r\nMicrosoft® StreamInsight is Microsoft’s Complex Event Processing technology to help businesses create event-driven applications and derive better insights by correlating event streams from multiple sources with near-zero latency. <br />\r\n<br />\r\n</ul>\r\n<br />\r\n\r\n<a name=\"Semantic Full Text Search\"></a><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237666\">Microsoft® SQL Server® 2012 Semantic Language Statistics</a></b>\r\n<br/>\r\n<ul>\r\nThe Semantic Language Statistics Database is a required component for the Statistical Semantic Search feature in Microsoft SQL Server 2012. You can download this database from this page, attach it to your SQL Server 2012 instance, and register it to use the new Semantic Search features. <br />\r\n</ul>\r\n<br />\r\n</ul>\r\n<br/>\r\n<b><u>MICROSOFT SQL SERVER 2012 ANALYSIS SERVICES FEATURE PACK COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"Microsoft® SQL Server® 2012 PowerPivot for Microsoft® Excel 2010\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237668\">Microsoft® SQL Server® 2012 PowerPivot for Microsoft® Excel 2010</a></b>\r\n <ul>\r\nMicrosoft® PowerPivot for Microsoft® Excel 2010 provides ground-breaking technology, such as fast manipulation of large data sets (often millions of rows), streamlined integration of data, and the ability to effortlessly share your analysis through Microsoft® SharePoint 2010. <br />\r\n  </ul>\r\n<br />\r\n<a name=\"ADOMD.NET\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 ADOMD.NET </b> \r\n<ul>\r\nADOMD.NET is a Microsoft .NET Framework object model that enables software developers to create client-side applications that browse metadata and query data stored in Microsoft SQL Server 2012 Analysis Services. ADOMD.NET is a Microsoft ADO.NET provider with enhancements for online analytical processing (OLAP) and data mining.<br /><br />\r\n<b>Note</b>:The English ADOMD.NET setup package installs support for all SQL Server 2012 languages.<br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239661&clcid=0x409 \">X86 Package</a></b>(SQL_AS_ADOMD.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239662&clcid=0x409 \">X64 Package</a></b>(SQL_AS_ADOMD.msi)<br />\r\n</ul>\r\n</ul>\r\n\r\n<br />\r\n\r\n<a name=\"ASOLEDB\"></a><br /><br />\r\n<b>Microsoft® Analysis Services OLE DB Provider for Microsoft® SQL Server® 2012</b> \r\n<ul>\r\nThe Analysis Services OLE DB Provider is a COM component that software developers can use to create client-side applications that browse metadata and query data stored in Microsoft SQL Server 2012 Analysis Services. This provider implements both the OLE DB specification and the specification’s extensions for online analytical processing (OLAP) and data mining.<br /><br />\r\n<b>Note:</b> Microsoft Analysis Services OLE DB Provider requires <b>Microsoft Core XML Services (MSXML) 6.0</b><br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239663&clcid=0x409\">X86 Package</a></b>(SQL_AS_OLEDB.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239664&clcid=0x409\">X64 Package</a></b>(SQL_AS_OLEDB.msi)<br />\r\n </ul>\r\n</ul>\r\n\r\n<br />\r\n\r\n<a name=\"AMO\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Analysis Management Objects </b> \r\n<ul>\r\nAnalysis Management Objects (AMO) is a .NET Framework object model that enables software developers to create client-side applications to manage and administer Analysis Services objects.<br /><br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239665&clcid=0x409\">X86 Package</a></b>(SQL_AS_AMO.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239666&clcid=0x409\">X64 Package</a></b>(SQL_AS_AMO.msi)<br />\r\n</ul>\r\n</ul>\r\n<a name=\"DM Addins\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239671\"> Microsoft® SQL Server® 2012 Data Mining Add-ins for Office 2010</a></b><br/>\r\n<ul>\r\nThe Microsoft SQL Server 2012 Data Mining Add-ins for Microsoft Office 2010 package enables you to take advantage of SQL Server predictive analytics in Office Excel 2010 and Office Visio 2010.  This release adds support for 64-bit Office 2010. The download includes the following components: \r\n<ul>\r\n<li>Table Analysis Tools for Excel: This add-in provides easy-to-use tools that leverage SQL Server 2012 data mining features to perform powerful analytics on your spreadsheet data. </li>\r\n<li>Data Mining Client for Excel: This add-in enables you to go through the full data mining model development lifecycle within Excel 2010 using your spreadsheet data or external data accessible through your SQL Server 2012 Analysis Services instance.</li>\r\n<li>Data Mining Templates for Visio: This add-in enables you to render and share your mining models as annotatable Visio 2010 drawings.</li>\r\n</ul>\r\n</ul>\r\n\r\n<br/>\r\n<a name=\"DM Viewer\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Data Mining Viewer </b> \r\n<ul>\r\nThe Data Mining Web Controls Library was developed to be a set of Microsoft Windows Forms controls that enable software developers to display data mining models created using Microsoft SQL Server 2012 Analysis Services in their client-side applications. The controls in this library display the patterns that are contained in Analysis Services mining models.<br /><br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239674&clcid=0x409\">X86 Package</a></b>( SQL_AS_DMViewer.msi)<br />\r\n</ul>\r\n<br/>\r\n<br/>\r\n</ul>\r\n</ul>\r\n<b><u>MICROSOFT SQL SERVER 2012 REPORTING SERVICES FEATURE PACK COMPONENTS</u></b>\r\n<br/>\r\n<ul>\r\n<a name=\"Report Builder 3.0\"></a><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237664\"> Microsoft® SQL Server® Report Builder for Microsoft® SQL Server® 2012</a></b>\r\n<br/>\r\n<ul>\r\nReport Builder provides a productive report-authoring environment for IT professionals and power users. It supports the full operational reporting capabilities of SQL Server 2012 Reporting Services. The download provides a stand-alone installer for Report Builder.<br />\r\n<br />\r\n</ul>\r\n<a name=\"RS Add-in for SharePoint Technologies 2010\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=237669\">Microsoft® SQL Server® 2012 Reporting Services Add-in for Microsoft® SharePoint® 2010</a></b>\r\n  <ul>\r\nThe Microsoft® SQL Server® 2012 Reporting Services Add-in for Microsoft® SharePoint® 2010 allows you to integrate your reporting environment with SharePoint to experience the benefits of using the collaborative environment provided by SharePoint.<br/>\r\n<br />\r\n </ul>\r\n</ul>\r\n\r\n<br/>\r\n<b><u>MICROSOFT SQL SERVER 2012 MANAGABILITY FEATURE PACK COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"dacframework\"></a><br /><br />\r\n <b>Microsoft® SQL Server® 2012 Data-Tier Application Framework</b>\r\n <ul>\r\nThe SQL Server Data-tier Application (DAC) framework is a component based on the .NET Framework that provides application lifecycle services for database development and management. Application lifecycle services include extract, build, deploy, upgrade, import, and export for data-tier applications in SQL Azure, SQL Server 2012, SQL Server 2008 R2, SQL Server 2008, and SQL Server 2005 through SQL Server Data Tools and SQL Server Management Studio. Note: Microsoft SQL Server 2012 Data-tier Application Framework requires Microsoft SQL Server System CLR Types, and Microsoft SQL Server Transact-SQL ScriptDom both of which are available on this page.<br/>\r\n<br />\r\n <ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239630&clcid=0x409\">X86 Package</a></b>(dacframework.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239631&clcid=0x409\">X64 Package</a></b> (dacframework.msi)<br />\r\n<br />\r\n</ul>\r\n </ul>\r\n\r\n<a name=\"T-SQL Language Service\"></a><br /><br />\r\n <b>Microsoft® SQL Server® 2012 Transact-SQL Language Service </b>\r\n<ul>\r\nThe SQL Server Transact-SQL Language Service is a component based on the .NET Framework which provides parsing validation and IntelliSense services for Transact-SQL for SQL Server 2012, SQL Server 2008 R2, and SQL Server 2008.\r\n<br />\r\n <ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239632&clcid=0x409\">X86 Package</a></b>(tsqllanguageservice.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239633&clcid=0x409\">X64 Package</a></b> (tsqllanguageservice.msi)<br />\r\n<br />\r\n</ul>\r\n </ul>\r\n\r\n<a name=\"PowerShell\"></a><br /><br />\r\n  <b>Microsoft® Windows PowerShell Extensions for Microsoft® SQL Server® 2012</b>\r\n  <ul>\r\n    The Microsoft Windows PowerShell Extensions for SQL Server 2012 includes a provider and a set of cmdlets that enable administrators and developers to build PowerShell scripts for managing instances of SQL Server. The SQL Server PowerShell Provider delivers a simple mechanism for navigating SQL Server instances that is similar to file system paths. PowerShell scripts can then use the SQL Server Management Objects to administer the instances. The SQL Server cmdlets support operations such as executing Transact-SQL scripts or evaluating SQL Server policies.<br /><br />\r\n<b>Note:</b> Windows PowerShell Extensions for SQL Server 2012 requires <b>Microsoft SQL Server 2012 Shared Management Objects</b>, also available on this page. This component also requires Windows PowerShell 2.0; download instructions are on the Windows Server 2003 <a href=\"http://go.microsoft.com/fwlink/?LinkId=109843\">Web site</a>.<br/>\r\n    <ul>\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239655&clcid=0x409\">X86 Package</a></b> (PowerShellTools.msi)<br />\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239656&clcid=0x409\">X64 Package</a></b> (PowerShellTools.msi)<br />\r\n          </ul>\r\n  </ul>\r\n<br />\r\n\r\n<a name=\"SMO\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Shared Management Objects </b>\r\n<ul>\r\nSQL Server Management Objects (SMO) is a .NET Framework object model that enables software developers to create client-side applications to manage and administer SQL Server objects and services. This object model will work with SQL Server 2005, SQL Server 2008, SQL Server 2008 R2, and SQL Server 2012.<br /><br/>\r\n<b>Note:</b> Microsoft SQL Server Management Objects requires -  Microsoft SQL Server System CLR Types. This is available on this page.<br />\r\n <ul>\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239658&clcid=0x409\">X86 Package</a></b> (SharedManagementObjects.msi)<br />\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239659&clcid=0x409\">X64 Package</a></b> (SharedManagementObjects.msi)<br />\r\n    </ul>\r\n</ul>\r\n<br />\r\n</ul>\r\n<br/>\r\n<b><u>MICROSOFT SQL SERVER CONNECTIVITY FEATURE PACK COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"SNAC\"></a><br /><br />\r\n  <b>Microsoft® SQL Server® 2012 Native Client </b>\r\n  <ul>\r\n   \r\nMicrosoft SQL Server Native Client (SQL Server Native Client) is a single dynamic-link library (DLL) containing both the SQL OLE DB provider and SQL ODBC driver. It contains run-time support for applications using native-code APIs (ODBC, OLE DB and ADO) to connect to Microsoft SQL Server 2005, 2008, 2008 R2, and SQL Server 2012. SQL Server Native Client should be used to create new applications or enhance existing applications that need to take advantage of new SQL Server 2012 features. This redistributable installer for SQL Server Native Client installs the client components needed during run time to take advantage of new SQL Server code name ‘Denali’ features, and optionally installs the header files needed to develop an application that uses the SQL Server Native Client API.<br /><br/>\r\n  \r\n  <ul>\r\n      \r\n <b><a href=\"http://go.microsoft.com/fwlink/?LinkID=239647&clcid=0x409\">X86 Package</a></b> (sqlncli.msi)<br />\r\n     \r\n <b><a href=\"http://go.microsoft.com/fwlink/?LinkID=239648&clcid=0x409\">X64 Package</a></b> (sqlncli.msi)<br />\r\n \r\n  \r\n</ul>\r\n </ul>\r\n<br />\r\n\r\n<a name=\"SQLCMD\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Command Line Utilities</b> \r\n<ul>\r\nThe SQLCMD utility allows users to connect to, send Transact-SQL batches from, and output rowset information from SQL Server 2005, SQL Server 2008, SQL Server 2008 R2, and SQL Server 2012 instances. The bcp utility bulk copies data between an instance of Microsoft SQL Server 2012 and a data file in a user-specified format. The bcp utility can be used to import large numbers of new rows into SQL Server tables or to export data out of tables into data files.<br /><br />\r\n<b>Note:</b> This component requires both <b><a href=\"http://go.microsoft.com/fwlink/?LinkId=123373\">Windows Installer 4.5</a></b> and <b>Microsoft SQL Server Native Client</b> (which is another component available from this page). <br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239649&clcid=0x409\">X86 Package</a></b>(SqlCmdLnUtils.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239650&clcid=0x409\">X64 Package</a></b> (SqlCmdLnUtils.msi)<br />\r\n</ul>\r\n</ul>\r\n\r\n<br />\r\n\r\n<a name=\"ODBC\"></a><br /><br />\r\n  <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239638\">Microsoft® SQL Server® ODBC Driver for Linux V 1.0</a></b>\r\n  <ul>\r\nThe 64 bit version of the Microsoft SQL Server ODBC Driver for Linux provides robust data access to Microsoft SQL Server. It allows native C and C++ applications to leverage the standard ODBC API and connect to Microsoft SQL Server 2008 R2 and Microsoft SQL Server 2012. This feature pack includes the 64-bit ODBC driver ( For Red Hat Enterprise Linux 5 and Red Hat Enterprise Linux 6), docs, and command line utilities (sqlcmd and bcp).<br/>\r\n </ul>\r\n<br />\r\n\r\n\r\n<a name=\"JDBC\"></a><br /><br />\r\n   <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239639\">Microsoft® JDBC Driver 4.0 for SQL Server®</a></b>\r\n   <ul>\r\n\r\nIn our continued commitment to interoperability, Microsoft has released a new Java Database Connectivity (JDBC) driver. The Microsoft  JDBC Driver 4.0 for SQL Server is available to all SQL Server users at no additional charge, and provides access to SQL Server 2012 and other versions from any Java application, application server, or Java-enabled applet. This is a Type 4 JDBC driver that provides database connectivity through the standard JDBC Application Program Interfaces (APIs) available in Java Platform, Enterprise Editions 5 and 6. This release of the JDBC Driver is JDBC 4.0 compliant and runs on the Java Development Kit (JDK) version 5.0 or 6.0. It has been tested against major application servers including IBM WebSphere, and SAP NetWeaver. <br/>\r\n </ul>\r\n<br />\r\n<a name=\"PHP Driver 3.0\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239640\">Microsoft® Drivers 3.0 for PHP for Microsoft® SQL Server®</a></b>\r\n \r\n<ul>\r\nThe Microsoft Drivers for PHP for SQL Server are PHP 5 extensions that allows for the reading and writing of SQL Server data from within PHP scripts. The SQLSRV extension provides a procedural interface while the PDO_SQLSRV extension implements PDO for accessing data in all editions of SQL Server 2005 and later.<br />\r\n<ul>\r\n<br />\r\n</ul></ul>\r\n\r\n<a name=\"SAP BW\"></a><br /><br />\r\n  \r\n<b>Microsoft® Connector 1.1 for SAP BW for SQL Server® 2012</b>\r\n\r\n  <ul>\r\n\r\nThe Microsoft Connector for SAP BW is a set of managed components for transferring data to or from an SAP NetWeaver BW version 7.0 system. The component is designed to be used with SQL Server 2012 Integration Services. To install the component, run the platform-specific installer for x86 or x64 respectively. For more information see the Readme and the installation topic in the Help file.\r\n<br />\r\n <ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239641&clcid=0x409\">X86 Package</a></b>(SAPBI.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239642&clcid=0x409\">X64 Package</a></b> (SAPBI.msi)<br />\r\n<br />\r\n</ul>\r\n </ul>\r\n<br />\r\n</ul>\r\n\r\n<b><u>MICROSOFT SQL SERVER 2012 ENGINE FEATURE PACK COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"T-SQL ScriptDom\"></a><br /><br />\r\n \r\n<b>Microsoft® SQL Server® 2012 Transact-SQL ScriptDom </b>\r\n\r\n  <ul>\r\n\r\nMicrosoft SQL Server Transact-SQL ScriptDom is a .NET Framework API that provides parsing and scripting services for Transact-SQL. This API supports SQL Server 2000, SQL Server 2005, SQL Server 2008, SQL Server 2008 R2 and SQL Server 2012 versions.<br />\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239634&clcid=0x409\">X86 Package</a></b>(SQLDOM.MSI)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239635&clcid=0x409\">X64 Package</a></b> (SQLDOM.MSI)<br />\r\n<br />\r\n</ul>\r\n </ul>\r\n<br />\r\n<a name=\"T-SQL Compiler Service\"></a><br /><br />\r\n \r\n<b>Microsoft® SQL Server® 2012 Transact-SQL Compiler Service </b>\r\n  <ul>\r\nMicrosoft SQL Server Transact-SQL Compiler Service is a set of components that provide the compilation and validation services for Transact-SQL. This component can be used only via the Microsoft SQL Server Data-Tier Application Framework build API.<br />\r\n\r\n <ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239636&clcid=0x409\">X86 Package</a></b>(SQLLS.MSI)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239637&clcid=0x409\">X64 Package</a></b> (SQLLS.MSI)<br />\r\n<br />\r\n</ul>\r\n </ul>\r\n<br />\r\n\r\n\r\n<a name=\"SQLSYSCLR\"></a><br /><br />\r\n<b> Microsoft® System CLR Types for Microsoft® SQL Server® 2012</b>\r\n<ul>\r\nThe SQL Server System CLR Types package contains the components implementing the geometry, geography, and hierarchy id types in SQL Server 2012.  This component can be installed separately from the server to allow client applications to use these types outside of the server.<br /><br />\r\n<b>Note:</b> This component also requires <b><a href=\"http://go.microsoft.com/fwlink/?LinkId=123373\">Windows Installer 4.5</a></b><br />\r\n\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239643&clcid=0x409\">X86 Package</a></b>(SQLSysClrTypes.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239644&clcid=0x409\">X64 Package</a></b> (SQLSysClrTypes.msi)<br />\r\n<br />\r\n<b><a href=\"http://go.microsoft.com/fwlink/?LinkID=241452\"> SQL Server System CLR Types Books on-line page </a></b><br />\r\n</ul>\r\n</ul>\r\n<br />\r\n\r\n<a name=\"RBS\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Remote Blob Store </b>\r\n<ul>\r\nThe SQL Server Remote Blob Store is a method for storing blobs of unstructured data in an external Content Addressable data store. The component consists of a client-side DLL that is linked into a user application, as well as a set of stored procedures to be installed on SQL Server.  Run the self-extracting download package to create an installation folder.  <br />\r\n  <ul>\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239645&clcid=0x409\">X86 Package</a></b> (RBS.msi)<br />\r\n      <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239646&clcid=0x409\">X64 Package</a></b> (RBS.msi)<br />\r\n     <br />\r\n<b><a href=\"http://go.microsoft.com/fwlink/?LinkID=169323\"> SQL RBS codeplex samples page </a></b><br />\r\n<br />\r\n<br />\r\n<b><a href=\"http://go.microsoft.com/fwlink/?LinkID=169324\"> SQL Server Remote Blob Store blogs </a></b><br />\r\n    </ul>\r\n</ul>\r\n<br />\r\n\r\n\r\n\r\n<a name=\"SSBEA\"></a><br /><br />\r\n<b> Microsoft® SQL Server® Service Broker External Activator for Microsoft® SQL Server® 2012\r\n</b> \r\n<ul>\r\nThe Microsoft SQL Server Service Broker External Activator is an extension of the internal activation feature in SQL Server 2012 that lets you move the logic for receiving and processing Service Broker messages from the Database Engine service to an application executable that runs outside SQL Server. By doing this, cpu-intensive or long-duration tasks can be offloaded out of SQL Server to an application executable, possibly in another computer. The application executable can also run under a different Windows account from the Database Engine process. This gives administrators additional control over the resources that the application can access. Run the self-extracting download package to create an installation folder. Read Books Online for more information. The single setup program will install the service on x86, and x64 computers. Read the documentation for more information.<br/>\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239652&clcid=0x409\">X86 Package</a></b>(SSBEAS.msi)<br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239653&clcid=0x409\">X64 Package</a></b> (SSBEAS.msi)<br />\r\n</ul>\r\n</ul>\r\n\r\n<br />\r\n<a name=\"Perf\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239688\">Microsoft® SQL Server® 2012 Performance Dashboard Reports</a></b>\r\n \r\n<ul>\r\nThe SQL Server 2012 Performance Dashboard Reports are Reporting Services report files designed to be used with the Custom Reports feature of SQL Server Management Studio. The reports allow a database administrator to quickly identify whether there is a current bottleneck on their system, and if a bottleneck is present, capture additional diagnostic data that may be necessary to resolve the problem.\r\n</ul>\r\n\r\n<br />\r\n</ul>\r\n<br/>\r\n<b><u>MICROSOFT SQL SERVER COMPACT FEATURE PACK COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"SQL Server Compact 4.0\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221252\">Microsoft® SQL Server® Compact 4.0 </a></b>\r\n \r\n  <ul>\r\nMicrosoft SQL Server Compact 4.0 is a free, embedded database that software developers can use for building ASP.NET websites and Windows desktop applications. SQL Server Compact 4.0 has a small footprint and supports private deployment of its binaries within the application folder, easy application development in Visual Studio 2010 SP1 and WebMatrix, and seamless migration of schema and data to SQL Server.\r\n<br />\r\n \r\n </ul>\r\n<br />\r\n<a name=\"SQL Server Compact 4.0 Books On-line\"></a><br /><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221252\">Microsoft® SQL Server® Compact 4.0 Books On-line</a></b>\r\n \r\n  <ul>\r\n Microsoft SQL Server Compact 4.0 is a free, embedded database that software developers can use for building ASP.NET websites and Windows desktop applications. Download the documentation to learn about SQL Server Compact 4.0 and to build applications for it.\r\n<br/>\r\n \r\n </ul>\r\n<br />\r\n</ul>\r\n<br/>\r\n<b><u>OTHER MICROSOFT SQL SERVER 2012 COMPONENTS</u></b>\r\n<ul>\r\n<a name=\"SSMA\"></a><br /><br />\r\n<b>Microsoft® SQL Server® Migration Assistant</b>\r\n<ul>\r\nSQL Server Migration Assistant (SSMA) is a family of products to reduce the cost and risk of migration from Oracle, Sybase, MySQL and Microsoft Access databases to SQL server or SQL Azure. SSMA automates all aspects of migration including migration assessment analysis, schema and SQL statement conversion, data migration as well as migration testing.  <br />\r\n\r\n<ul>\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221293\">1. Microsoft SQL Server Migration Assistant for Access</a></b><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221294\">2. Microsoft SQL Server Migration Assistant for MySQL</a></b><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221295\">3. Microsoft SQL Server Migration Assistant for Oracle</a></b><br />\r\n<b><a href=\" http://go.microsoft.com/fwlink/?LinkID=221296\">4. Microsoft SQL Server Migration Assistant for Sybase</a></b><br />\r\n<br />\r\n</ul></ul>\r\n\r\n<br/>\r\n<a name=\"BOL\"></a><br /><br />\r\n <b><a href=\"http://go.microsoft.com/fwlink/?LinkID=221272\">Microsoft® SQL Server® 2012 Books On-line </a></b>\r\n<b></b>\r\n<ul>\r\nMicrosoft SQL Server 2012 Books Online is the primary documentation for SQL Server. Visit the SQL Server Books Online page on the Microsoft Download Center. <br />\r\n <ul>\r\n<br />\r\n</ul>\r\n </ul>\r\n\r\n<a name=\"UA\"></a><br /><br />\r\n<b>Microsoft® SQL Server® 2012 Upgrade Advisor </b>\r\n<ul>\r\nMicrosoft Upgrade Advisor analyzes instances of SQL Server 2005, SQL Server 2008, SQL Server 2008 R2 in preparation for upgrading to SQL Server 2012. Upgrade Advisor identifies feature and configuration changes that might affect your upgrade, and it provides links to documentation that describes each identified issue and how to resolve it.\r\n<ul>\r\n      <b><a href=\"http://go.microsoft.com/fwlink/?LinkID=239679&clcid=0x409\">X86 Package</a></b> (SQLUA.msi)<br />\r\n      <b><a href=\"http://go.microsoft.com/fwlink/?LinkID=239680&clcid=0x409\">X64 Package</a></b> (SQLUA.msi)<br />\r\n</ul>\r\nNote: The Upgrade Advisor Tool is provided ‘as is’ and is not supported by Microsoft Support Services. For additional assistance with the tool please use the <a href=\"http://go.microsoft.com/fwlink/?LinkID=277085\"> SQL Server Setup & Upgrade Forum </a>\r\n<br/>\r\n </ul>\r\n<br />\r\n<a name=\"DB2OLEDB v4.0\"></a><br /><br />\r\n<b>Microsoft® OLEDB Provider for DB2 v4.0 for Microsoft® SQL Server® 2012</b> \r\n<ul>\r\nThe Microsoft OLE DB Provider for DB2 v4.0 offers a set of technologies and tools for integrating vital data stored in IBM DB2 databases with new solutions. SQL Server developers and administrators can use the data provider with Integration Services, Analysis Services, Replication, Reporting Services, and Distributed Query Processor. Read the Installing Data Provider section of the product documentation, which is available <a href=\" http://go.microsoft.com/fwlink/?LinkID=241539&clcid=0x409\"> on-line</a> or as a <a href=\" http://go.microsoft.com/fwlink/?LinkID=241541&clcid=0x409\"> download</a>.<ul>\r\n  <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=239681&clcid=0x409\"> X86 Package</a></b> (DB2OLEDB.exe)<br />\r\n  <b><a href=\" http://go.microsoft.com/fwlink/?LinkID=241453&clcid=0x409\"> X64 Package</a></b> (DB2OLEDB.exe)<br />\r\n </ul>\r\n</ul>\r\n<br />\r\n\r\n</ul>\r\n",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "29065",
    "downloadPreload": true
}