{
    "error": "",
    "downloadTitle": "Microsoft® SQL Server® 2012 Performance Dashboard Reports ",
    "downloadDescription": "The SQL Server 2012 Performance Dashboard Reports are Reporting Services report files designed to be used with the Custom Reports feature of SQL Server Management Studio. ",
    "downloadFile": [
        {
            "isPrimary": "True",
            "name": "SQLServer2012_PerformanceDashboard.msi",
            "url": "https://download.microsoft.com/download/5/8/5/585c00fe-bf38-4da5-9273-501f9b190258/ENU/SQLServer2012_PerformanceDashboard.msi",
            "size": "2183168",
            "version": "11.0.2100.60",
            "datePublished": "7/15/2024 3:28:24 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The SQL Server 2012 Performance Dashboard Reports are Reporting Services report files designed to be used with the Custom Reports feature of SQL Server Management Studio. The reports allow a database administrator to quickly identify whether there is a current bottleneck on their system, and if a bottleneck is present, capture additional diagnostic data that may be necessary to resolve the problem. <br/>\r\n<br/>\r\nCommon performance problems that the dashboard reports may help to resolve include:\r\n<ul>\r\n<li>CPU bottlenecks (and what queries are consuming the most CPU)</li>\r\n<li>IO bottlenecks (and what queries are performing the most IO)</li>\r\n<li>Index recommendations generated by the query optimizer (missing indexes)</li>\r\n<li>Blocking</li>\r\n<li>Latch contention</li>\r\n</ul>\r\nThe information captured in the reports is retrieved from SQL Server's dynamic management views. There is no additional tracing or data capture required, which means the information is always available and this is a very inexpensive means of monitoring your server.<br/>\r\n<br/>\r\nReporting Services is not required to be installed to use the Performance Dashboard Reports.",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "11.0.2100.60",
    "detailsSection_file_name": [
        "SQLServer2012_PerformanceDashboard.msi"
    ],
    "detailsSection_file_size": [
        "2.1 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "Works with the following SQL Server versions: SQL Server 2008, SQL Server 2008 R2, SQL Server 2012, SQL Server 2014",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows Server 2008 R2",
        "Windows Server 2008 Service Pack 2",
        "Windows Vista Service Pack 2"
    ],
    "installInstructionSection": "Click the Download button on this page to start the download.<br/>\r\n<br/>\r\nDo one of the following:<br/>\r\n<ul>\r\n<li>To start the installation immediately, click Open or Run this program from its current location.</li>\r\n<li>To copy the download to your computer for installation at a later time, click Save or Save this program to disk.</li>\r\n</ul>",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "29063",
    "downloadPreload": true
}