{
    "error": "",
    "downloadTitle": "Microsoft® Office Language Interface Pack 2013 – كوردى شێوەزاری سۆرانی (عێراق)",
    "downloadDescription": "Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق) وەڕگێڕانێکی پەسەند ئامادە دەکات بۆ بەکارهێنەری زۆربەی بەرنامەکانی Microsoft Office 2013.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x64-ku-arab-iq.exe",
            "url": "https://download.microsoft.com/download/0/8/e/08eb83c8-3e91-452e-8d3a-a800329efe78/languageinterfacepack-x64-ku-arab-iq.exe",
            "size": "13568400",
            "version": "2013",
            "datePublished": "7/15/2024 3:35:45 AM"
        },
        {
            "isPrimary": "False",
            "name": "languageinterfacepack-x86-ku-arab-iq.exe",
            "url": "https://download.microsoft.com/download/0/8/e/08eb83c8-3e91-452e-8d3a-a800329efe78/languageinterfacepack-x86-ku-arab-iq.exe",
            "size": "13496256",
            "version": "2013",
            "datePublished": "7/15/2024 3:35:45 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق) وەڕگێڕانێکی پەسەند ئامادە دەکات بۆ بەکارهێنەری زۆربەی بەرنامەکانی Microsoft Office 2013.\n<br />\n<br />\n<li>Microsoft Excel® 2013</li><br />\n<li>Microsoft OneNote® 2013</li><br />\n<li>Microsoft Outlook® 2013</li><br />\n<li>Microsoft PowerPoint® 2013</li><br />\n<li>Microsoft Word® 2013</li><br />\n\n\n<br />\nبە بەکارهێنانی Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق), بەکارهێنەرەکان دەتوانن دامەزراندنی سەرەکی بەکاربهینن لە وەشانەکانی بەرنامەی Office فەرمانەکان و هەڵبژاردنەکانی ئەو بەرنامانە بەکاربهێنن لە - كوردى شێوەزاری سۆرانی (عێراق). \n<br />\n<br />\nلەکاتی دامەزراندنی Microsoft Office Language Interface Pack 2013, ئەو فایلانەی ڕێ دەدات بە بەکارهێنەر کە زمانی دەرکەوتوو بگۆڕن کۆپی کراوەتە سەر شوێنێک لەسەر هەردەکەت. \nپاش دامەزراندن, تواناکانی Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق) هەڵبژاردنە هاوشێوەکانی بەردەست دەبێت لە بەرنامەکانی Office 2013 و ڕێکبەندەکانی زمانی بەرنامەی Microsoft Office 2013. \n<br />\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "2013",
    "detailsSection_file_name": [
        "languageinterfacepack-x64-ku-arab-iq.exe",
        "languageinterfacepack-x86-ku-arab-iq.exe"
    ],
    "detailsSection_file_size": [
        "12.9 MB",
        "12.9 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ol>Microsoft Windows 7 - 32 یان 64 بت OS<br />\nMicrosoft Windows 8 - 32 یان 64 بت OS<br /> \n<b>تێبینی: </b>تکایە دڵنیابە لە دامەزراندنی نوێترین Service Packs بۆ سیستەمی کارکردنەکەت بۆ دڵنیابوون لە پەسەنکردنی زمانەکەت.<br /></ol>\n<br />\n<b>بەرنامە </b>هەر وەشانێکی Office 2013 یان ئەوەی Microsoft Excel, Microsoft OneNote, Microsoft Outlook, Microsoft PowerPoint یان Microsoft Word دەگرێتە خۆی یان پەسەندکردنی Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق). <b>تێبینی: </b>تکایە دڵنیابە لەوەی نوێترین  Microsoft Office Service Packs بۆ بەرهەمەکانی Microsoft Office. ئەمە تاقیکردنەوەیەکی بەکارهێنەری باشتر پێ دەبەخشێت.<br />\n<br />\n<b>کۆمپیتەر و پرۆسێسەر </b>پرۆسێسەری 1 گێگا هرتز لەگەڵ SSE2 یان بەرزتر; ڕامی 2 گێگا بایت یان بەرزتر<br />\n<br />\n<b>شوێنی دیسک </b>جگە لە شوێنی دیسکەکە ئەوەی بەکارهێنراوە بۆ بەرنامەکانی Office 2013،<br />\n<li>3 گێگا بایت بەردەستە لە شوێنی سەر هاردەکە</li><br />\n<li>هەموو پێداویستیەکانی تر هەمان شتە لەگەڵ ئەوانەی بەرنامەی Office 2013 کە تۆ بەکاری دەهێنیت لەگەڵ Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق).</li><br />\n<br />\n<b>Windows Language Interface Pack </b>پێشنیارکراوە بۆ دامەزراندنی Windows 7 یان Windows 8 Language Interface Packs بۆ زمانی سەرەکی کە پەسەن دەکرێت لەلایەن سیستەمی کارکردنەکەتەوە و بەرنامەکان و کاربەرنامەکان.<br />\n<br />\n<b>ئاگات لە ڕێکبەندەکانی ڕێزەلیوشنەکەت ببە DPI </b>فۆنتێکی زۆر دروست کراوە بۆ باشترین خوێندنەوە لە  1366 x 768 ڕێزەلیوشن. ئەگەر بەرەڕووی هەر کێشەیەک بوویتەوە لە خوێندنەوەی زمانەکەت لەم ڕێزلیوشنە تکایە ڕێکبەندەکانی بگۆڕە و بەرزی بکەرەوە. تکایە تێبینی بکە: پێشنیاری ئەوەت دەکەین کە بەرنامەی Office 2013 بە ڕێکبەندی گریمانەیی Windows DPI - 96 DPI. بەکارهێنانی ڕێکبەندی 120 DPI لەوانەیە بەکارهێنانی Office خراپ بکات بۆ بەکارهێنەرەکە لە هەندێک لە بەرنامەکەنای بە گەورەکردنی قەبارەی چوارگۆشەی گفتوگۆی Office.<br />\n<br />\n<b>هەڵبژاردنەکانی ناوچە و زمان </b>لەگەڵ ئەوەشدا ئێمە پێشنیاری کە هەموو <b>هەڵبژاردنەکانی ناوچە و زمان</b> لە <b>تەختەبەندی کۆنتڕۆڵ</b> سێتێکی زمانی Microsoft Office Language Interface Pack 2013 - كوردى شێوەزاری سۆرانی (عێراق).<br />\n<br />\n",
    "systemRequirementsSection_supportedOS": [
        "Windows 8"
    ],
    "installInstructionSection": "<b>بۆ دامەزراندنی ئەم داگرتنە:</b>\n<br />\n<ol>\n<li>داگرتنی <b>LanguageInterfacePack.exe</b> فایل بە کرتەکردن <b>داگرتن</b> دوگمەی (سەرەوە) و هەڵگرتنی فایلەکە لەسەر هەردەکەت.</li>\n<li>دوو-کرتە لە <b>LanguageInterfacePack.exe</b> فایلی بەرنامە لەسەر هەردەکەت بۆ دەستکردن بە دامەزراندنی پەرنامەکە.</li>\n<li>بەپێێ ڕێنماییەکان بڕۆ لەسەر شاشەکە بۆ تەواوکردنی دامەزراندنەکە.</li>\n<li>کاتێک فایلی بمخوێنەوەت دامەزراند بۆ Microsoft Office 2013 Language Interface Pack دەتوانیت بیدۆزیتەوە لە C:\\Program Files\\Common Files\\microsoft shared\\OFFICE15\\1170\\LIPread.htm.</li>\n<li>بەرزکردنەوەی Office 2010 لەگەڵ Office 2010 Language Interface Pack یان وەشانێکی پێشووتری Office 2013 لەگەڵ Office 2013 Language Interface Pack کە <b>پەسەند نەکراوە</b>. ئەگەر دەتەوێت دامەزراندنی بنەڕەتی Office 2010 بەرزبکەیتەوە بۆ Office 2013 لەگەڵ Office 2013 Language Interface Pack پێویستە تۆ:</li>\n<ul>\n<li>سڕینەوەی Office 2010 Language Interface Pack.</li>\n<li>دەستپێکردنی دامەزراندنی Office 2013 و هەڵبژاردنی هەڵبژاردنەکانی بەرزکردنەوە.</li>\n<li>کاتی تەواوبوونی دامەزراندنی Office 2013، Office 2013 Language Interface Pack دامەزرێنە و ڕێکی بخە.</li>\n<br />\n<br />\n</ul>\n<br />\n</ol>\n<b>بەرهەمەکەی Office چالاک بکەرەوە:</b>\n<br />\nئەگەر کێشەیەکت هەیە لە خوێندنەوەی هەموو کۆدەکەی دامەزراندن لە جوارگۆشەی \"Microsoft Office Activation Wizard\"، یان کۆدەکە بە جوانی دەرناکەوێت بە بەکارهێنانی Microsoft Office Language Interface Pack 2013, تکایە پاشگەز ببەوە لە گەزەکەکە و زمانی سەرەکی بەرهەمەکت بگۆڕە بۆ چالاک کردنی بەرهەمی Microsoft Office.<br />\n<br />\n<b>ڕێنمایی بۆ بەکارهێنانی:</b><br />\nبۆ گۆڕینی زمانی دەرکەوتووی بەکارهێنەرەکە بۆ Microsoft Office Language Interface Pack 2013 – كوردى شێوەزاری سۆرانی (عێراق), بەم هەنگاوانەیە بڕۆ:<br />\n<br />\n<ol>\n<li>دەستپێکردن <b> زمانە پەسەندکراوەکانی Microsoft Office 2013</b> لە <b>Start\\All Programs\\Microsoft Office\\Microsoft Office Tools</b> پێڕست.</li>\n<li>لەژێر <b>نیشاندان هەڵبژێرە و زمانەکانی یارمەتی</b>, لەژێر <b>زمانی نیشاندان</b> زمانە داواکراوەکە هەڵبژێرە و کرتە بکە لەسەر <b>دیاری کردن وەک گریمانەیی</b> دوگمە.</li>\n<li>لەژێر <b>بژارکردنی زمانەکان هەڵبژێرە</b>, زمانە پێویستەکە هەڵبژێرە و کرتەی لەسەر بکە <b>دیاری کردن وەک گریمانەیی</b> دوگمە.</li>\n<li>کرتەبکە لەسەر <b>پەسەند</b> دوگمە.</li>\n<br /></ol>\n<br />\nڕێکبەندکانی زمان ئەوەی تۆ هەڵبژاردووە کاریگەر دەبێت جاری داهاتوو کە تۆ بەرنامەی Office دووبارە داگیرسێنیتەوە.<br />\n<b>تێبینی:</b> یارمەتیەکان ناتوانێت زمان بگۆڕێت لە Microsoft Office Language Interface Pack 2013 – كوردى شێوەزاری سۆرانی (عێراق). یارمەتی هەمیشە بەو زمانە دەبێت کە یەکەم جار دامەزرێندراوە.<br />هەمیشە نیشاندانی یارمەتی لە لیستە شۆڕبووەکان دابنێ بۆ زمانە سەرەکیەکە.<br />\n<br />\n<b>بۆ لابردنی ئەم داگرتنە:</b><br />\n<li>دەرچۆ لە هەموو بەرنامەکانی Microsoft Office.</li>\n<li>دوو-کرتە لە <b>بەرنامەکان و تایبەتمەندیەکان</b> ئەیقۆن لە Windows <b>تەختەبەندی کۆنتڕۆڵ</b>.</li>\n<li>لە <b>سڕینەوە یان گۆڕینی بەرنامە</b> هەڵبژاردنەکان، کرتە <b>Microsoft Office Language Interface Pack 2013 – كوردى شێوەزاری سۆرانی (عێراق)</b> لە <b>بەرنامەکانی لەم کاتە دامەزرێندراون</b> چوارگۆشە، پاشان هەڵبژاردن <b>سڕینەوە</b> هەڵبژاردنەکان.</li>\n<li>بە پێێ ڕێنماییەکان سەر شاشە بڕۆ.</li>\n<br />\n",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "40741",
    "downloadPreload": true
}