{
    "error": "",
    "downloadTitle": "Data Protection Principles for the 21st Century",
    "downloadDescription": "This paper proposes revisions to the OECD Guidelines that include basic changes essential for the protection of individual privacy in the 21st century, while avoiding unnecessary restrictions on uses of personal information that are increasingly important.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Data-Protection-Principles-for-the-21st-Century.pdf",
            "url": "https://download.microsoft.com/download/d/f/6/df6849d9-00d6-4e60-889f-bb74d4ca3cc8/Data-Protection-Principles-for-the-21st-Century.pdf",
            "size": "534549",
            "version": "1.0",
            "datePublished": "7/15/2024 3:19:19 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        }
    ],
    "detailsSection": "The world of Big Data poses serious information privacy risks that are exacerbated by the “notice and consent” requirements in the 1980 OECD Guidelines and reflected in most modern data protection laws. In most cases, the collection of personal data not only requires the consent of the data subject but is also limited to the minimum amount of data necessary to achieve the purpose identified in the notice used to solicit consent, and that data may not be used for other, unrelated purposes without new consent. \r\n\r\nWhile this approach may have been feasible in 1980, it does little to protect individuals today or support the valuable new uses of personal data. This paper proposes revisions to the OECD Guidelines that include basic changes essential for the protection of individual privacy in the 21st century, while avoiding unnecessary restrictions on uses of personal information that are increasingly important to individuals, societies, and economies. \r\n",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "1.0",
    "detailsSection_file_name": [
        "Data-Protection-Principles-for-the-21st-Century.pdf"
    ],
    "detailsSection_file_size": [
        "522.0 KB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": " Adobe Reader",
    "systemRequirementsSection_supportedOS": [
        "Windows 7",
        "Windows 8",
        "Windows Vista",
        "Windows XP"
    ],
    "installInstructionSection": "Either \"Open\" or \"Save\" this document to your device for viewing.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "41191",
    "downloadPreload": true
}