{
    "error": "",
    "downloadTitle": "Microsoft Office for Mac 2011 14.7.6 Update",
    "downloadDescription": "This update fixes critical issues and also helps to improve security. It includes fixes for vulnerabilities that an attacker can use to overwrite the contents of your computer's memory with malicious code.",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Office2011-1476Update_EN-US.dmg",
            "url": "https://download.microsoft.com/download/9/e/f/9ef52c48-b742-4fdf-a71b-3e67b4c60832/Office2011-1476Update_EN-US.dmg",
            "size": "119137490",
            "version": "14.7.6",
            "datePublished": "7/15/2024 4:39:44 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "es-es",
            "name": "Spanish"
        },
        {
            "cultureCode": "en-us",
            "name": "English"
        },
        {
            "cultureCode": "da-dk",
            "name": "Danish"
        },
        {
            "cultureCode": "zh-tw",
            "name": "Chinese (Traditional)"
        },
        {
            "cultureCode": "nl-nl",
            "name": "Dutch"
        },
        {
            "cultureCode": "fr-fr",
            "name": "French"
        },
        {
            "cultureCode": "nb-no",
            "name": "Norwegian (Bokmål)"
        },
        {
            "cultureCode": "sv-se",
            "name": "Swedish"
        },
        {
            "cultureCode": "ja-jp",
            "name": "Japanese"
        },
        {
            "cultureCode": "de-de",
            "name": "German"
        },
        {
            "cultureCode": "ru-ru",
            "name": "Russian"
        },
        {
            "cultureCode": "fi-fi",
            "name": "Finnish"
        },
        {
            "cultureCode": "it-it",
            "name": "Italian"
        },
        {
            "cultureCode": "pl-pl",
            "name": "Polish"
        },
        {
            "cultureCode": "zh-cn",
            "name": "Chinese (Simplified)"
        }
    ],
    "detailsSection": "This update fixes critical issues and also helps to improve security. It includes fixes for vulnerabilities that an attacker can use to overwrite the contents of your computer's memory with malicious code. For more information about this update, please visit the <a href=\"http://go.microsoft.com/fwlink/?LinkID=851479\" target=\"_blank\"> Microsoft Web site</a>.<br /><br />\n\n<b>Applies to:</b> Office 2011, Office 2011 Home and Business Edition, Word 2011, Excel 2011, PowerPoint 2011, Outlook 2011, Office for Mac Standard 2011 Edition, Microsoft Office for Mac Home & Student 2011, and Microsoft Office for Mac Academic 2011\n<br /><br /><a href=\"http://go.microsoft.com/fwlink/?LinkId=255462\" target=\"_blank\">Known issues for installation of Office 2011</a>",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/KB3212224",
        "name": "KB3212224"
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/MS17-000",
        "name": "MS17-000"
    },
    "detailsSection_file_version": "14.7.6",
    "detailsSection_file_name": [
        "Office2011-1476Update_EN-US.dmg"
    ],
    "detailsSection_file_size": [
        "113.6 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<ul>\n<li><b>Operating System Versions:</b> Mac OS X version 10.5.8 or a later version of Mac OS<br /><br />\n<b>Note</b>&nbsp; To verify that your computer meets these minimum requirements, on the <b>Apple</b> menu, click <b>About This Mac</b>.</li>\n<li><b>Microsoft Office for Mac 2011 Service Pack 1 (14.1.0):</b> You can download this update for free from the <a href=\"http://go.microsoft.com/fwlink/?LinkId=218211\" target=\"_blank\">Microsoft Web Site</a>.<br /><br />\n<b>Note</b> To verify that you have installed this update, you can open any Microsoft Office 2011 application to check the version number. For example, open Word, and then on the <b>Word</b> menu, click <b>About Word</b>. In the dialog box, compare the version number next to <b>Latest Installed Update</b>.</li>\n</ul>",
    "systemRequirementsSection_supportedOS": [
        "Apple Mac OS X",
        "Macintosh"
    ],
    "installInstructionSection": "<b>To install this update</b>\n<ol>\n<li>Print this page if you want to use it as a reference when you are offline.</li>\n<li>Quit any applications that are running, including all Office applications, Microsoft Messenger, and Office Notifications, because they might interfere with the installation.</li>\n<li>Make sure that your computer meets the minimum system requirements.</li>\n<li>Click <b>Download</b>, or click the link for the language version that you want.</li>\n<li>Follow the instructions on the screen to save the file to your hard disk. If you are using Safari, the downloaded file is saved to the desktop or your Downloads folder unless you specified a different location in the <b>Preferences</b> dialog box of Safari. To check your preferences, on the <b>Safari</b> menu, click <b>Preferences</b>, and then click <b>General</b>.</li>\n<li>Double-click the file that you downloaded in step 5 to place the Microsoft Office 2011 14.7.6 Update volume on your desktop, and then double-click the <b>Microsoft Office 2011 14.7.6 Update</b> volume to open it. This step might have been performed for you.</li>\n<li>In the Microsoft Office 2011 14.7.6 Update volume window, double-click the <b>Office 2011 14.7.6 Update</b> application to start the update process, and then follow the instructions on the screen.</li>\n<li>If the installation finishes successfully, you can remove the update installer from your hard disk. To remove the update installer, first drag the <b>Microsoft Office 2011 14.7.6 Update</b> volume to the Trash, and then drag the file that you downloaded to the Trash.</li>\n</ol>\n\n<b>Note</b>&nbsp; This update is also available from Microsoft AutoUpdate, an application that can automatically keep your Microsoft software up to date. To use AutoUpdate, open an Office application, and then on the <b>Help</b> menu, click <b>Check for Updates</b>.<br /><br />\n\n<b>To remove this update</b><br /><br />\n\nThis update does not include an uninstall feature. To restore your application to its original state, delete it from your hard disk, reinstall it from your original installation disk, and then install the updates that you want.",
    "additionalInformationSection": "If you have trouble installing this update or using Office 2011 applications after you install this update, try the following:\n\n<ul>\n<li>Make sure that the Microsoft Office 2011 folder is located in the Applications folder on the startup volume. If it is at another location on your computer, move it to the Applications folder on your startup volume, and then try installing the update again.</li>\n<li>Restart your computer and try installing the update again. </li>\n<li>Make sure that the user account you use to authenticate the update installer is an administrator account. For more information about administrator accounts, see Mac Help. </li>\n<li>Make sure that you downloaded the correct language version of the update for your copy of Office.</li>\n<li>If you rename or modify any of the files in the Microsoft Office 2011 folder, you cannot install product updates. To correct this issue, drag the Microsoft Office 2011 folder to the Trash, and then reinstall Office 2011 from your original installation disk.</li>\n<li>If you experience problems opening Office applications after you install this update, restart your computer. If you continue to experience problems after you restart, reinstall Office from your original installation disk, and then install this update again.</li>\n</ul>\n\nFor additional assistance, visit the <a href=\"http://go.microsoft.com/fwlink/?LinkId=216459\" target=\"_blank\">Microsoft Web site</a>.",
    "relatedResourcesSection": [],
    "locale": "en-us",
    "detailsId": "55616",
    "downloadPreload": true
}