{
    "error": "",
    "downloadTitle": "HPC Pack 2016 Update 1 fixes",
    "downloadDescription": "This Update Fixes some issues of HPC Pack 2016 Update 1",
    "downloadFile": [
        {
            "isPrimary": "False",
            "name": "Upgrade-HpcApplication.ps1",
            "url": "https://download.microsoft.com/download/b/e/f/befc6910-0c91-43bb-b585-a5096f371f8c/Upgrade-HpcApplication.ps1",
            "size": "16289",
            "version": "5.01.6112.0",
            "datePublished": "7/15/2024 4:57:57 AM"
        },
        {
            "isPrimary": "False",
            "name": "hpcnodeagent.tar.gz",
            "url": "https://download.microsoft.com/download/b/e/f/befc6910-0c91-43bb-b585-a5096f371f8c/hpcnodeagent.tar.gz",
            "size": "4880823",
            "version": "5.01.6112.0",
            "datePublished": "7/15/2024 4:57:57 AM"
        },
        {
            "isPrimary": "False",
            "name": "KB4135110_x86.exe",
            "url": "https://download.microsoft.com/download/b/e/f/befc6910-0c91-43bb-b585-a5096f371f8c/KB4135110_x86.exe",
            "size": "8557952",
            "version": "5.01.6112.0",
            "datePublished": "7/15/2024 4:57:57 AM"
        },
        {
            "isPrimary": "False",
            "name": "HpcApplicationType.sfpkg",
            "url": "https://download.microsoft.com/download/b/e/f/befc6910-0c91-43bb-b585-a5096f371f8c/HpcApplicationType.sfpkg",
            "size": "76032825",
            "version": "5.01.6112.0",
            "datePublished": "7/15/2024 4:57:57 AM"
        },
        {
            "isPrimary": "False",
            "name": "KB4135110_x64.exe",
            "url": "https://download.microsoft.com/download/b/e/f/befc6910-0c91-43bb-b585-a5096f371f8c/KB4135110_x64.exe",
            "size": "13922736",
            "version": "5.01.6112.0",
            "datePublished": "7/15/2024 4:57:57 AM"
        }
    ],
    "localeDropdown": [
        {
            "cultureCode": "en-us",
            "name": "English"
        },
        {
            "cultureCode": "zh-cn",
            "name": "Chinese (Simplified)"
        },
        {
            "cultureCode": "ja-jp",
            "name": "Japanese"
        }
    ],
    "detailsSection": "This update fixes some known issues of HPC Pack 2016 update 1 as described below<br/>\r\n<br/>\r\n<b>Scheduler Fixes</b><br/>\r\n- Fix “task min unit” not specified error when submitting job after switching job's unit type; <br/>\r\n- Add a new value “<b>KEEP</b>” for job environment variable <b>HPC_CREATECONSOLE</b>, when this value specified, we will create a new logon console session if not exists or attach to the existing one and keep the console session after the job completes on the compute nodes;<br/>\r\n- Fix a regression for cross-domain user when running job on windows compute nodes;<br/>\r\n- Fix an issue that if scheduler object is GCed, its connection will not be closed;<br/>\r\n- Fix task failure issue when cgroup is not installed on linux nodes;<br/>\r\n- We now generate hostfile or machinefile for Intel MPI, Open MPI, MPICH or other MPI applications on linux nodes. A host file or machine file containing nodes or cores allocation information for MPI applications will be generated when rank 0 task is starting. User could use job or task environment variable $CCP_MPI_HOSTFILE in task command to get the file name, and $CCP_MPI_HOSTFILE_FORMAT to specify the format of host file or machine file. Currently, we have 4 format as below (Suppose we allocate N nodes and each node with 4 cores):<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp 1. The default host file format:<br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename1<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename2<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp …<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodenameN<br/></I>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp 2. When $CCP_MPI_HOSTFILE_FORMAT=1, the format is:<br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename1:4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename2:4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp …<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodenameN:4<br/></I>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp 3. When $CCP_MPI_HOSTFILE_FORMAT=2, the format is like:<br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename1 slots=4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename2 slots=4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp …<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodenameN slots=4<br/></I>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp 4. When $CCP_MPI_HOSTFILE_FORMAT=3, the format is like:<br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename1 4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodename2 4<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp …<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp nodenameN 4<br/></I>\r\nHere is an example how you can use this in your MPI PINGPONG run:<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <I>source /opt/intel/impi/`ls /opt/intel/impi`/bin64/mpivars.sh && mpirun -f $CCP_MPI_HOSTFILE IMB-MPI1 pingpong</I><br/>\r\n- Mutual trust for multi-node task (usually MPI task) on Linux nodes will be automatically set for all users including cluster admin. It is not required to set extendedData with the tool “HPCCred.exe”;<br/>\r\n- By default, scheduler will use job’s runas user credential to do an “Interactive” logon on the compute node. And sometime the “Interactive” logon permission may be banned by your domain policy. We now introduced a new job environment variable \"<b>HPC_JOBLOGONTYPE</b>\" so that user could specify different logon type to mitigate the issue. The value of job environment variable could be set to 2,3,4,5,7,8,9 as below, more refer to \"https://msdn.microsoft.com/en-us/library/windows/desktop/aa378184(v=vs.85).aspx\"<br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsppublic enum LogonType<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp{<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    Interactive = 2,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    Network = 3,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    Batch = 4,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    Service = 5,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    Unlock = 7,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    NetworkClearText = 8,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp    NewCredentials = 9,<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp}<br/></I>\r\n- Fix an issue that job would be stuck in queued state and block other jobs when it meets all the conditions: unit type is Node, run on a single node, node group assigned;<br/>\r\n- Fix regression on Activation/Submission Filter;<br/>\r\n- Enable HTML formated email notification;<br/>\r\n- Fix the issue that HPC Pack 2012 R2 Update 3 scheduler API may not able to get node and group information from HPC Pack 2016 Update 1 Cluster (by adding back .net remoting for scheduler node service on port 6729);<br/>\r\n- <b>User mapping changes</b> With this change, cluster admin will not be mapped to Linux “root” user by default any more. It will be mapped to an local Linux user with the same name(with or without domain prefix) in Linux compute node instead, which is a member of group “sudo” if the user is created by HPC Pack Linux nodemanager. Only Windows local system account “NT AUTHORITY\\SYSTEM” will be mapped to Linux root user. When you use Clusrun, you can specify this local system account on the cluster manager Clusrun GUI or through Clusrun command “Clusrun /user:system &ltyour command&gt”. Setting environment variable “<b>CCP_MAP_ADMIN_USER</b>” to “0” to map cluster admin to Linux root user as previous default behavior, but under this case mutual trust for root user between Linux compute nodes will not be set automatically;<br/>\r\n- A checkbox named ‘Run as local system account \"NT AUTHORITY\\SYSTEM\"’ is added to Clusrun dialog in HPC Cluster Manager. HPC administrators can run clusrun command in Linux compute nodes as root user by checking it;<br/>\r\n- <b>Hpccred.exe</b> improvement. Command “hpccred listcreds” can be used to display the credentials owned by current user. HPC administrator can use “hpccred listcreds [/owner:username]” and “hpccred setcreds [/owner:username]” to display or to set credentials owned by other users. Extended data of each cluster user will be filled with RSA key for SSH automatically if user do not set it manually;<br/>\r\n- Fix issue that our service won’t authenticate client machine in 3-headnode cluster mode with certification;<br/>\r\n- Fix NullReferenceException if HPC registry key is absent on the client machine;<br/>\r\n<br/>\r\n<b>SOA Fixes</b><br/>\r\n- Fix issue that exception in finding SOA service registration file shall not affect continuing finding in other paths;<br/>\r\n- Fix an issue that SOA service registration folder cannot be on a network share other than the head node. When the share is on another machine, just make sure the share allow read access for &ltDomain&gt\\&ltHeadNode&gt$ machine account;<br/>\r\n- Fix issue that SOA service host may not able to access SOA service registration share in 3-headnode cluster mode;<br/>\r\n- Fix an issue that causes SOA job failing if system.ServiceModel/bindings configuration settings is missing in the corresponding service configuration file;<br/>\r\n- Removed authentication requirement for non-admin user get Service registration file via https endpoint;<br/>\r\n- Fix issue that Non-domain joined SOA client cannot connect to Session Service using Net.Tcp binding;<br/>\r\n- Fix Azure storage connection string loading issue in SOA data service;<br/>\r\n- Fix two issues in v2 proxy client/operation contract mode: one is client/session does not idle time out; another is the total request counter is incorrectly deducte;<br/>\r\n<br/>\r\n<b>Management Fixes</b><br/>\r\n- Fix issue that reporting service may not work in single headnode cluster;<br/>\r\n- DB connection string plugin improvement: In addition to scheduler service, DB connection string in monitoring service, reporting service, diagnostics service and SDM service will also be refreshed when connection fails so that user can use customized assembly as plugin to refresh DB connection strings in these services.<br/>\r\n- Fix deployment failure when auto scale is enabled for batch pool;<br/>\r\n- Fix an issue that auto grow shrink service does not grow for jobs without auto calculated grow by min or max and a specified min for one core. In another word, the issue happens if GrowByMin is set to false (default) and the job is specified with 1-[N] or *-[N] cores, or GrowByMin is set to true and the job with 1-[N] or 1-* cores. * means auto calc;<br/>\r\n- Fix node selection performance issue in HPC Cluster Manager;<br/>\r\n- Fix auto grow issue in a group of nodes with mixed number of cores while the resource type of jobs is node or socket;<br/>\r\n- Fix case sensitive issue in node group name for auto grow shrink service;<br/>\r\n- Fix the issue that busy online nodes will be selected for grow if the queued job has <b>RequestedNodes</b> specified without <b>NodeGroups</b>;<br/>\r\n- Add the missing script files Import-HPCConfiguration.ps1/Export-HPCConfiguration.ps1 and fix the issue that Set-HpcClusterName.ps1/Move-HpcNode.ps1 may not work;<br/>\r\n- Fix issue that compute nodes may enter into WinPE many times during bare metal deployment;<br/>\r\n- Make availability set optional for Azure IaaS node deployment;<br/>\r\n- Fix <b>NullRefereceException</b> in bare metal deployment if deployment certificate not specified;<br/>\r\n- Fix issue that Azure IaaS node failed to deploy when Headnode name has less than 4 characters;<br/>\r\n- Fix Linux nodes unavailable issue when there is NIC on headnode associated with \"169.254.*\" IP;<br/>\r\n- Fix the issue that management service fails to start when there is invalid IP address in hosts file;<br/>\r\n- Fix \"Specified cast is not valid\" issue when run Get-HPCMetricValueHistory cmdlet in powershell;<br/>\r\n- Fix job property deserialize  issue in REST API; <br/>",
    "detailsSection_kbArticles": {
        "link": "http://support.microsoft.com/kb/",
        "name": ""
    },
    "detailsSection_securityBulletins": {
        "link": "http://technet.microsoft.com/en-us/security/Bulletin/",
        "name": ""
    },
    "detailsSection_file_version": "5.01.6112.0",
    "detailsSection_file_name": [
        "Upgrade-HpcApplication.ps1",
        "hpcnodeagent.tar.gz",
        "KB4135110_x86.exe",
        "HpcApplicationType.sfpkg",
        "KB4135110_x64.exe"
    ],
    "detailsSection_file_size": [
        "15.9 KB",
        "4.7 MB",
        "8.2 MB",
        "72.5 MB",
        "13.3 MB"
    ],
    "detailsSection_file_date": "7/15/2024",
    "systemRequirementsSection": "<b>HPC Pack 2016 Update 1 (build 5.1.6086.0) installed</b>",
    "systemRequirementsSection_supportedOS": [
        "Windows 10",
        "Windows 7",
        "Windows 8",
        "Windows 8.1",
        "Windows Server 2012",
        "Windows Server 2012 R2",
        "Windows Server 2016"
    ],
    "installInstructionSection": "<b>Installation Instructions</b><br/>\r\nThis update needs to be run on all head nodes, broker nodes, workstation nodes, compute nodes (Windows and Linux), Azure IaaS nodes and clients<br/>\r\n<br/>\r\nBefore applying the update, please check if HPC Pack 2016 Update 1 is installed. The version number (in HPC Cluster Manager, click Help-&gtAbout) should be 5.1.6086.0. Please take all nodes offline and ensure all active jobs finished or canceled. If there are Azure PaaS Nodes, please make sure they are stopped before applying this patch. After all active operations on the cluster have stopped, please back up the head node (or head nodes) and all HPC databases by using a backup method of your choice.<br/>\r\n<br/>\r\nTo start the download, click the Download button next to the appropriate file (KB4135110_x64.exe for the 64-bit version, KB4135110-x86.exe for the 32_bit version) and then:<br/>\r\n<br/>\r\n<b>Applying the update on Single Headnode</b><br/>\r\n1. Click Save to copy the download to your computer;<br/>\r\n2. Close any open HPC Cluster Manager or HPC Job Manager windows;<br/>\r\n&nbsp&nbspNote: Any open instances of HPC Cluster Manager or HPC Job Manager may unexpectedly quit or show an error message during the update process if left open. This does not affect installation of the update;<br/>\r\n3. Run the download on the head node using an administrator account, and reboot the head node;<br/>\r\n4. The version number (Start HPC Cluster Manager, click Help-&gtAbout) now should be 5.1.6114.0;<br/>\r\n5. If you want to revert the patching, please go to Control Panel --&gtPrograms and Features --&gtView installed updates, un-install below updates in order (Please don’t reboot in the middle): KB4135110 under “Microsoft ® HPC Pack 2016 Web Components”, “Microsoft ® HPC Pack 2016 Client Components” and then “Microsoft ® HPC Pack 2016 Server Components, then reboot;<br/>\r\n<br/>\r\n<b>Applying the update on Three Headnodes</b><br/>\r\nNote: If you have at least three head nodes, you need to download HpcApplicationType.sfpkg and Upgrade-HpcApplication.ps1 as well and put them together on one of the headnode. And run through below steps:<br/>\r\n1. To upgrade service fabric application, please open an elevated powershell command prompt window, run: <br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   <I>Upgrade-HpcApplication.ps1</I><br/>\r\n2. After the service fabric application upgrade done, you then need to run the KB4135110_x64.exe on headnode one by one;<br/>\r\n3. Reboot the headnode one by one (Please check https://localhost:10400 to make sure the original reboot headnode back to health state before you reboot a new headnode, so that your service will keep available);<br/>\r\n4. The version number (Start HPC Cluster Manager, click Help-&gtAbout) now should be 5.1.6114.0 on all headnodes;<br/>\r\n5. If you want to revert the patching, for every headnode please go to Control Panel --&gt Programs and Features --&gt View installed updates, un-install below updates in order (Please don’t reboot in the middle): KB4135110 under “Microsoft ® HPC Pack 2016 Web Components”, “Microsoft ® HPC Pack 2016 Client Components” and then “Microsoft ® HPC Pack 2016 Server Components; then downgrade service fabric application through below command; <br/>\r\n<I>&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  Connect-ServiceFabricCluster<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   $hpcApplication = Get-ServiceFabricApplication -ApplicationName fabric:/HpcApplication<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   $appParameters = @{}<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   foreach($appParam in $hpcApplication.ApplicationParameters)<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   {<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp       $appParameters[$appParam.Name] = $appParam.Value<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   }<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   <br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp   Start-ServiceFabricApplicationUpgrade -ApplicationName fabric:/HpcApplication -ApplicationTypeVersion 1.0.1 -ApplicationParameter $appParameters -HealthCheckStableDurationSec 60 -UpgradeDomainTimeoutSec 1800 -UpgradeTimeout 3000 -FailureAction Rollback -Monitored | Out-Null<br/></I>\r\nYou can run \"<I>Get-ServiceFabricApplicationUpgrade -ApplicationName fabric:/HpcApplication</I>\" to track the upgrade status. If you find it is stuck at \"PreUpgradeSafetyCheck\" due to some service fail to cancel, you could try to manually kill the corresponding process on the right node. When if finished, reboot headnode one by one (you need wait the original rebooted node fully healthy in the service fabric cluster before you reboot the next one.<br/>\r\n<br/>\r\n<b>Applying the update on Windows nodes</b><br/>\r\n1. Log on interactively, or use clusrun to deploy the fix to the compute nodes, broker nodes, unmanaged server nodes, Azure IaaS nodes and workstation nodes;<br/>\r\n If you want to use clusrun to patch the QFE on the compute nodes, broker nodes, unmanaged server nodes, Azure IaaS nodes and workstation nodes:<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  a. Copy the appropriate version of the update to a shared folder such as \\\\headnodename\\HPCUpdates<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  b. Open an elevated command prompt window and type the appropriate clusrun command for the operating system of the patch, e.g.:<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <I>clusrun /nodegroup:ComputeNodes \\\\&ltheadnodname&gt\\HPCUpdates\\ KB4135110-x64.exe -unattend -SystemReboot</I><br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp <I>clusrun /nodegroup:BrokerNodes \\\\&ltheadnodname&gt\\HPCUpdates\\ KB4135110-x64.exe -unattend -SystemReboot</I><br/>\r\nNote: HPC Pack updates, other than Service Packs, do not get automatically applied when you add a new node to the cluster or re-image an existing node. You must either manually/clusrun apply the update after adding or reimaging a node or modify your node template to include a line to install the appropriate updates from a file share on your head node.<br/>\r\nNote: If the cluster administrator doesn’t have administrative privileges on workstation nodes and unmanaged server node, the clusrun utility may not be able to apply the update. In these cases the update should be performed by the administrator of the workstation and unmanaged servers.<br/>\r\n2. If you want to revert the patching, please go to Control Panel --&gt Programs and Features --&gt View installed updates, un-install below updates in order (Please don’t reboot in the middle): KB4135110 under “Microsoft ® HPC Pack 2016 Web Components”, “Microsoft ® HPC Pack 2016 Client Components” and then “Microsoft ® HPC Pack 2016 Server Components, then reboot;<br/>\r\n<br/>\r\n<b>Applying the update on Linux nodes</b><br/>\r\n1. For 3-headnode Cluster, download and Copy “hpcnodeagent.tar.gz” to the remote install share of the HPC Cluster (Default should be \\\\&ltHN&gt\\REMINST\\LinuxNodeAgent ); while for single headnode cluster, this package will be replaced during headnode patching. Thus please back up the existing one so that you could downgrade to original version<br/>\r\n2. Mount the share on linux node (Suppose you already created /mnt/share on all linux node): <br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  <I> Clusrun /env:CCP_MAP_ADMIN_USER=0 /user:system /NodeGroup:LinuxNodes mkdir /mnt/share ^& mount -t cifs //&ltyourheadnode&gt/REMINST/LinuxNodeAgent /mnt/share -o vers=2.1, domain=&ltdomainname>,username=&ltusername&gt,password='&ltpassword&gt',dir_mode=0777,file_mode=0777</I><br/>\r\n3. Clusrun with root on all linux node to update the package:<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  <I>Clusrun /env:CCP_MAP_ADMIN_USER=0 /user:system /NodeGroup:LinuxNodes /workdir:/mnt/share echo “python /mnt/share/setup.py -update” ^| at now + 1 minute</I><br/>\r\n4. Wait for clusrun completion and the real update will start in a minute on the linux node; After the update completes, you can run Clusrun command to check the linux agent version by running below command (the version now will be 2.3.4.0):<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  <I>Clusrun /env:CCP_MAP_ADMIN_USER=0 /user:system /NodeGroup:LinuxNodes /workdir:/opt/hpcnodemanager ./nodemanager -v</I><br/>\r\n5. If you want to revert back to the original linux agent version, you could restore the \"hpcnodeagent.tar.gz\" to the old version and apply the same above steps;<br/>\r\n<br/>\r\n<b>Applying the update on Client</b><br/>\r\n1. To update computers that run HPC Pack client applications apply the following actions:<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  a. Stop any HPC client applications including HPC Job Manager and HPC Cluster Manager;<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  b. Run the update executable;<br/>\r\n&nbsp&nbsp&nbsp&nbsp&nbsp&nbsp  c. Reboot your client computer;<br/>\r\n2. If you want to revert the patching, please go to Control Panel --&gt Programs and Features --&gt View installed updates, un-install KB4135110 under “Microsoft ® HPC Pack 2016 Client Components” then reboot;<br/>\r\n\r\n\r\n\r\n",
    "relatedResourcesSection": [
        {
            "title": "windows HPC TechNet site",
            "url": "http://go.microsoft.com/fwlink/?LinkID=263697"
        },
        {
            "title": "windows HPC Home Page",
            "url": "http://www.microsoft.com/hpc"
        },
        {
            "title": "hpc Pack Forum",
            "url": "https://social.microsoft.com/Forums/en-US/home?category=windowshpc"
        }
    ],
    "locale": "en-us",
    "detailsId": "56964",
    "downloadPreload": true
}